{
  "iconLink": "/assets/agency_icons/minopex.png",
  "title": "minopex",
  "blogPosts": [
    {
      "jobTitle": "Business Unit Manager",
      "publishedDate": "Published 08 October 2024",
      "expiryDate": "Closing Date: 15 October 2024",
      "location": "Rustenburg, North West",
      "details": [
        "\n        <h1>Job Details</h1>\n    ",
        "\n        <div class=\"col-md-6\">\n            <div class=\"col-md-6\">\n\n                    <div class=\"row padding-bottom-10\">\n                        <label class=\"job-detail-bold-header\" for=\"Vacancy_DivisionName\">Division</label>\n                        <label for=\"\">Quality Laboratory Services (Pty) Ltd</label>\n                    </div>\n\n\n\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"MinimumExperience\">Minimum experience</label>\n                    <span><label for=\"Mid-Senior\">Mid-Senior</label></span>\n                </div>\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"CompanyPrimaryIndustry\">Company primary industry</label>\n                    <span></span><label for=\"Mining_and_Metals\">Mining and Metals</label>\n                </div>\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"FunctionalAreaName\">Job functional area</label>\n                    <span><label for=\"Mining\">Mining</label></span>\n                </div>\n\n            </div>\n            <div class=\"col-md-6\">\n                                            </div>\n        </div>\n\n\n    ",
        "\n        <div class=\"heading-blue\">\n            <h1>Job Description</h1>\n        </div>\n        <div class=\"vacancy-description\"><strong>Introduction </strong><br><br>This position will be based at Quality Laboratory Services based in Rustenburg.<br><br><strong>Description</strong> <br><br>The purpose of this role is to ensure effective and efficient leadership of the QLS business within the Minopex Group and to maintain sound stakeholder relations which support sustainable growth and continuity of operations. The role will include collaborating with other businesses within the group, as well as various departments and functions, to ensure effective and efficient delivery of quality laboratory services to all clients. The role will require local and international travel to various operational sites on a needs basis to manage the operations and quality assurance processes within multiple laboratory locations. This role ensures that all lab services meet regulatory standards, company policies, and client expectations. The Business Unit Manager will lead a team of scientists, lab technicians and quality specialists, drive continuous improvement initiatives, and maintain high standards of safety and compliance.<br><br><strong>Duties and Responsibilities</strong> <br><br><strong>&nbsp; Leadership and Management:</strong><br><ul><li>Supervise and mentor a team of lab managers, technicians, and quality specialists across multiple locations.</li><li>Foster a culture of service, quality, safety, and continuous improvement.</li><li>Conduct regular performance reviews and provide feedback to staff.</li><li>Drive performance to agreed budgets.</li><li>Set budgets for QLS and each laboratory.</li></ul><br><strong>Quality Assurance</strong><br><ul><li>Oversee the quality performance of each laboratory.</li><li>Drive participation in proficiency testing schemes.</li><li>Maintain the quality standards within the assay technique and budget pricing.</li><li>Develop, implement, and monitor quality assurance policies and procedures.</li><li>Ensure compliance with all relevant regulatory standards (e.g., ISO 17025, GMP, GLP).</li><li>Conduct regular audits and inspections of lab facilities to ensure adherence to quality standards.</li><li>Investigate and resolve quality issues or non-conformities</li></ul><br><strong> Operational Management</strong><br><ul><li>Oversee the daily operations of laboratory services, ensuring efficient and effective workflows.</li><li>Coordinate with other departments to ensure seamless integration of lab services with overall company operations.</li><li>Manage budgets, resources, and inventory for lab operations.</li><li>Ensure the financial viability of each laboratory.</li><li>Support laboratory management in operational matters.</li><li>Mentor and develop subordinates.</li><li>Market services and performance to customers and internal and external stakeholders together with the BD department.</li><li>Maintain strict operating protocols to ensure safe operations and compliance with analytical techniques.</li><li>Design, set up and commission mobile and fixed laboratories.</li><li>Creation of management reports for the group and QLS board.</li><li>Laboratory audits, both internal and external</li></ul><strong>Continuous Improvement:</strong><br><ul><li>Identify opportunities for process improvements and implement best practices.</li><li>Lead projects aimed at enhancing lab service quality and efficiency.</li><li>Stay current with industry trends, technologies, and advancements in quality management.</li><li>Research new techniques and equipment that can lead to more efficient service delivery.</li><li>Drive a reduction of cost and an improvement in productivity</li></ul><br><strong>Qualification Requirements</strong> <br><ul><li>Bachelor’s Degree / Higher National Diploma in Analytical Chemistry, or a related field. Advanced degree preferred.</li><li>Postgraduate Business Management qualification will be advantageous.</li><li>Strong knowledge of regulatory standards (e.g., ISO 17025, GMP, GLP).</li><li>Proven experience in managing multi-site operations and leading teams.</li><li>Excellent communication, organizational, and problem-solving skills.</li><li>Ability to work effectively in a fast-paced, dynamic environment.</li><li>Proficiency in quality management software and laboratory information management systems (LIMS).</li><li>Computer literate in MS Office.</li></ul><br><strong>Experience and Skills&nbsp;Requirements</strong> <br><ul><li>Minimum of 10 years of experience in a management role within an analytical laboratory.</li><li>At least 10 years of processing/engineering technical experience in a certified assay laboratory.</li><li>A minimum of 5 years’ experience as a Laboratory Manager is required.</li><li>Management experience at Enterprise or Business Unit level (essential).</li><li>Vast knowledge of multiple assay techniques for multiple chemical elements and experience in a contracting/service environment.</li><li>Consulting and design experience in laboratories and laboratory flow is required.</li><li>Strong business acumen.</li><li>Knowledge of legal compliance and technical risk management.</li><li>Knowledge of maintenance requirements for laboratory equipment.</li><li>Presentation skills, employee relations, and people management skills.</li><li>Time management and administrative and financial management skills.</li></ul><br><strong>&nbsp;</strong><br><br><br><br><br></div>\n            <div class=\"vacancy-apply-btn margin-bob-30\">\n<a class=\"btn btn-primary\" href=\"https://minopex.simplify.hr/Vacancy/Apply/jynzie\" rel=\"nofollow\">Apply</a>            </div>\n    "
      ],
      "apply": "https://minopex.simplify.hr/Vacancy/Apply/jynzie",
      "iconLink": "/assets/agency_icons/minopex.png",
      "uuid": "p47747090-be38-4dc6-8bd8-c5ca66f4504d"
    },
    {
      "jobTitle": "Laboratory Supervisor",
      "publishedDate": "Published 16 September 2024",
      "expiryDate": "",
      "location": "Tanzania, Tanzania",
      "details": [
        "\n        <h1>Job Details</h1>\n    ",
        "\n        <div class=\"col-md-6\">\n            <div class=\"col-md-6\">\n\n                    <div class=\"row padding-bottom-10\">\n                        <label class=\"job-detail-bold-header\" for=\"Vacancy_DivisionName\">Division</label>\n                        <label for=\"\">Quality Laboratory Services (Pty) Ltd</label>\n                    </div>\n\n\n\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"MinimumExperience\">Minimum experience</label>\n                    <span><label for=\"Associate\">Associate</label></span>\n                </div>\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"CompanyPrimaryIndustry\">Company primary industry</label>\n                    <span></span><label for=\"Mining_and_Metals\">Mining and Metals</label>\n                </div>\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"FunctionalAreaName\">Job functional area</label>\n                    <span><label for=\"Mining\">Mining</label></span>\n                </div>\n\n            </div>\n            <div class=\"col-md-6\">\n                                            </div>\n        </div>\n\n\n    ",
        "\n        <div class=\"heading-blue\">\n            <h1>Job Description</h1>\n        </div>\n        <div class=\"vacancy-description\"><strong>Introduction</strong> <br>This position will be based at Quality Laboratory Services (QLS), Tanzania.<br><br><strong>Description</strong><br>This position is to be responsible for the efficient running and proper supervision of the Shift to ensure the receiving, preparation, analyses and dispatching of samples according to Laboratory processes and Client standards..<br><br><strong>Duties and Responsibilities</strong> <br>• Follow the correct chemical control measures at all times and ensure accurate reagent stock counting to assist in accurate metal accounting<br>• Perform routine preparation of samples (crushing, pulverizing, filtering, rolling, splitting and drying)<br>• Logging and receiving of samples on the Laboratory Information Management System (LIMS)<br>• Marking and labelling of sample tags and sample containers<br>• Storing of samples according to specifications and colour codes<br>• Disposing of redundant ore samples<br>• Effective determination of particle size distribution<br>• Effective determination of moisture content of different feed streams<br>• Perform friability analyses on geological samples when required<br>• Perform sieve sizing analyses on samples<br>• Perform moisture analyses on samples<br>• Ensure detailed traceable records of all test work done<br>• Conduct daily pre-use checklists before operating moving machinery and report sub-standard equipment immediately to ensure optimized functionality of all lab equipment at all times<br>• Perform administrative duties to ensure record accuracy and availability at all times<br>• Compile neat and accurate dispatch sheets, checklists and registers and ensure distribution according to organizational requirements<br>• Responsible for ensuring optimized functionality of all lab equipment at all times<br>• Compile various production reports and ensure distribution according to organizational requirements. <br>• Adhere to quality requirements, verifications, calibrations, certifications of equipment<br><br><strong>Qualification Requirements<br></strong>• Degree or Diploma in Analytical Chemistry would be advantageous. <br>• Computer Literate in MS Office<br>• Valid driver’s licence code B, EB or C1<strong><br><br></strong><strong>Experience and Skills&nbsp;Requirements</strong><br>• 3 years’ experience as a Sampler performing basic sample preparation in a laboratory is required<br>• Knowledge and good understanding of the basic concepts of sample preparation, e.g. contamination, representative sample and integrity of a sample<br>• Knowledge of Laboratory Equipment<br>• Knowledge and experience in the Fire Assay method for Gold Assays<br>• Knowledge and experience working on an Atomic Absorption instrument<br>• Knowledge of the chemical composition, structure, and properties of substances and of the chemical processes and transformations that they undergo. This includes uses of chemicals and their interactions, danger signs, production techniques, and disposal methods<br>• Supervisor experience<br>• Time management<br><br><br><br><br><br></div>\n            <div class=\"vacancy-apply-btn margin-bob-30\">\n<a class=\"btn btn-primary\" href=\"https://minopex.simplify.hr/Vacancy/Apply/yaqdji\" rel=\"nofollow\">Apply</a>            </div>\n    "
      ],
      "apply": "https://minopex.simplify.hr/Vacancy/Apply/yaqdji",
      "iconLink": "/assets/agency_icons/minopex.png",
      "uuid": "p74cf1ff6-4b6e-442b-889f-bab749b11511"
    },
    {
      "jobTitle": "Maintenance Planner",
      "publishedDate": "Published 06 September 2024",
      "expiryDate": "",
      "location": "Saudi Arabia, Saudi Arabia",
      "details": [
        "\n        <h1>Job Details</h1>\n    ",
        "\n        <div class=\"col-md-6\">\n            <div class=\"col-md-6\">\n\n                    <div class=\"row padding-bottom-10\">\n                        <label class=\"job-detail-bold-header\" for=\"Vacancy_DivisionName\">Division</label>\n                        <label for=\"\">DRA Saudi Arabia LLC</label>\n                    </div>\n\n\n\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"MinimumExperience\">Minimum experience</label>\n                    <span><label for=\"Mid-Senior\">Mid-Senior</label></span>\n                </div>\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"CompanyPrimaryIndustry\">Company primary industry</label>\n                    <span></span><label for=\"Mining_and_Metals\">Mining and Metals</label>\n                </div>\n                <div class=\"row padding-bottom-10\">\n                    <label class=\"job-detail-bold-header\" for=\"FunctionalAreaName\">Job functional area</label>\n                    <span><label for=\"Mining\">Mining</label></span>\n                </div>\n\n            </div>\n            <div class=\"col-md-6\">\n                                            </div>\n        </div>\n\n\n    ",
        "\n        <div class=\"heading-blue\">\n            <h1>Job Description</h1>\n        </div>\n        <div class=\"vacancy-description\"><strong>Introduction <br></strong>This position will be based at the Mansourah Massarah Project in Saudi Arabia on an 8/4 rotation schedule. <strong> &nbsp;<br> &nbsp; <br>Description <br></strong>The purpose of this position is to manage the Engineering Planning office to ensure minimum downtime using the Pragma On Key Computerized Maintenance Management System . &nbsp;<br><strong> <br>Duties and Responsibilities<br></strong><br>• The Maintenance Planner coordinates and monitors all engineering maintenance and planning activities relating to the Technical and Metallurgical processes within the Plant <br>• Complement planned work by gathering critical information (resources, spares and tools arranged) for effective and safe execution <br>• Continually evaluate and motivate critical spares to support equipment reliability during its life cycle <br>• Actively assist in managing the work backlog <br>• The job holder is responsible for establishing and maintaining an accurate and comprehensive asset register, the incumbent is also responsible for managing the plant critical spares in collaboration with Engineer and materials controller <br>• The job holder is also responsible for the administration of these activities to make a positive contribution to the attainment of the Operation strategic objectives <br>• Key to this position is the participation in team activities and acceptance of accountability for his/her personal role which will assure alignment with the engineering department’s quest for technical excellence <br>• The Maintenance planner is responsible for the planning of responsibilities with the Engineer. Organising and controlling is done with the relevant Foreman and Process personnel to ensure an efficient workflow <br>• He/she is also responsible to create a work environment in which all can perform to their full potential <br>• The incumbent executes a variety of activities and works to strict standards and procedures and is accountable for proper office management <br>• Coordinate with subordinates to provide coverage during sick leave or vacation <br>• In order for the Maintenance Planner to contribute towards the safe and efficient achievement of set production targets, he/she will responsible to: <br>• Compile and maintain computerized asset plan to ensure that it is up to date at all times <br>• Provide asset reports to the Plant Engineer on a periodical basis and as required <br>• Compile requisitions as and when necessary to ensure that special equipment is in stock for work required <br>• Conduct in-depth root cause analysis and report the findings thereof to the Plant Engineer when major failures occur <br>• Compile monthly reports from CMMS (Computerized Maintenance Management) system and submit to respective parties <br>• Compile ad hoc reports as and when required by management or the client <br>• Optimize scheduled tasks based on historical plant equipment failures <br><br><br><strong> Experience and Skills&nbsp;Requirements <br></strong>• Expert knowledge of and training in the maintenance module ORACLE or other similar maintenance module. <br>•&nbsp;Minimum 5 years’ experience in a Maintenance Planning role<br>• English Language Proficiency&nbsp;<br>• Computer literate in MS Office – Excel, Word, Power point, MS Projects <br>• Relevant planned maintenance system training, ORACLE would be an advantage <br>• Sound knowledge of Mining Engineering Codes of practices, policies and procedures. <br>• A good knowledge of machinery and equipment used on the relevant operations <br>• Understanding of engineering best practices and new technologies relating to engineering principles &amp; processes <br>• Proven technical and maintenance capability <br>• Sound knowledge of Condition Monitoring practices<br>• Good working knowledge of Reliability-Centered Maintenance principles will be very advantageous <br>• Minerals Process Plant experience would be an advantage <br>• Experience in project planning and scheduling to include shut down planning in projects<br><br><strong>Qualification Level</strong> <br>• Grade 12 or Equivalent <br>• Relevant Trade Test Certificate with 5 years’ experience as an Artisan and 2 years’ experience as a Foreman; or<br>• National Diploma Engineering with at least 5 years process plant experience<br><strong> <br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong><br></div>\n            <div class=\"vacancy-apply-btn margin-bob-30\">\n<a class=\"btn btn-primary\" href=\"https://minopex.simplify.hr/Vacancy/Apply/npjijk\" rel=\"nofollow\">Apply</a>            </div>\n    "
      ],
      "apply": "https://minopex.simplify.hr/Vacancy/Apply/npjijk",
      "iconLink": "/assets/agency_icons/minopex.png",
      "uuid": "pf1e263cd-9549-4368-88a6-72fea762331f"
    }
  ]
}
