{
  "iconLink": "/assets/agency_icons/pro-personnel.jpg",
  "title": "pro-personnel",
  "blogPosts": [
    {
      "jobTitle": "Technician",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", JHB - Central",
        "region": "Gauteng"
      },
      "details": "Experience and requirements:* Must have a valid trade certificate as an Electrician* Must have a valid driver's license* Must have knowledge and experience in plumbing, electrical and maintenance of electrical equipment.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002560-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pcc7ceb71-f33f-472e-8785-94288efd8738"
    },
    {
      "jobTitle": "Hire Controller",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Admin, Office &amp; Support",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Requirements\n\nMust have Matric\nMust have valid Driver's License\nMust be Computer literate\nMust be willing to do sales\n\nSalary - R12K",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002562-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p2c971a8d-f303-45df-8291-407984f214ef"
    },
    {
      "jobTitle": "Technical Sales Consultant",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Hygiene",
      "location": {
        "city": ", JHB - Central",
        "region": "Gauteng"
      },
      "details": "Educational Requirements:* Grade 12* Technical diploma or equivalent and sales and marketing qualification will be beneficial* Must be computer literate* Must have a valid drivers licenseWork Experience:* 2-4 years' experience in a technical service or sales position in the chemical cleaning industry* Knowledge and experience of technical systems, equipment, food processing and poultry plants for the chemical industry will be beneficial.Duties would be but not limited to:* Achieving sales budget by presenting and selling company products and services to preidentified customers* Develop, maintain and expand current customer base through building a harmonious and service orientated relationship with clients* Conducting titration tests as and when required as per service level agreements* Plot the results on a trend and communication with customers* Oversee and facilitate product delivery and equipment installation* Explain complex technical information to customers in a way that is easily understandable* Compiling proposals and reports related to technical products* Implementation and adherence to company policies and procedures* Preparing monthly reports and monthly meetings with management outside of normal meetings&nbsp;Core Competencies:* Communication* Work standards* Tolerance for stress* Energy* Administrative orientation* Integrity* Sales ability* Rapport building* Customer service* Quality of work* Team player* Problem solver",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002556-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p8017bd13-7f1d-433d-84fb-44120b27e81d"
    },
    {
      "jobTitle": "Sales Consultant",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Retail",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Working Experience:* Minimum of 5 years' experience in sales and marketing in related field* Knowledge and experience of technical systems and equipment for the chemical industry will be a added advantage* Knowledge of hygiene systems will be beneficial* Knowledge of basic business principalsProven ability to achieve sales targets and increase market shareEducational Requirements:* Minimum Grade 12* Degree and or diploma in sales, marketing* Computer literate in MS Suite* Valid driver's license essentialCore Competencies:* Communication* Work standards* Tolerance for stress* Energy* Initiative* Admin Orientation* Integrity* Sales ability / persuasiveness* Rapport Building* Negotiation* Independance* Oral Fact Finding* Goal driven",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002558-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p75679999-8f3c-4b7f-b608-7d35d312fb87"
    },
    {
      "jobTitle": "Technician",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Ekurhuleni",
        "region": "Gauteng"
      },
      "details": "Requirements\n\nMust be a qualified electrician, must know a bit of plumbing.\nMust be able to do training on and maintaining equipment – dishwasher pumps, dosing pumps and the like.\n\nEducation\n\nMust have relevant qualifications, Diploma in Electrical Engineering\nMust have Matric\nValid Driver's License\nTroubleshooting and Fault-finding\nData Analysis\nReport Writing\nProficiency in Microsoft Office (word, Excel, Outlook, and PowerPoint)\nGood Interpersonal Skills\nProteus 8 and MATLAB Software\nProject Management\nPrinted Circuit Board\nVariable Speed Controllers\nOccupational Health and Safety\nStrong Organisational and Administrative skills\nServices, Repair and Maintenance\nExcellent knowledge of CMMS systems e.g. SAP, ERP, POM etc.\nData Analysis, Data Availability, Data Quality\nTechnical Support\nWind Farms and Solar Farms (Renewable Energy)\n\nProfessional Experience\n\nProviding Technical Support to the Maintenance team (Artisans, Technicians, Engineers and Planners)\nReport and Document result after services, repair, and project work.\nInstall, repair, inspect and Commission products and equipment on the printing machinery and its auxiliary supporting system.\nOversee and assist with project on site as per the Maintenance Engineers instructions\nPreparation of tools before and after service, repairs, and installation\nHousekeeping after maintenance work\nAttend to breakdown and do electrical troubleshooting and Root Cause analysis, which included HMI's, PLC controlled system and field devices and its hard wiring.\nAdhere to health and safety protocol as specified by the company's rules and regulation.\nAttend electrical workshops and trainings\n\nSalary - R23K per month (includes a company car, petrol card with a limit of R4000 and a company cellphone).",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002561-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p209c644c-d66f-4952-8029-ec1e3930a97d"
    },
    {
      "jobTitle": "Technical Sales Consultant",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Hygiene",
      "location": {
        "city": ", Ekurhuleni",
        "region": "Gauteng"
      },
      "details": "Educational Requirements:\n\nGrade 12 (Matric) or Equivalent\nTechnical Diploma or equivalent and Sales and Marketing qualification will be beneficial.\nComputer Literate\nValid code 08 Drivers License (Unendorsed)\n\nWork Experience and Core Competency Requirements:\n\n2 – 4 years’ experience in a Technical Service or Sales position in the chemical cleaning industry.\nTraining Experience Beneficial.\nKnowledge and Experience of technical systems, equipment, food processing and poultry plants for the chemical industry will be beneficial.\n\nDuties: (Summarised)\n\nAchieving Sales Budget by presenting and selling company products and services to pre-identified customers\nDevelop, Maintain and Expand current Customer base through building a harmonious and service orientated relationship with clients.\nIdentify and resolve customer queries and concerns.\nManage account services through quality checks.\nConduct on site client training as and when required.\nResponsible for Regular Wash Audits.\nTaking of swabs and give feedback as and when required.\nConducting titration tests as and when required as per service level agreement (if in place)\nResponsible for placing of orders of customers.\nFollow up and feedback to the customers on all queries (deliveries, orders, credits, customer complaints).\nResponsible for ensuring the customer complaints are handled timeously and feedback on outcomes is communicated with the customer.\nPlot the results on a trend and communicate with the customer.\nAct as liaison in the coordination of information and services between the customer and business.\nConduct installation, inspection, maintenance and repairs to equipment.\nOversees and facilitates product delivery and equipment installation.\nEstablishing the technical needs of the customer and suggesting appropriate products.\nExplaining complex technical information to customers in a way that is easily understandable.\nKeeping customers informed about new technological products and solutions.\nCompiling proposals and reports related to technical products.\nEnhance new business development within the existing customer base, by providing solutions and introducing new products and or enhanced solutions.\nDrafting and presenting of quotations and proposals.\nContinuously build relationships and promote the company to create an awareness in the marketplace.\nRegular marketing activities to build and maintain customer relationships.\nContinuous evaluation of customer to identify needs, recommending and implementing solutions to ensure customer satisfaction.\nRegular customer feedback on corrective actions implemented for noted deviations.\nEnsure personal growth and development by continuous self- analysis and attending enrichment. programs (Time Management, Communication skills, presentation skills, technical skills, product knowledge, market research and knowledge of competitors etc.).\nImplementation and adherence to company policies and procedures.\nReporting on sales activities, submission of daily, weekly and monthly reports and proposals as per the measurement criteria as stipulated.\nSubmission of customer documentation as required.\nPreparing of monthly reports and monthly meetings with management outside of formal meetings\nRegular written communication confirming activities to all growers and respective management.\nEstablishing trends and graphs of water micro or surface swab results monthly per customer.\n\nCore Competencies\n\nCommunication (Listening, oral, oral presentation, written)\nWork Standards (Setting high goals or standards of performance for self and organization)\nTolerance for Stress (perform under pressure)\nEnergy (maintain a high activity level)\nAdministrative Orientation (personal satisfaction from administrative performance and responsibilities, taking pride in admin work submitted internally or externally)\nIntegrity (maintaining social, ethical and organizational norms in job)\nSales Ability/Persuasiveness (utilizing appropriate interpersonal styles and methods of communication to gain agreement or acceptance of an idea, plan, activity or product from clientele)\nRapport Building (initial and continuing impact. The ability to meet people easily and to be liked; to get along well with people and to put them at ease; and to quickly build rapport through proactive development of close relationships)\nNegotiation (communicate data or arguments in a manner that gains agreement or acceptance)\nCustomer Service: (Listens and responds effectively to customer questions: resolves customer problems to the customers satisfaction; commit to exceed customer expectations)\nQuality of work: (Maintains high standards despite pressing deadlines: does work right the first time: corrects own errors: regularly produces accurate, thorough, professional work)\nResilience (handling disappointment and rejection while maintaining effectiveness)\nIndependence (taking action on one’s own rather than the influence of others\nOral Fact finding (gathering information for decision-making through questioning)\nProfessional Proficiency (level of performance in professional area)\nSelf-development Orientation (initiates action to improve skills and performance)\nTeam player (willingness to assist fellow colleagues in the field to ensure the company vision and goal is achieved)\nProblem solving (attempts to get solutions to problems being faced with before seeking out for help)\n\nSalaryMonthly CTC around R30K with provident fund, company vehicle, company cellphone",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002557-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p87733843-a08d-44df-ac59-5cb531b705f9"
    },
    {
      "jobTitle": "Sales Consultant – Mining",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "General Description Of Areas Of Responsibility\n\nTo plan and carry out all sales activities on assigned accounts or areas. Responsible to promote and sell products and services to customers to meet and exceed their needs.&nbsp; To develop and maintain a customer base and sales within the various target markets.&nbsp; To ensure continuous development and expansion of new business to ensure economic business growth.\n\nSales and Marketing\n\nAchieving Sales Budget by Presenting and selling company products and services to pre identified prospects.\nPrepare action plans and schedules to identify specific targets and to project the number of contacts to be made.\nFollow up on new leads and referrals resulting from field activity.\nIdentify sales prospects and contact these and other accounts as assigned.\nNBD Pipeline and target to be achieved monthly\nPrepare presentations, proposals and sales contracts.\nDevelop and maintain sales materials and current product knowledge.\nEstablish and maintain key client and potential client relationships. &nbsp;\nPrepare paperwork to activate and maintain contract services.\nManage account services through quality checks and other follow-up&nbsp;\nIdentify and resolve client concerns.\nPrepare a variety of status reports, including activity, closings, follow-up, and adherence to goals.\nCommunicate new product and service opportunities, special developments, information, or feedback gathered through field activity to appropriate company staff.\nDevelop and implement special sales activities to reduce over stock issues.\nParticipate in marketing events such as seminars, trade shows, and telemarketing events.\nFollow-up and assist Service Consultants and Finance department for collection of payment for troubled accounts\nProvide on-the-job training to new sales employees\n\nSkills Development\n\nEnsure personal growth and development by continuous self analysis and attending enrichment programs (Time Management, Communication skills, presentation skills, selling and closings skills, customer service orientation, etc) and functional training. (technical skills, product knowledge, market research and knowledge of competitors, global trends etc)\n\nAdministration\n\nApplication and adherence to Company Policies and Procedures\nReporting on sales activities including proposals and submission of daily, weekly and monthly reports and proposals as per the measurement criteria as stipulated\nAssist with the Initial Design and implementation of Cleaning Programs, SOPs, and reporting systems for new accounts as required\nCommunication with internal departments with regards to New Accounts, product forecasting, account setup and Distribution requirements\n\nService and Retention of Customers\n\nCall on clients according to the allocated accounts and servicing of the current customer base\nRetain and Expand current Customer base through maintaining a harmonious and service orientated relationship with clients, and introducing products on a regular basis\n\nMaintenance and installation of equipment\n\nEquipment installations\nMaintenance and repairs to equipment\nTroubleshooting, dosing units and dispensing system.\nEnsure preventative maintenance, by servicing, testing and troubleshooting on various equipment.\nResponsible for cleaning and restoration of equipment that was returned from lost accounts\nPrepare, Maintain and repair Equipment that is stock and at Depot Storerooms\n\nWork Experience Requirements\n\nMinimum of 5 years experience in Sales and Marketing in a related field\nKnowledge and Experience of Technical Systems and Equipment for the chemical Industry will be an added advantage\nKnowledge of Hygiene Systems will be beneficial\nKnowledge of Basic Business principles\nProven ability to achieve sales targets and increase market share\n\nEducation Requirements\n\nMinimum Grade 12 and or NQF equivalent\nDegree and/or Diploma in Sales, Marketing will be an added advantage\nComputer Literate in Microsoft Office Suite\nValid Code 8 Drivers License\n\nCore Competencies\n\nCommunication (Listening, oral, oral presentation, written)\nWork Standards (Setting high goals or standards of performance for self and organization)\nTolerance for Stress (perform under pressure)\nEnergy (maintain a high activity level)\nInitiative (self starting, take action to achieve goals beyond what is necessarily called for)\nAdministrative Orientation (personal satisfaction from administrative performance and responsibilities\nIntegrity (maintaining social, ethical and organizational norms in job)\nSales Ability/Persuasiveness (utilizing appropriate interpersonal styles and methods of communication to gain agreement or acceptance of an idea, plan, activity or product from clientele and excellent deal closing abilities)\nRapport Building (initial and continuing impact. The ability to meet people easily and to be liked; to get along well with people and to put them at ease; and to quickly build rapport through proactive development of close relationships with various personality and cultural types)\nNegotiation (communicate data or arguments in a manner that gains agreement or acceptance)\nResilience (handling disappointment and rejection while maintaining effectiveness)\nIndependence (taking action on one’s own rather than the influence of others\nOral Fact finding (gathering information for decision-making through questioning)\nProfessional Proficiency (level of performance in professional area)\nSelf development Orientation (initiates action to improve skills and performance)\nAbility to persuade and influence others.\nAbility to develop and deliver presentations.\nAbility to create, compose, and edit written materials.\nStrong interpersonal skills.\nGoal driven\nTolerance to stress\n\nSalary - R23K per month (includes a company car, petrol card with a limit of R4000 and a company cellphone).  ",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002559-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p99f92e83-7903-40a5-858d-aed9129e67f7"
    },
    {
      "jobTitle": "Lab Technician",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Petroleum &amp; Oil",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Qualifications:* Must have a valid driver's license* Minimum of a diploma or Bachelor's degree in Chemistry, Microbiology, Environmental Science, Biochemistry or a related scientific discipline* Previous experience working in a Laboratory environment, preferably in a biogas waste water treatment or similar industrial process.Skills:* Technical Skills- Proficiency in laboratory techniques such as a titration, spectrophotometry and gas chromatography- Familiarity with anaerobic digestion processes and biogas production wil be advantage- Experience in data analysis and report generationSoft Skills:- Strong attendtion to detail and accuracy in recording and analysis data- Good Communications skills for reporting findings to the plant manager and operations teamResponsibilities:* Sample Collection* Process Monitoring&nbsp;* Data Recording and Reporting* Quality Control* Research and Development Support* Safety Compliance",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002563-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p0824efdb-e02d-4eb8-92a8-67e3539e3d1d"
    },
    {
      "jobTitle": "Lab Technician",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Petroleum &amp; Oil",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Qualifications:\n\nDrivers License\nMinimum of a Diploma or Bachelor’s degree in Chemistry, Microbiology, Environmental Science, Biochemistry, or a related scientific discipline.\nPrevious experience working in a laboratory environment, preferably in a biogas, wastewater treatment, or similar industrial process.\n\nSkills:Technical Skills:\n\nProficiency in laboratory techniques such as titration, spectrophotometry, and gas chromatography.\nFamiliarity with anaerobic digestion processes and biogas production is advantageous.\nKnowledge of COD, BOD, pH, and biogas analysis techniques.\nExperience in data analysis and report generation.\n\nSoft Skills:\n\nStrong attention to detail and accuracy in recording and analysing data.\nGood communication skills for reporting findings to the plant manager and operations team.\nAbility to work independently and as part of a team.\nStrong problem-solving skills, particularly in troubleshooting process deviations.\n\nResponsibilities:Sample Collection and Analysis\n\nCollect samples from feedstock, digester, and effluent for laboratory analysis.\nPerform routine testing of chemical and biological parameters such as pH, Chemical Oxygen Demand (COD), Volatile Fatty Acids (VFA), Total Solids (TS), Volatile Solids (VS), Total Kjeldahl Nitrogen (TKN), and Ammonia.\nAnalyse gas composition (e.g., methane, CO₂, H₂S) in biogas using gas chromatographs or other appropriate instruments.\nProcess Monitoring\nMonitor the performance of the anaerobic digesters by analysing parameters like hydraulic retention time (HRT), organic loading rate (OLR), and bacterial activity.\nAssist in troubleshooting plant issues based on laboratory findings.\nConduct microbial assessments of the digester using techniques like microscopy or molecular biology (if applicable).\nData Recording and Reporting\nMaintain accurate records of laboratory results and input them into databases or plant management systems.\nGenerate daily, weekly, and monthly reports on plant performance, highlighting any deviations from expected parameters.\nAssist in preparing reports for regulatory compliance and audits.\nQuality Control\nEnsure that all laboratory testing is performed according to standard operating procedures (SOPs) and best practices.\nRegularly calibrate laboratory equipment and ensure equipment is functioning correctly.\nMaintain high standards of hygiene and safety in the lab, ensuring compliance with all health and safety regulations.\nResearch and Development Support\nAssist in process optimization studies by conducting experiments to assess new feedstocks, additives, or process changes.\nContribute to improving digester efficiency and biogas yield through detailed lab analyses.\nStay updated on new technologies and methodologies that can be applied to biogas plant operations.\nSafety and Compliance\nEnsure all safety protocols are followed when handling samples and working in the lab.\nParticipate in plant safety drills and contribute to maintaining a safe working environment.\nAssist in ensuring the plant complies with local and national environmental regulations and reporting requirements.\n\nSalary - R14 000 to R20 000 CTC",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002564-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p199dde28-09ef-4eba-bcd5-7dd6dbbe1d3f"
    },
    {
      "jobTitle": "Plant Operator",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Petroleum &amp; Oil",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Qualifications:* National senior certificate* Driver's license essential* Basic First Aaid &amp; Fire Firefighting&nbsp;Responsibilities:* Plant operation and Monitoring- The continuous monitoring (SCADA) and control of all operational parameters of the waste to value process plant- Operate process machinery- Record and log production figures, downtime events, maintenance vents- Visually monitor effluent and feed stream* Maintenance- Follow out preventative maintenance schedules on plant process equipment- Attend to breakdowns- Effective trouble shooting- Complete all checklists* Stock Control- Monitor raw materials usage and inform site manager- Manage spare parts* Laboratory- Conduct lab testing- Record and report schedules- Manage stock levels&nbsp;* Health &amp; Safety- Adhere to H&amp;S file- report incidents and near misses* Admin &amp; Supply Chain- Clock in and out- Overtime reconciliation- Manage office supplies",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002565-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p8ff1f9c7-d69c-47cb-a8d0-ab61c2451ac5"
    },
    {
      "jobTitle": "Plant Operator",
      "startDate": "2024-09-20 - 2024-10-20",
      "vacancyType": "Permanent",
      "jobSpecFields": "Petroleum &amp; Oil",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Qualifications:\n\nNational senior certificate (Matric/Similar)\nDrivers License\nBasic first aid &amp; firefighting preferred\n\nResponsibilities:Plant operation &amp; monitoring\n\nThe continuous monitoring (SCADA) and control of all operational parameters of the waste-to-value process plant\nOperate process machinery and equipment\nFollow start-up and shut-down procedures of both the entire plant and the individual process units\nRecord and log production figures, downtime events, maintenance events and anomalies in the operating parameters electronically\nReport critical production figures and process parameters in regular updates on messaging platforms\nVisually monitor effluent and feed streams\nEffluent and gas sampling\nReport all plant issues or parameter anomalies to the site manager\n\nMaintenance\n\nFollow out preventative maintenance schedules on plant process equipment\nAttend to breakdowns\nEffective troubleshooting (self and remotely with supplier)\nComplete equipment checklists\nMaintain housekeeping standards on the plant\nManage contractors that come to site\n\nStock Control\n\nMonitor raw materials usage and inform site manager when more stock is required\nManage spare parts stock\nEnsure storage areas are clean and organised\n\nLaboratory\n\nConduct lab testing accurately and safely\nRecord and report results\nManage stock levels of lab testing consumables and chemicals\nManage calibration of lab equipment (some can be done internally, some external)\nClean and maintain lab equipment\nCoordinate external lab testing\n\nHealth &amp; Safety\n\nAdhere to H&amp;S procedures\nUpkeep of H&amp;S file\nReport incidents and near-misses\nManage regular checks of safety equipment (fire equipment, spill kits, safety shower, etc.)\n\nAdmin &amp; Supply Chain\n\nClock in &amp; out\nOvertime reconciliation\nManage office supplies stock\nAssist with supply chain (contact suppliers, quote acquisition, recommendations, etc.)\n\nSalary -&nbsp; R14 000 to R18 000",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002566-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "peb76afe9-d38a-4635-a822-732674086bd6"
    },
    {
      "jobTitle": "Sales Rep",
      "startDate": "2024-09-19 - 2024-10-19",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Must have the following requirements:* Valid driver's license* Have own vehicle* Previous sales experience essential, would get preference if have signage experience* Must have previous sales rep experience within the mining environment* Clean criminal record* Excellent customer service and good communication skills* Must handle extreme pressure* self motivated and have a passion for sales",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002551-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p61bf7204-bb8b-44cc-a27c-f535900062b2"
    },
    {
      "jobTitle": "Graphic Designer",
      "startDate": "2024-09-19 - 2024-10-19",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Requirements:* Minimum of 5 years working experience as a Graphic Designer* Must be proficient in Adobe Suite* Full time office based&nbsp;* Must have own reliable transport* Must send CV with portfolioMain duties:* Social media designs, brochures, banners, emailers, electronic invites, printing of ads.* We will also assist with store design, some sort of experience with larger projects will be valuable* In need of a candidate that wants to grow with the company",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002554-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p82bbcf3a-3ecb-44ad-b554-64bd56b40b87"
    },
    {
      "jobTitle": "Graphic Designer",
      "startDate": "2024-09-19 - 2024-10-19",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Requirements\n\nMin 5 years experience\nMust be proficient in Adobe Suite\nMust have own transport\nCandidate must attach/ send their Portfolio\n\nDuties\n\nSocial media design, brochures, banners, emailers, electronic invites, print ads. We do also help our partners with store design so some sort of experience with larger projects like that would be valuable.\n\nSalary - between R27K - R28K CTC (Negotiable)",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002555-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pda325896-84ef-4a42-b0f0-825cdf84009e"
    },
    {
      "jobTitle": "Sales Representative",
      "startDate": "2024-09-19 - 2024-10-19",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Requirements\n\nValid driver’s license.\nOwn vehicle to visit clients (We provide a travel allowance and a petrol card for business purposes).\nPrevious experience as a sales representative is essential.\nKnowledge of the mining industry will be advantageous.\nClean criminal record.\nNeat, reliable, and organized.\nAbility to build and maintain strong relationships with clients.\nExcellent interpersonal skills.\nMust be able to work under pressure.\nSelf-motivated team player.\n\nSalary package:\n\nBasic salary: R10,000\nTravel Allowance: R3,000\nTelephone Allowance: R1,000\nPetrol card for business purposes.\n\nCommission structure: Very good.",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002552-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p5c790822-d60b-45eb-bd63-3ae962f47666"
    },
    {
      "jobTitle": "Graphic Designer",
      "startDate": "2024-09-19 - 2024-10-19",
      "vacancyType": "Permanent",
      "jobSpecFields": "Marketing",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Qualifications Required Minimum of 5 years of design experience in an in-house creative department or design agency. A National Diploma/Degree in Graphic Art/ Design&nbsp;or any related creative field. Formal training/certification in the use of Adobe’s Creative suite of programs or similar. Other software tools such Dreamweaver, HTML, CorelDraw or AutoCAD is a bonus. Basic understanding of HTML/CSS and web design.Portfolio must accompany applicationMain duties:&nbsp;Social media design, brochures, banners, emailers, electronic invites, print ads. We do also help our partners with store design so some sort of experience with larger projects like that would be valuable.Personal Attributes Strong creative, organisational, problem-solving, and time-management skills are essential for this role. The ideal candidate must be able to think critically and come up with unique design solutions that effectively communicate a message or idea. Adaptable and a quick learner. They must be able to apply style guides creatively and adapt to changes in design trends, client requirements, and project specifications. Possess strong conceptual skills, a high-level sense of design, layout, and typography, and be a broad thinker who is able to offer a variety of design solutions. They should be able to work collaboratively with other team members to create cohesive designs that meet project objectives. Excellent interpersonal and communication skills are a must, as the designer will be responsible for presenting their design concepts to clients, team members, and stakeholders. They should also be able to listen actively and take feedback constructively. The ideal candidate should be able to work well under tight deadlines in a team environment, managing multiple projects simultaneously and prioritising workload accordingly. They should be able to take projects from start to finish with minimal supervision, demonstrating a high level of attention to detail and producing accurate work with minimal revisions. Creative vision and thinking are key for this role. The ideal candidate should be able to identify and solve design problems, using their creativity and technical skills to develop effective solutions.",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002553-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p66d7875a-ec9f-4e46-bede-b53b1e92ea42"
    },
    {
      "jobTitle": "Boilermaker/Supervisor",
      "startDate": "2024-09-18 - 2024-10-18",
      "vacancyType": "Permanent",
      "jobSpecFields": "Construction",
      "location": {
        "city": ", Brits",
        "region": "North West"
      },
      "details": "Requirements:\n\nValid Boilermaker Trade Certificate.\nProven supervisory experience in a similar role.\nWillingness to work in both Boilermaker and Supervisor capacities as needed.\nValid driver’s license.\nAbility to work on sites or in workshops as required.\nMust be able to obtain a valid medical certificate.\nClean criminal record is essential.\n\nKey Responsibilities:\n\nPerform duties as a Boilermaker.\nTake on supervisory responsibilities when required, overseeing projects and team members.\n\nWhat We Offer:\n\nCompetitive salary and benefits.\nOpportunity to work on diverse projects.\nSupportive team and work environment.\n\nIf you meet the above criteria and are ready for a dynamic role, we want to hear from you",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002550-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pedadcd64-5a35-4eb0-8a6e-03c026f4a8e1"
    },
    {
      "jobTitle": "Area Supervisor",
      "startDate": "2024-09-16 - 2024-10-19",
      "vacancyType": "Permanent",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Duties would be but not limited to:* Managing teams and operations* Responsible for shift scheduling &amp; ensuring all employees are on site.* Administration duties will be required* Problem solverQualifications &amp; Requirements must be met:* Have a valid driver* Computer literate in MS Word &amp; Excel* Grade 12",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002481-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pc8f3732d-2b79-4101-b097-331686be656a"
    },
    {
      "jobTitle": "Assistant Accountant",
      "startDate": "2024-09-16 - 2024-10-19",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Experience:* Must have knowledge of the following:- SARS e-filing- SARS correspondence and registration- Salaries, payroll and reconciliation (VIP &amp; Easy file)- Knowledge of calculations and statements- EMP- Income tax statementsComputer knowledge in:* Pastel* Excel",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002520-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pa7cbc49d-d627-471f-8aa8-a3488072ca80"
    },
    {
      "jobTitle": "Process / Industrial Engineer",
      "startDate": "2024-09-12 - 2024-10-12",
      "vacancyType": "Permanent",
      "jobSpecFields": "Retail",
      "location": {
        "city": ", Parow",
        "region": "Cape Town"
      },
      "details": "Qualifications and Experience required:* Degree in Industrial Engineering* Recent graduate or ±2 years of experience as an Industrial Engineer* Experience in the retail industry is a plus* Project management experience* Familiarity with Lean and or Six Sigma methodologies is a advantage* Advanced computer skills (Google workspace, Looker Studio, SQL)Ability to work both independently and as part of a teamSouth African citizenshipDuties would be but not limited to:* Develop and present business cases* Lead and manage supply chain projects* Identify and drive continuous improvement initiatives* Map and developed process for effective data management* Create standard operating procedures (SOP's) for optimal business and system integration* Provide operational support by compiling, coordinating and publishing reports* Handle ad hoc duties and projects as requiredPlease send CV with certificates to yolanda@propersonnel.co.za",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002548-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p45be831e-3bd0-4728-80fe-ded34ac571a8"
    },
    {
      "jobTitle": "Senior Engineering Project Manager",
      "startDate": "2024-09-12 - 2024-10-12",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Primary Duties and Responsibilities:&nbsp;The Project Manager will need to oversee the planning, implementation and tracking of a number of projects with specified deliverables.Required Qualifications:\n\nRelevant degree/diploma in Electrical/Engineering/Technical/Construction discipline or equivalent\nProject Management Qualification (i.e. PMP, MBA or similar\n\nExperience and Knowledge:\n\n15+ years’ experience in related field\n8+ years’ experience in a Project Management Role\nMinimum 3 years of experience in the following:&nbsp;Engineering / Production / Construction / Quantity Surveyor / Project Management environment, Construction Management, Contractor Management, Mining and Process Plant and related operations environment\nProject Management\nMining, Process Plant, Logistics, Infrastructure, Quantity Surveyor , Enterprise Project Management Systems, e.g. MS-Projects, Primavera P6, Prism, SAP\nCommunicate Effectively: Speak, listen and write in a clear, thorough and timely manner using appropriate and effective communication tools and techniques\nCreativity/Innovation: Develop new and unique ways to improve operations of the organization and to create new opportunities\nFoster Teamwork: Work cooperatively and effectively with others to set goals, resolve problem, and make decisions that enhance organizational effectivenes\n\nKey Responsibilities:The Project Manager performs a wide range of duties including some or all of the following:\n\nPlan the project\nStaff the project\nImplement the project\nControl the project\nEvaluate the project\n\nPlan the Project\n\nDefine the scope of the project in collaboration with senior management\nCreate a detailed work plan which identifies and sequences the activities needed to successfully complete the project\nDetermine the resources (time, money, equipment, etc) required to complete the project\nDevelop a schedule for project completion that effectively allocates the resources to the activities\nReview the project schedule with senior management and all other staff that will be affected by the project activities; revise the schedule as required\nDetermine the objectives and measures upon which the project will be evaluated at its completion&nbsp;\n\nResource the Project\n\nIn consultation with the appropriate manager, recruit, interview and select project resources with appropriate skills for the project activities\nEnsure that all project personnel receive an appropriate orientation to the organization and the project\nManage project resources to deliver on agreed deliverables\nContract qualified consultants to work on the project as appropriate\n\nImplement the Project\n\nExecute the project according to the project plan\nMonitor the progress of the project and make adjustments as necessary to ensure the successful completion of the project\nEstablish a communication schedule to update stakeholders including appropriate staff in the organization on the progress of the project\nReview the quality of the work completed with the project team on a regular basis to ensure that it meets the project standards\n\nControl the Project\n\nCompile project reports\nMonitor and approve as per delegation of authority, all budgeted project expenditure\nMonitor cash flow projections and report actual cash flow and variance on a regular basis\nManage all project funds according to Anglo American Platinum policy, procedure and governance\nEnsure that all financial records for the project are up to date\n\nEvaluate the Project\n\nEnsure that the project deliverables are on time, within budget and at the required level of quality\nEvaluate the outcomes of the project as established during the planning phase\n\nCompetencies:&nbsp;\n\nCritical Thinking: Using logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems\nActive Learning: Understanding the implications of new information for both current and future problem-solving and decision-making\nBusiness knowledge: Good understanding of the organization and the business domain or sector within which it operates\nSystems Analysis: Understanding how a system should work and how changes in conditions, operations, and the environment will affect outcomes\nComplex Problem Solving: Identifying complex problems and reviewing related information to develop and evaluate options and implement solutions\nDeductive Reasoning: The ability to apply general rules to specific problems to produce answers that make sense\nInductive Reasoning: The ability to combine pieces of information to form general rules or conclusions (includes finding a relationship among seemingly unrelated events)\nExcellent communication skills: Ability to engage with high-level stakeholders, both verbal and non-verbal\nFlexibility and adaptability (crucial to consulting environment)\nOrganizational and leadership abilities\nInfluencing and motivating\nDecision making\nBuilding trust and long-term relationships with stakeholders\n",
      "contact": "Welma Helberg Nel",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002547-WHN",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pb36e6733-4c9b-4c3f-b6c2-c2fce2a64430"
    },
    {
      "jobTitle": "Junior Rep",
      "startDate": "2024-09-10 - 2024-10-10",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Requirements:* Must know the Rustenburg mining and surrounding areas very well.* Have a valid driver's license* Valid grade 12 certificate* Have a passion for sales and have excellent customer service* Outgoing personality and be able to communicate at all levels.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002543-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p735feb30-74e3-4c9a-94af-73b270127269"
    },
    {
      "jobTitle": "Junior Sales Representative",
      "startDate": "2024-09-10 - 2024-10-10",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Requirements:\n\n1-2 years’ experience in sales, specifically within the mining, construction, or engineering industries.\nProven ability to meet sales goals and generate new business.\nStrong communication and negotiation skills.\nA valid driver’s license is essential.\nAbility to work independently and as part of a team.\nWillingness to travel as required.\n\nKey Responsibilities:\n\nDevelop and manage relationships with key stakeholders in the mining, construction, or engineering sectors.\nIdentify new sales opportunities and follow up on leads.\nPresent and promote company products and services to existing and prospective customers.\nAchieve sales targets and contribute to the overall growth of the business.\nConduct market research to stay up-to-date with industry trends.\n\nEmployment Equity: In line with our client’s Employment Equity targets, preference will be given to Coloured or African male candidates.",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002544-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p60b7da26-d4f7-41cc-ab2e-c2d34d409bfd"
    },
    {
      "jobTitle": "Environmental Officer",
      "startDate": "2024-09-10 - 2024-10-10",
      "vacancyType": "Permanent",
      "jobSpecFields": "SHEQ",
      "location": {
        "city": ", Saudi Arabia",
        "region": "Saudi Arabia"
      },
      "details": "Key Responsibilities:\n\nEnsure compliance with environmental regulations, standards, and laws across all oil, gas, and construction operations.\nDevelop, implement, and monitor environmental management systems and policies.\nConduct regular site inspections and audits to assess environmental risks and impact.\nMonitor waste management, water, and air quality, ensuring all projects meet environmental safety standards.\nDevelop environmental impact assessments (EIAs) and suggest mitigation measures for new projects.\nProvide training and awareness programs for employees on environmental best practices.\nCoordinate with government agencies, regulatory bodies, and third-party consultants on environmental issues.\nPrepare reports and documentation for regulatory authorities and internal stakeholders.\nManage environmental emergencies such as oil spills, ensuring rapid and effective response.\n\nRequired Qualifications:\n\nBachelor's degree in Environmental Science, Environmental Engineering, or a related field.\n3+ years of experience in environmental management, preferably in the Oil, Gas, or Construction sector.\nStrong knowledge of environmental regulations, particularly related to oil and gas operations.\nExperience with environmental impact assessments and risk mitigation strategies.\nCertification in environmental management or safety practices is a plus.\n\n&nbsp;Skills and Competencies:\n\nExcellent analytical and problem-solving skills.\nAbility to communicate effectively with teams and external stakeholders.\nProficient in environmental reporting software and data analysis.\nStrong organizational skills and attention to detail.\nAbility to manage multiple projects simultaneously and meet deadlines.\n\nCandidates must be willing to work in Saudi Arabia&nbsp;As part of our Employment Equity Plan, preference will be given to Female candidates",
      "contact": "Welma Helberg Nel",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002545-WHN",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p408b8931-48d2-4d8f-be2b-252fa692fe23"
    },
    {
      "jobTitle": "Environmental Officer",
      "startDate": "2024-09-10 - 2024-10-10",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Saudi Arabia",
        "region": "Saudi Arabia"
      },
      "details": "Required Qualifications:* Bachelor's degree in environmental science, environmental engineering or related field.* 3± years of experience in environmental management, preferable in the Oil, Gas or Construction sector* Strong knowledge of environmental regulations, particularly related to oil and gas operations* Experience with environmental impact assessment and risk mitigation strategies* Certification in environmental management or safety practices is a plusSkills and Competencies:* Excellent analytical and problem solving skills* Ability to communicate effectively with teams and external stakeholders* Proficient in environmental reporting software and data analysis* Strong organizational skills and attention to detail* Ability to manage multiple projects simultaneously and meet deadlinesCVs with all relevant certificates can be send to yolanda@propersonnel.co.za",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002546-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pa5e440ca-3f3d-4c4c-b2b0-497dce0e0c46"
    },
    {
      "jobTitle": "Payroll Administrator",
      "startDate": "2024-09-04 - 2024-10-04",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Durban",
        "region": "KwaZulu Natal"
      },
      "details": "PRIMARY RESPONSIBILITIESVIP Premier Payroll Administration\n\nManage full payroll processing and reconciliation on VIP Premier for approximately 800 employees monthly, including leave management, benefits administration, staff engagements, terminations, and transfers.\nRecord staff deductions such as unpaid days, till shortages, and uniform costs.\nCalculate and input public holiday, overtime, and night shift allowances.\nHandle monthly payments to third parties and perform reconciliations.\nGenerate monthly reports according to departmental requirements.\n\nLeave Administration\n\nProcess, manage, and reconcile leave records on VIP Premier.\nCommunicate leave confirmations to employees.\n\nBenefits Administration\n\nHandle all correspondence related to provident fund and medical aid, including submitting amendment requests and withdrawals to relevant providers.\nPerform monthly reconciliations of provident fund and medical aid.\n\nGeneral HR Administration\n\nOversee onboarding for new hires, including documentation and policy management.\nCreate and maintain employee records.\nAddress HR and pay queries from employees.\nManage and initiate disciplinary actions.\nAdminister recruitment and selection processes, including handling responses, organizing interviews, and communicating with applicants.\nConduct ad hoc HR projects.\nPrepare UIF and maternity documentation as required.\nProcess casual and ad hoc payments to staff.\nAssist with disciplinary inquiries\n\nQUALIFICATIONS AND EXPERIENCE:\n\nGrade 12 (Matric)\nRelevant Qualification\nExperience with SAGE VIP\nGreat interpersonal and communication skills.\nExperience in Managing Large Teams\nStrong Knowledge of Payroll Processes\n",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002541-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p94cc12dd-7111-45b5-96ca-adca17703362"
    },
    {
      "jobTitle": "Payroll Administrator",
      "startDate": "2024-09-04 - 2024-10-04",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Durban",
        "region": "KwaZulu Natal"
      },
      "details": "Qualifications:\n\nGrade 12 (Matric)\nRelevant qualification\nExperience with SAGE VIP\nStrong interpersonal skills\nExperience in managing large teams\nIn-depth knowledge of payroll processes\n\nKey Responsibilities:\n\nPayroll Management: Oversee VIP Premier Payroll for 800 employees, including processing, reconciliation, leave management, and benefits administration.\nLeave &amp; Benefits Administration: Manage leave records, provident fund, and medical aid processes, ensuring accurate reconciliations and employee communication.\nHR Administration: Handle onboarding, employee records, HR queries, recruitment, and disciplinary actions.\n",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002542-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pc4209431-64b5-4179-9af4-916ba3d631c5"
    },
    {
      "jobTitle": "Occupational Hygienists",
      "startDate": "2024-09-03 - 2024-10-03",
      "vacancyType": "Permanent",
      "jobSpecFields": "Hygiene",
      "location": {
        "city": ", Middelburg",
        "region": "Mpumalanga"
      },
      "details": "Requirements needed:* Bachelor's degree in Occupational Hygiene, Environmental Health of related field* Certification as an Occupational Hygienist (SAIOH registered or equivalent)Experience:* Minimum 3-5 years working experience in occupational hygiene withing the mining industry.* In depth knowledge of South African mining health and safety regulationsDesirable Attributes:* Familiarity with mine verification systems and respirate protection programs* Experience with occupational hygiene monitoring equipment and software",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002539-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pf58cbf03-38b1-40c5-b32c-6a1f3a612fc9"
    },
    {
      "jobTitle": "Occupational Hygienists",
      "startDate": "2024-09-03 - 2024-10-03",
      "vacancyType": "Permanent",
      "jobSpecFields": "Hygiene",
      "location": {
        "city": ", Middelburg",
        "region": "Mpumalanga"
      },
      "details": "Requirements\n\nBachelors degree in Occupational Hygiene, Environmental Health, or related field.\nCertification as an Occupational Hygienist (SAIOH registered or equivalent)\nMinimum of 3-5 years of experience in Occupational Hygiene within the mining industry.\nIn-depth knowledge of South African mining Health and Safety regulations.\n\nDesirable Attributes\n\nFamiliarity with mine ventilation systems and respiratory protection programs.\nExperience with Occupational Health risk assessments and incident investigations.\nProficiency in using Occupational Hygiene monitoring equipment and software.\n",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002540-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p5a41053a-e322-405b-aca2-91ca7a5c42d9"
    },
    {
      "jobTitle": "RESEARCH PHYSICIAN / PRINCIPAL INVESTIGATOR",
      "startDate": "2024-09-01 - 2024-09-30",
      "vacancyType": "Permanent",
      "jobSpecFields": "Medical",
      "location": {
        "city": ", Brits",
        "region": "North West"
      },
      "details": "Required / Expected Competencies:\n\nRegistered doctor with MBChB and 2+ years’ clinical research experience.\nCurrent HPCSA registration and medical malpractice insurance.\nStrong knowledge and skills in general medical practice.\nEffective decision-making and collaboration skills.\nThorough knowledge of ICH GCP.\nMeticulous attention to detail in patient data recording.\nCompletion and management of study documentation.\nProfessional attitude and proactive communication with colleagues.\nCommitment to professional development.\nProficiency in MS Word, Excel, PowerPoint.\nAdvantageous: previous clinical research experience, proficiency in Tswana and/or Zulu.\n\nCore Functions will include but not limited to:\n\nDirect and oversee research activities, ensuring research integrity and compliance.\nManage research projects administratively.\nConduct unbiased research in line with regulations.\nEnsure accurate, ethical, and efficient clinical trial processes.\nConduct clinical trials and provide medical oversight.\nLiaise with stakeholders and clients.\nEnsure adherence to ICH GCP and local guidelines.\nApply clinical knowledge per protocol.\nParticipate in and initiate trial data publications.\nOversee regulatory processes, participant recruitment, quality assurance, and laboratory/pharmacy tasks.\nFacilitate participant recruitment and informed consent.\nManage participants clinically as per protocols.\nConduct and attend relevant training.\nReview and action laboratory results.\nInterpret ECGs, CXRs, etc.\nAddress monitoring and data queries.\nReview and draft SOPs.\nPrepare source documents.\nReport adverse events.\nEngage in community education and clinic patient care.\nTrain and develop staff and students in clinical research.\n",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002487-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p84360689-b1c8-47d3-b7a4-2fcec92c8d05"
    },
    {
      "jobTitle": "Diesel Mechanic",
      "startDate": "2024-08-30 - 2024-09-29",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Lydenburg",
        "region": "Mpumalanga"
      },
      "details": "Requirements:* Education - grade 10/12 advantage* Valid trade certificate* Competent B Certificate - underground Hardrock operations* Medically fit to work underground* Clear criminal recordExperience:* 3-5 years working in a mining environment, with specific diesel mechanic experience on Sandvik (Drill rig) DD 211, 321, (Bolter) DS211-L-M, DS211L, 311, (LHD) LH 410, GHH (LHD) 5.2, 5.5, 6.2, (UV) 40, 60, AARD (UV) 80., Hencon, Altecreter, Dieci Telehandler* Must be fit to obtain a medical certificate and declared fit to work on a mine.* Competent in diesel machine systems, including diagnostic, repair and maintenance, ensuring safe and effective operations in a mining environment",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002530-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p4b2cd674-2332-42ef-9f93-b0ae43dafee0"
    },
    {
      "jobTitle": "Auto Electrician",
      "startDate": "2024-08-30 - 2024-09-29",
      "vacancyType": "Permanent",
      "jobSpecFields": "Auto Electrical",
      "location": {
        "city": ", Lydenburg",
        "region": "Mpumalanga"
      },
      "details": "Job specific requirements:\n\nEducation – Minimum Grade 10/Grade 12 advantageous\nCertification: Red Seal - Auto Electrician\nExperience: 3-5 years in a mining environment, with specific experience in auto electrical systems on Sandvik, GHH, AARD\nPhysical Fitness: Must be fit to obtain a medical certificate of fitness and declared fit to work on a mine.\nSkills: Competent in auto electrical systems, including diagnostics, repair, and maintenance, ensuring safe and effective operations in a mining environment.\nCompetent B certificate – Underground Hard rock operations\nMedical Certificate of Fitness to work Underground\nGood communication skills\nClean Criminal record\n\nResponsibilities:\n\nParticipate in maintaining a high level of safety awareness and adherence to safety standards.\nMaintain and repair electrical systems of mining machinery, ensuring their safe and efficient operation.\nPerform diagnostic tests to identify and resolve electrical issues.\nInstall, maintain, and repair electrical wiring, circuits, and equipment.\nAdhere to maintenance schedules and ensure timely completion of tasks.\nWork collaboratively with other team members and provide support when needed.\nAble to work to deadlines and remain effective under pressure\nA teamwork mentality to achieve results\nEffective listener with well-developed interpersonal skills\n\nSalaryFixed Income\n\nBasic salary &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R 40 800.00\n\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Gross Income &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R 55&nbsp;200.00&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Other income/variable\n\nConops Allowance (Rules apply) R&nbsp; &nbsp;7 200,00\nBonus: You may qualify for a monthly incentive subject to targets are met according to the company’s bonus structure.\n\nBonus at 100% of target equates to &nbsp;R &nbsp;8 000.00 (First 3 months 60 % of fixed Bonus)&nbsp;Company Contribution/benefits:\n\nCompulsory Momentum health 4 me (employee only) – employees with own medical proof to be submitted\nCompulsory - 50% of basic will be a pensionable salary on which a total of 3.75% will be contributed towards a Provident/death and Funeral benefit-(employee to contribute 3.75%)\n\nStatutory payments towards UIF/SDL/RMA",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002531-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pf456ca1f-df44-4756-bfce-796fd28723c2"
    },
    {
      "jobTitle": "Auto Electrician",
      "startDate": "2024-08-30 - 2024-09-29",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Lydenburg",
        "region": "Mpumalanga"
      },
      "details": "Requirements:* Education - minimum grade 10/12&nbsp;* Trade certificate as an Auto Electrician* Competent B certificates - underground hard rock operationsExperience:* 3-5 years within a mining environment with specific experience in auto electrical systems on Sandvik, GHH, AARD* Must be medically fit to obtain medical certificate* Competent in auto electrical systems, including diagnostic, repair and maintenance ensuring safe and effective operations in a mining environment",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002533-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p20b9404b-936e-4b27-b465-057702f692cc"
    },
    {
      "jobTitle": "Diesel Mechanic",
      "startDate": "2024-08-30 - 2024-09-29",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Lydenburg",
        "region": "Mpumalanga"
      },
      "details": "Job specific requirements:\n\nEducation – Minimum Grade 10/Grade 12 advantageous\nCertification: Red Seal – Diesel Mechanic\nExperience: 3-5 years in a mining environment, with specific Diesel Mechanic experience on Sandvik (Drillrig) DD 211, 321, (Bolter) DS211L-M, 221L, 311, (LHD) LH 410. GHH (LHD) 5.2, 5.5, 6.2. (Utility Vehicle) 40, 60. AARD (Utility Vehicle) Hencon Altecreter, Dieci Telehandler\nMust be fit to obtain a medical certificate of fitness and declared fit to work on a mine.\nStrong problem-solving skills and attention to detail\nCompetent in diesel machine systems, including diagnostics, repair, and maintenance, ensuring safe and effective operations in a mining environment.\nCompetent B certificate – Underground Hard rock operations\nMedical Certificate of Fitness to work Underground\nGood communication skills\nClean Criminal record\n\nResponsibilities:\n\nPerform regular maintenance checks on diesel-powered vehicles, equipment, and machinery\nDiagnose and repair mechanical issues in a timely manner\nConduct routine inspections and preventative maintenance on all diesel equipment\nKeep detailed records of maintenance and repairs\nParticipate in maintaining a high level of safety awareness and adherence to safety standards.\nAdhere to maintenance schedules and ensure timely completion of tasks.\nWork collaboratively with other team members and provide support when needed.\nAble to work to deadlines and remain effective under pressure\nA teamwork mentality to achieve results\nEffective listener with well-developed interpersonal skills\n\nSalaryFixed Income\n\nBasic salary &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R 40 800.00\n\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Gross Income &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R 55&nbsp;200.00&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Other income/variable\n\nConops Allowance (Rules apply) R&nbsp; &nbsp;7 200,00\nBonus: You may qualify for a monthly incentive subject to targets are met according to the company’s bonus structure.\n\nBonus at 100% of target equates to &nbsp;R &nbsp;8 000.00 (First 3 months 60 %&nbsp;of fixed Bonus)&nbsp;Company Contribution/benefits:\n\nCompulsory Momentum health 4 me (employee only) – employees with own medical proof to be submitted\nCompulsory - 50% of basic will be a pensionable salary on which a total of 3.75% will be contributed towards a Provident/death and Funeral benefit-(employee to contribute 3.75%)\n\nStatutory payments towards UIF/SDL/RMA",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002532-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p20db99e8-641c-45d1-afef-66e76a8252c3"
    },
    {
      "jobTitle": "Safety Manager",
      "startDate": "2024-08-29 - 2024-09-30",
      "vacancyType": "Contractor",
      "jobSpecFields": "SHEQ",
      "location": {
        "city": ", Saudi Arabia",
        "region": "Saudi Arabia"
      },
      "details": "The following requirements is required:Desirable:* Diploma fire and safety or equivalent* OSHA or NEBOSH, ISOH* Hold OSHA 18001:2008 auditor accreditationAdvantage:* Middle East experience, oil and gas and petrochemical project* Age 40 and up* Experience 10 years, 5 years in similar position* Degree Bs HSE/ HSE diploma / NEBOSH diploma* Grade 12 certificateKindly send CV with certificates and passport to yolanda@propersonnel.co.za",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002451-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pc9c8ded4-6ed8-4447-8051-3f34180da059"
    },
    {
      "jobTitle": "Safety Officer",
      "startDate": "2024-08-29 - 2024-09-30",
      "vacancyType": "Contractor",
      "jobSpecFields": "SHEQ",
      "location": {
        "city": ", Saudi Arabia",
        "region": "Saudi Arabia"
      },
      "details": "Must have the following requirements:Desirable:* Diploma Fire and Safety or equivalent* OSHA or NEBOSH, ISOH* Hold OSHAS 18001:2008 auditor accreditationAdvantage:* Middle East experience oil, gas and petrochemical projectsRequirements:* Age 25 and up* Experience 6 years, 5 years in similar position* Degree HSE Diploma / NEBOSH diploma* Grade 12 certificateKindly send CV with relevant documentation and passport to yolanda@propersonnel.co.za",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002452-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p8ac44d9d-808d-4317-928a-74564cc978ad"
    },
    {
      "jobTitle": "Safety Supervisor",
      "startDate": "2024-08-29 - 2024-09-30",
      "vacancyType": "Contractor",
      "jobSpecFields": "SHEQ",
      "location": {
        "city": ", Saudi Arabia",
        "region": "Saudi Arabia"
      },
      "details": "The minimum requirements for the vacancy is as follows&nbsp;Desirable:* Diploma in Fire and Safety or equivalent* OSHA or NEBOSH ISOHAdvantage:* Middle east experience, oil and gas and petrochemical projects experienceRequirements:* Age 30 and up* Experience 8 years, 5 years in similar position* Degree HSE diploma / NEBOSH diploma* Grade 12 certificateKindly send cv, with all relevant certificates and passport to yolanda@propersonnel.co.za",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002453-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p87297c61-54cb-4f22-a7a8-e9acea007b56"
    },
    {
      "jobTitle": "Financial Adviser / Broker",
      "startDate": "2024-08-29 - 2024-09-28",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", All Areas",
        "region": "All Areas"
      },
      "details": "Minimum Requirements:\n\nA minimum of four years of experience at a reputable Financial Institution such as Sanlam, Momentum, Discovery, ABSA Bank, etc.&nbsp;\nSuccessful completion and passing of the RE 1 regulatory exam.\nPossession of a minimum NQF qualification in line with years of experience.\n\nWhy Join Us?\n\nBe part of a forward-thinking company that values expertise and excellence.\nWork from anywhere in South Africa, providing flexibility and freedom.\nEngage with a supportive team committed to your success.\n\nIf you meet the above criteria and are ready to take on this rewarding challenge, we invite you to express your interest by applying today",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002529-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p797a7506-b741-4c49-8a5c-3083623feefc"
    },
    {
      "jobTitle": "Office Manager",
      "startDate": "2024-08-28 - 2024-09-27",
      "vacancyType": "Permanent",
      "jobSpecFields": "Financial Institute",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The ideal candidate needs to meet the following requirements, in order to apply:Qualifications:* Certificate in financial planning or equivalent* BSc in Economics, Mathematics, and Physics optional* Business related disciplineExperience:* At least 3 years relevant industry experience within a financial planning environment* 3-5 years marketing and finance management experience* 3-5 years team management experience* Previous HR/compliance experience essential",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002525-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p243038ee-f86f-44b4-8bed-51c055d56ac3"
    },
    {
      "jobTitle": "Application Developer",
      "startDate": "2024-08-28 - 2024-09-27",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Minimum qualifications and experienceBachelor’s Degree in Information Technology.Relevant IT or Development certification0-1 years of experience - junior positionReliable means of transport and a valid driver's lisenceMust have knowledge of the following:Microsoft Maui, Xamarin, Visual Studio, C#,Angular,HTML5,CSS 3 JavaScript, jQuery, Bootstrap,Responsive design, MVC, VB.net, razor, IIS, ASP.net,.Net core (Dot Net core) WCF/Web services, WebAPIThe candidate must have project and time management skills in order to work on multiple project simultaneously. They will be responsible for creating vissually appealing and user-friendly web and mobile applications. The candidate must have the motivation to continously implement self-improvement through researching the newest software technologies. Skills in Microsoft Maui, Xamarin, Visual Studio C, Angular, React.Occasional travel to Australia, New Zeeland, Europe and the USA will be required.",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002526-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pdd0bb5cc-86cf-4273-81dd-355fbb5aa719"
    },
    {
      "jobTitle": "Web Developers",
      "startDate": "2024-08-28 - 2024-09-27",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Minimum &amp; Ideal Qualifications:Higher-level (GS) degree in Web Application Development.Relevant Web Development certifications.0-1 years of related field experience.Proficiency in Afrikaans &amp; English&nbsp;Previous Experience:We are particularly interested in candidates with 0-1 years of experience. This position is designed for individuals looking to kickstart their career in web development.&nbsp;Salary Range:The salary range for this position is R8,000, – R15,000, dependent on your qualifications, experience, and performance in the interview.&nbsp;Additional Requirements:A reliable means of transport is necessary.This is a Junior-level role.A portfolio showcasing your previous web development projects or applications is highly desirable.If you are enthusiastic about web development, eager to learn, and have the qualifications and skills we are looking for, we encourage you to apply and take the next step in your career. Join a dynamic team that values innovation and creativity.",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002527-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p67511b9c-adf5-4332-8af9-bca87f3fae0a"
    },
    {
      "jobTitle": "Creative Analyst (Graphic Designer)",
      "startDate": "2024-08-28 - 2024-09-27",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Required Skills and Qualifications:\n\nBachelor’s degree in Web Development, Graphic Design, or a related field.\nProficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign).\nBasic understanding of web development is beneficial.\nKnowledge of SEO best practices.\nStrong creative, analytical, and problem-solving skills.\nExcellent communication and teamwork abilities.\nDetail-oriented with a strong focus on quality and accuracy.\nAbility to manage multiple projects and meet deadlines in a fast-paced environment.\nProject management skills and adaptability to changing project requirements.\n\nKey Responsibilities:\n\nCreate high-quality graphics for digital and print media, including social media, email campaigns, and websites.\nEnsure all media adheres to brand guidelines and project requirements.\nParticipate in brainstorming sessions to generate ideas for upcoming campaigns.\nStay updated on design trends and incorporate best practices.\nUse analytics and user feedback to inform design decisions.\nPresent design concepts to teams and clients, clearly explaining design choices.\nIterate on designs based on feedback, ensuring the final product meets quality standards.\nManage multiple projects simultaneously, delivering high-quality work on time.\nUtilize graphic design software (Adobe Creative Suite, etc.) to create and edit designs.\nExperiment with new design techniques to keep creative output fresh.\nReview final designs for errors and ensure they meet specifications.\nCollaborate with development, marketing, and analytics teams to implement design elements into web applications and campaigns.\nWork with cross-functional teams, including copywriters, developers, and SEO specialists, to deliver comprehensive solutions.\n",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002528-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p4bd2c6fa-8856-4ca8-b676-3e95910a41d6"
    },
    {
      "jobTitle": "Assistant Software Development Manager (Information Technology)",
      "startDate": "2024-08-27 - 2024-09-30",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Ladybrand",
        "region": "Freestate"
      },
      "details": "Qualifications:* Appropriate bachelor's degree or similar tertiary qualification or experience in IT software development* Proficiency in MS Project or similar project management tools* Minimum of 10 years of experience in software development* Minimum of 5 years management experience regarding IT Software development projectsPrimary Responsibilities:* Instigation and management of IT Software development projects through the evaluation and monitoring of business priorities, the determination of IT priorities and allocation thereof to IT programmers, as well as the productive sand effective utilizations of IT resources* Co-ordinate and planning of IT software development projects, including the approval and finalization of technical specifications* Coordinate and monitoring of testing the implementation of IT Software development projects* Liaising with business regarding IT software projectsSkills:* Excellent communications and language skills in Afrikaans and English* Excellent organizational and project management skills* Experience regarding software development in COBOL and the IDM-I operating systems* Previous experience in an agri-business environmental would be beneficial* Excellent people skills and the ability to lead and manage a team and work together in a team* Strong analytical skills and the ability to function independently",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002496-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pc3adcd07-46c3-4505-9f23-2d6ac25e26ef"
    },
    {
      "jobTitle": "Research Analyst",
      "startDate": "2024-08-27 - 2024-09-27",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Durbanville",
        "region": "Western Cape"
      },
      "details": "PRIMARY RESPONSIBILITIES:\n\nDoing rigorous primary and secondary research across a range of projects to develop credible, meaningful insights that help to solve development problems\nDeveloping effective written documents and presentations that communicates insights identified\nPresenting research work both internally and externally\nEngaging with external stakeholders – regulators, policymakers, private sector players, donor organizations and/or development partners\nContributing to proposals\nCoaching and mentoring more junior team members (Interns)\n\nQUALIFICATIONS AND EXPERIENCE:\n\nA completed master’s degree in economics, public policy, international development, finance or other related fields\nA strong interest in research-related activities and passion for achieving for positive impact in the world\nExcellent written and verbal communication skills\nGood quantitative and analytical skills\nThe willingness and ability to travel within South Africa and abroad\nAt least 1 year of research experience would be to your advantage\n\nAdvantageous experience, not required:\n\nFrench speaking\nExperience with Stata\nExposure to development or behavioral economics, financial inclusion or international development\n",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002511-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pc0bda0ab-3dc5-4384-8d4c-f5fa2d9f7bd4"
    }
  ]
}
