{
  "iconLink": "/assets/agency_icons/pro-personnel.jpg",
  "title": "pro-personnel",
  "blogPosts": [
    {
      "jobTitle": "Bookkeeper",
      "startDate": "2024-08-15 - 2024-09-14",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Bryanston",
        "region": "Gauteng"
      },
      "details": "Qualifications and Experience needed:* Grade 12* Related qualification to bookkeeping* Sage experience is a MUST* 2-5 years working experience as a Bookkeeper* Candidate must be available to start immediatelyResponsibilities:* Keeping track of all financial transactions, including purchase, sales, receipts and payments in the accounting software or ledgers.* Ensuring that invoices are paid on time and that the company receives payments from clients* Regularly comparing the company's financial records with bank statements to ensure accuracy and identify any discrepancies* Updating and maintain the general ledger, which is the primary record of all financial transactions* Creating basic financial reports, such as income statements, balance sheets and cash flow statements, to provide insight into the company's financial status.* Making sure that financial records comply with relevant laws and regulations and staying up to date with the changes.* Managing petty cash funds, tracking it use and reconcile it regularly* Supporting audits, providing documentation and information during financial audits to verify the accuracy of financial reports",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002523-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pd01d76f2-4d5c-4d9f-9e77-ea0b560b5978"
    },
    {
      "jobTitle": "Creative Analyst (Graphic Designer)",
      "startDate": "2024-08-14 - 2024-09-14",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Requirements:* Bachelor's degree in Web development, graphic design or related field* Proficiency in Adobe creative suite (photoshop, Illustrator, In design)* Basic understanding of web development&nbsp; beneficial* Knowledge of SEO best practices* Strong analytical and problem-solving skills* Excellent communication and teamwork abilities* Detail orientated with s string focus on quality and accuracy* Ability to manage multiple projects and meet deadlines in a fast phased environment* Project management skills and adaptability to changing project requirements",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002493-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p7d3de690-0bc8-4d08-9b3b-a4de383feade"
    },
    {
      "jobTitle": "Web Analyst (Web Developer)",
      "startDate": "2024-08-14 - 2024-09-14",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Requirements:* Bachelor's degree in web development, graphic design or related field.* Proficiency in HTML, CSS, JavaScript, PHP, JSE, Jason, WordPress and SEO* Design/Creative experience - beneficial* Basic understanding of Adobe Creative suite (Photoshop, Illustrator, InDesign)* Ability to create wireframes, mockups and prototypes* Basic understanding of UX/UI principals and best practices* Strong analytical and problem-solving skills* Excellent communication and teamwork abilities* Detail-orientated with strong focus and quality and accuracy* Ability to manage multiple projects and meet deadlines in a fast-paced environment",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002494-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p5d5b2f74-7561-4dd4-835d-4b65501520d1"
    },
    {
      "jobTitle": "Application Developer",
      "startDate": "2024-08-14 - 2024-09-14",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Requirements:* Proficiency in programming languages such as MS Mausi, Visual Studio, C Angular and React* Strong understanding of mobile and web application development* Ability to manage multiple projects simultaneously with effective project and time management skills.* Excellent problem-solving skills and attention to detail* Experience in creating visually appealing and user-friendly interfaces* Motivation to continuously learn and implement the latest software technologies",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002495-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p18b0612d-7818-4d07-adf7-7b5512daf131"
    },
    {
      "jobTitle": "Counter Sales Assistant",
      "startDate": "2024-08-14 - 2024-09-13",
      "vacancyType": "Permanent",
      "jobSpecFields": "Retail",
      "location": {
        "city": ", Bela Bela",
        "region": "Limpopo"
      },
      "details": "Minimum Qualifications:Must have Grade 12 or equivalent&nbsp;Must be fluent in Afrikaans and English&nbsp;Previous Counter Sales will be an advantage&nbsp;Previous technical / paint counter sales experience will be an added advantage&nbsp;Energetic, hardworking, diligent individual",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002521-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p63c39d26-1815-4160-93ac-6ba418e8d1e0"
    },
    {
      "jobTitle": "Micro Algae Plant Production Manager",
      "startDate": "2024-08-14 - 2024-09-14",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Koster",
        "region": "North West"
      },
      "details": "The Company is a leading innovator in sustainable agriculture, specializing in micro-algae plant production. We are dedicated to producing high-quality, dried micro-algae year-round while minimizing environmental impact. We are seeking a highly skilled and motivated Micro-algae Plant Production Manager to join our team and lead our state-of-the-art facility.Job Overview: The Micro-algae Plant Production Manager will be responsible for overseeing all aspects of our Micro-algae operations. This includes managing micro-algae plant growth cycles, ensuring optimal growing conditions, managing packaging operations both quantity and quality, managing operational staff, coordinating maintenance requirements and implementing best operating practices for maximum yield and quality. The ideal candidate will have a strong background in food &amp; beverage processing, plant science, microbiology, horticulture, hydroponics or micro-algae systems, with an understanding of process operations, aquatic chemistry and water treatment. Strong team leadership skills and the ability to perform in a pressured environment with stringent production requirements is a must. The incumbent will report to the Technical Manager.Key Responsibilities:&nbsp;1. &nbsp; &nbsp; &nbsp;General Management:&nbsp;Operational Oversight: Manage the day-to-day operations of the micro-algae production facility, ensuring all production, maintenance, quality and packaging processes run smoothly and efficiently.Resource Allocation: Allocate resources effectively to maximize production efficiency and minimize waste.Budget Management: Develop and manage the production budget, ensuring cost-effective operations.Regulatory Compliance: Ensure compliance with all local, provincial, state regulations related to micro-algae farming and food safety.Continuous Improvement: Identify opportunities for process improvements and implement changes to enhance productivity and quality.&nbsp;2. &nbsp; &nbsp; &nbsp;Technical Management:&nbsp;Micro-algae Plant Growth Optimization: Ensure optimal growing conditions are adhered to (light, temperature, humidity, nutrient levels) for various micro-algae species to maximize yield and quality.System Maintenance: Oversee the maintenance and operation of micro-algae systems, including troubleshooting and resolving technical issues.Nutrient Management: Adhere to nutrient delivery schedules and tailor to the specific needs of different batches. Feedback to the Technical manager on any concerns and optimization requirements.Data Analysis: Utilize data from sensors and other monitoring equipment to make informed decisions about environmental adjustments and resource management.Innovation: Stay updated on the latest advancements in micro-algae technology and integrate innovative solutions into the production process.Technical Expertise: Utilize knowledge of micro-algae systems and plant physiology to manage optimize production.Troubleshoot and resolve technical issues with micro-algae equipment and systems.Stay updated on the latest advancements in micro-algae technology and integrate innovative solutions.3. &nbsp; &nbsp; &nbsp;People Management:Team Leadership: Lead, train, and supervise a team of micro-algae plant and laboratory technicians, fostering a positive and collaborative work environment.Performance Management: Conduct regular performance evaluations, provide feedback, and develop improvement plans for team members.Training and Development: Identify training needs and provide ongoing education to staff on best practices, safety protocols, and new technologies.Task Delegation: Assign tasks and monitor performance to ensure productivity and adherence to quality standards.Conflict Resolution: Address and resolve any interpersonal issues or conflicts within the team promptly and effectively.4. &nbsp; &nbsp; &nbsp;Quality Control:Oversee quality control activities in the on-site laboratory and supervise laboratory staff.Monitor micro-algae plant health and growth to ensure adherence to the necessary quality specifications, identifying and addressing any issues promptly.Conduct regular inspections to ensure compliance with health and safety as well as good manufacturing standards.Ensure detailed records of micro-algae plant growth, environmental conditions, and production metrics are maintained.5. &nbsp; &nbsp; &nbsp;Inventory and Resource Management:Manage inventory of inoculum cultures, nutrients, and other plant supplies.Ensure efficient use of resources to minimize waste and reduce costs.Coordinate with suppliers to maintain an adequate stock of necessary materials.6. &nbsp; &nbsp; &nbsp;Reporting and Analysis:Prepare regular reports on production performance, including yield, quality, and resource usage. Analyse data to identify trends, areas for improvement, and opportunities for increased efficiency.Present findings and recommendations to senior management.Prepare regular management accounts and report on variations to budget&nbsp;Qualifications:&nbsp;· &nbsp; &nbsp; &nbsp; &nbsp;Bachelor’s degree in Agronomy, Horticulture, Hydroponics, Plant Science, Microbiology or a related field. Master’s degree preferred.· &nbsp; &nbsp; &nbsp; &nbsp;Minimum of 3-5 years of experience in Food &amp; Beverage processing, Horticulture, Hydroponics or Micro-algae farming or a related field.Technical Skills:&nbsp;· &nbsp; &nbsp; &nbsp; &nbsp;Strong understanding of plant physiology, nutrient management, microbiology and horticulture, hydroponics, micro-algae systems.· &nbsp; &nbsp; &nbsp; &nbsp;Proficiency in using plant management software and other relevant technology.· &nbsp; &nbsp; &nbsp; &nbsp;Experience with data analysis and interpretation to inform operational decisions.&nbsp;Management Skills:&nbsp;· &nbsp; &nbsp; &nbsp; &nbsp;Proven leadership and team management skills.· &nbsp; &nbsp; &nbsp; &nbsp;Excellent problem-solving abilities and attention to detail.· &nbsp; &nbsp; &nbsp; &nbsp;Ability to work in a fast-paced, dynamic environment and adapt to changing priorities.· &nbsp; &nbsp; &nbsp; &nbsp;Strong organizational and multitasking abilities.Interpersonal Skills:· &nbsp; &nbsp; &nbsp; &nbsp;Effective communication and interpersonal skills.· &nbsp; &nbsp; &nbsp; &nbsp;Ability to motivate and develop team members.· &nbsp; &nbsp; &nbsp; &nbsp;Conflict resolution and negotiation skills.Benefits:&nbsp;- &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Competitive salary and performance-based bonuses.- &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Paid time off and holidays.- &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Opportunities for professional development and advancement.",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002510-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pa9c2da55-f2a1-4c20-b3d2-678e9a518287"
    },
    {
      "jobTitle": "Assistant Accountant",
      "startDate": "2024-08-14 - 2024-09-13",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Requirements:\n\nMinimum of 5 years of experience in an accounting practice.\nStrong knowledge of VAT and income tax regulations.\nDetail-oriented with excellent organizational skills.\nAbility to work independently and as part of a team.\nProficient in Pastel Accounting Software\nAdvanced skills in Microsoft Excel\nExperience with SARS e-filing and handling SARS correspondence and registrations\nSalary payroll management and reconciliations using VIP and Easyfile\nVAT calculations and submissions\nPreparation and submission of EMP and Income Tax returns\nProfficient in Afrikaans&nbsp;\n",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002519-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p6635dbca-570e-455f-9255-f46778ff9237"
    },
    {
      "jobTitle": "Micro-Algae Plant Production Manager",
      "startDate": "2024-08-14 - 2024-09-13",
      "vacancyType": "Permanent",
      "jobSpecFields": "Hygiene",
      "location": {
        "city": ", Koster",
        "region": "North West"
      },
      "details": "The company is a leading innovator in sustainable agriculture, specializing in micro-algae plant production. We are seeking a highly skilled and motivated micro-algae plant production manager to join the team.Qualifications:* Bachelor's degree in Agronomy, horticulture, hydroponics, plant science, microbiology or related field, master's degree preferred.* Minimum of 3-5 years of experience in food &amp; beverage processing, horticulture, hydroponics or micro-algae farming or related fieldTechnical Skills:* Strong understanding of plant physiology, nutrient management, microbiology and horticulture, hydroponics, micro-algae systems* Profiency in using plant management software and other relevant technology* Experience with data analysis and interpretation to inform operational decisions.Management Skills:* Proven leadership* Excellent problem-solving abilities and attention to detail* Ability to work in fast paced dynamic environment and adapt to changing priorities* Strong organizational and multitasking abilities",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002522-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pe990ed23-6d4d-43f0-9aed-667c99fee8a6"
    },
    {
      "jobTitle": "Assistant Accountant",
      "startDate": "2024-08-13 - 2024-09-12",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Experience:* Must have at least 5 years working experience within an accounting firm.* Must have knowledge of the following:- SARS e-filing- SARS correspondence and registration- Salaries, payroll and reconciliation (VIP &amp; Easy file)- Knowledge of calculations and statements- EMP- Income tax statementsComputer knowledge in:* Pastel* Excel",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002520-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pc99eb6b0-2430-4a2b-b7cc-a1aef8aa9df2"
    },
    {
      "jobTitle": "Butchery Manager",
      "startDate": "2024-08-12 - 2024-09-11",
      "vacancyType": "Permanent",
      "jobSpecFields": "FMCG",
      "location": {
        "city": ", Durban",
        "region": "KwaZulu Natal"
      },
      "details": "Qualifications &amp; Experience:* A valid matric certificate with mathematics* Grade 1 Meat cutting certificate or recognized butchery apprenticeship* A clear criminal record* At least 5 years' experience in all aspects of day to day running and managing of a meat market* Computer literate* Point of sale systems knowledge is desirable* Self motivated, self-dedicated and self-determined with a creative flair* Strong numerical skills* Be able to manage staff* Be able to work under pressure* Be able to be firm and resolute in decision with a high degree of discipline",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002516-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p5b0c47d4-cab5-4f27-8b38-421fd3cde5d8"
    },
    {
      "jobTitle": "Customer Service (Internal Sales)",
      "startDate": "2024-08-12 - 2024-09-11",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Durban",
        "region": "KwaZulu Natal"
      },
      "details": "Qualifications:* Grade 12 (matric)* 1-2 years' experience within a sales or internal sales environment* Experience within electrical motors industry will be a advantage* Must be PC literate with working knowledge of MS OfficeRequirements:* Excellent communications skills, proficient in the English language written and oral, must be able to legibly read and write reports* Eagerness to learn about our products* Must be able to work under pressure and meet deadlines to ensure customer commitments are met* Strong motivational and interpersonal skills* Administration skills* ReliableTravel:* Works predominately within the office* Required to visit customer from time to time* Work normal hours* Should be able to work on weekends, and holidays and overtime when needed* Position may require out of town travel",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002518-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p0ef97e48-b34d-449d-96ec-6be0f2615d76"
    },
    {
      "jobTitle": "Customer Service (Internal Sales)",
      "startDate": "2024-08-12 - 2024-09-11",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Durban",
        "region": "KwaZulu Natal"
      },
      "details": "As Customer Service you are required to attracts potential customers by answering product and service questions; suggesting information about other products and services.&nbsp; Process orders, prepare correspondences and fulfil customer needs to ensure customer satisfaction.&nbsp; The positions requires to expedite and facilitates the flow of new units within the operations to ensure that products are delivered to our clients within the agreed time frame, and per quality standardsResponsibilities:&nbsp;Customer Service for new and repair facility\n\nHandling telephonic enquiries.\nProviding product information to existing and potential customers.\nProviding verbal and typed quotations to customers.\nFollowing up on quotations.\nProviding guidance to customers in the use/application of the companies products.\nEntering of sales order on our operating system.\nCompiling of documentation required for projects and tenders.\nArranging and attending of sales events.\nUpdating quote schedule on daily basis.\nForwarding order acknowledgement to customers and sales representatives.\nFollow up on all weekly back orders and promises kept.\nFocused on reducing the slow moving stock in the branch.\n\nSales\n\nExcellent customer service resulting in increasing of sales.\nThe position has direct contact with customers, and Marathon internal departments and it will be required to assist and take ownership of customers and other Sales Representatives commercial and related queries when requested.\nMaintain working relationships with existing clients to ensure that they receive exceptional service and to identify potential new sales opportunities.\nThe success of the company is based on this position’s effective handling of internal and external customer needs.\n\n&nbsp;Qualifications\n\nGrade 12 (Matric)\n1 – 2 years’ experience within an Sales or Internal sales environment.\nExperience within electrical motors industry will be an advantage.\nMust be PC literate with working knowledge of Microsoft Office.\nMust have valid Driver's License.\n\n&nbsp;Requirements &nbsp;\n\nExcellent communication skills, proficient in the English Language Written and Oral, must be able to legibly read and write reports.\nEagerness to learn about our products.\nMust be able to work under pressure and meet deadlines to ensure customer commitments are met.\nStrong motivational and interpersonal skills\nSales and listening skills\nAdministrations skills\nProven track record.\n\n&nbsp;Salary\n\nBase salary up to R19&nbsp;000.00 monthly (Depending on experience)\nMedical Aid - 50% company contribution (Discover dependant on plan)\nPension Fund –10.8% company contribution\nGuaranteed 13th Cheque\nTotal cost including 13th Cheque R307516,00\n\n&nbsp;Travel\n\nWorks predominately within the office.\nRequired to visit customers from time to time .\nWorks normal hours\nIs subject to work beyond normal working hours, evenings, weekends and holidays should the need arise.\nAttends and participates in continuing educational programs designed to keep you abreast of changes in your profession.\nPosition may require out of town travel.\n\n&nbsp;Language\n\nThe business language in South Africa is English.\n",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002517-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pcc33d50c-1ca4-4ecc-99b8-8c87d9caa1cc"
    },
    {
      "jobTitle": "Senior C&amp;I Project Engineer",
      "startDate": "2024-08-08 - 2024-09-07",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Qualifications Required:* Bachelor's degree in Electrical Engineering, Control Engineering, Instrumentation Engineering or related field* Professional Engineering (PE) license or equivalent certification preferred.Experience:* Minimum of 8-10 years working experience in control and instrumentation engineering, with 5 years in a senior or lead role.*Extensive experience in mining and processing plant environment* Proven track record of successfully delivering large-scale C&amp;I projectsTechnical Skills:* Provenience in control system design and programming (e.g. PLC, DCS, SCADA, systems).* Strong knowledge of instrumentation selection, installation and maintenance* Familiarity with industry standards such as ISA, IEC and IEEESoft Skills:* Excellent project management and orgnizational skills* Strong analalytical and poblem solving abilities* Effective communication and interpersonal skills* Ability to work collboratory in a team-orientated environmentPhysical work requirerments:* Ability to work in a mining and processing plant environment, including exposure to dust, noise and varying temperatures* Willingness to travel to remote sites as requires* Availability to work extended hours and on call support as needed.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002514-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p3d612e92-702b-4920-800f-de835b617b79"
    },
    {
      "jobTitle": "Finance and Admin Manager",
      "startDate": "2024-08-08 - 2024-09-07",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Requirements:* Degree in financial accounting or equivalent* Post graduate qualification in financial accounting* must have completed SAICA articles* Minimum of 5 years experience in a management level* CA/CIMA qualification would be a advantage* Proven experience in developing and implementing financial models and systemsSkills &amp; Knowledge Required:* Understanding of tax and financial laws/legislation* The ability to draft and interpreted financial statements* Excellent interpersonal skills* Excellent communications skills* Good understanding of governce and assusrance frameworks* Indepth knowledge of Excel* Strategic thinking and analytical skills* Expert knowledge of financial systems and process* Excellent computer literacy skills* Strong management and leadership skills* Ability to mentor and guide staff* Supervisor attention to detail",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002515-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pd5aeda6b-9b4d-464e-86ac-8cca40977cdc"
    },
    {
      "jobTitle": "Credit Manager",
      "startDate": "2024-08-07 - 2024-09-06",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Midrand",
        "region": "Gauteng"
      },
      "details": "Job Purpose &amp; SummaryReporting to the Managing Director, the Credit Manager will have the overall responsibility for the credit/lending function. Key areas of responsibility include the following:\n\nMaking sound credit decisions in line with company’s risk appetite, tolerances and policies, procedures, and guidelines.&nbsp;\nDeveloping and maintaining strong relationships with both the internal team and external partners to ensure stakeholder satisfaction\nMonitoring market conditions and any regulatory changes that would require changes to credit policies, procedures, and guidelines\n\nKey Accountabilities &amp; DutiesLoan origination and processing\n\nImplement loan origination strategies with lending team\nReview and recommend credit applications and transactions within assigned credit limits in a timely manner\nProvide independent, objective reviews and recommendation to credit applications and other matters which have been agreed to and/or recommended by the Loan Officers\nReview all loan applications and sign off prior to submission to senior management, to ensure the completion of due diligence and adherence to the company’s policies and guidelines\nProvide motivation for recommendations on credit transactions/applications and communicate effectively with Loan Officers to ensure rationale and decision is clearly understood\nWrite succinct credit memos or credit announcements to communicate credit perspective and rationale for new credits and credit extensions\nCommunicate with Loan Officers about specific credit applications and transactions to seek further information and modifications, if needed. Discuss appropriate structuring for the deal and criteria required for approval. Ensure that all information is credible, accurate, and relevant, including analysis and evaluation of the technical aspects (e.g., financial analysis, credit terms, structure, and collateral)\nReview approval letters and loan agreements to ensure credit terms and conditions are recorded\nReview and recommend disbursements according to policies and guidelines to ensure lending conditions are met\nSupport the healthy and sustainable growth of a profitable loan portfolio by ensuring the credit granting and implementation is within the company’s prescribed asset quality standards\nMaintain records of loan applications\n\nMonitoring and Collections\n\nActively monitor loans after disbursement according to guidelines and policies\nOversee collections and implement collection activities timeously\nMinimise bad debts\n\nReporting\n\nWeekly, monthly, quarterly, semi-annually and annual reporting to senior management on lending activities\n Prepare reports for Board and external stakeholders\n\nOrganisation Development\n\nSupport Loan Officers to ensure client and other stakeholder satisfaction\nRespond to and resolve escalated issues raised by the Loan Officer\nContribute to the development and implementation of sound SME lending guidelines and policies\nMonitor market conditions and make recommendations for enhancements to existing policies, procedures and guidelines\nAssess the impact of regulatory changes to existing policies, procedures and guidelines\nProvide support in strategic projects, policy and process improvements initiatives related to the business\n\n&nbsp;Occupational Experience &amp; Education Requirements\n\nBachelor’s Degree or diploma in business or a related field\nMinimum 5 years SME lending experience is required\nAdditional SME support services experience is considered advantageous\n\nKnowledge, Skills &amp; Attributes\n\nSound credit judgement. Ability to understand the risk return trade-off and come up with well thought-out solutions to mitigate credit risk\nAbility to articulate complex credit applications into succinct and balanced recommendations\nUnderstanding of commitment letters and other legal documents from a credit perspective\nFinancial Statement analysis experience\nUnderstanding of SME lending practices and end-to-end credit process\nAnalytical skills and attention to details\nProblem-solving capabilities and excellent organizational and time management skills\nProficiency with MS Office Suite of products\nMust have valid Driver's License\n\nExperience working with a lending softwareWe’re a fund manager with 12 months operations focusing on the SME space only. We offer two products, purchase order funding and invoice discounting. We’re looking for a Credit Manager to run the lending operations of our growing business. We have a preference for candidates that have purchase order and invoice discounting experience. Our operations are across the country, but the Credit Manager will be based in Johannesburg, Midrand with travel once or twice monthly to the operating offices. The budget for the role is R400,000 – R500,000 annual total cost to company before 10-20% annual bonus on achievement of targets.",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002513-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pfe972175-fa6f-4c04-91ff-5bf12dd30581"
    },
    {
      "jobTitle": "Office Administrator",
      "startDate": "2024-08-05 - 2024-09-06",
      "vacancyType": "Permanent",
      "jobSpecFields": "Admin, Office &amp; Support",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The client needs the following requirements:* Have a valid driver's license* Valid grade 12 certificate* Previous working experience in office administration:- MS Excel &amp; Pastel essential- Previous stock take experience- Excellent communication skills and customer service- Be willing to assist where needed- Some HR knowledge and experience to your advantage.- Must be willing to start immediatelySalary R10000",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002467-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p25a0d9d6-44ba-427a-938a-a5171763c05d"
    },
    {
      "jobTitle": "Credit Manager",
      "startDate": "2024-08-05 - 2024-09-04",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Midrand",
        "region": "Gauteng"
      },
      "details": "Occupational Experience &amp; Education Requirements:* Bachelors degree or diploma in business or a related field* Minimum 5 years SME lending experience is required.* Additional SME support services experience is considered an advantage.Knowledge, Skills &amp; Attributes:* Sound credit judgement, ability to understand the risk return trade-ff and come up with well thought solutions to mitigate credit risk.* Ability to articulate complex credit applications into succinct and balanced recommendations* Understanding of commitment letters and other legal documents from a credit perspective* Financial statement analysis experience* Understanding of SME lending practices and end to end credit process* Analytical skills and attention to details* Problem solving capabilities and excellent organizational and time Mangement skillsproficiency with MS Office suite of products* Experience working with a lending software",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002509-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p90d6e9f3-e0cd-4cd8-bd5b-d1c6ff41f642"
    },
    {
      "jobTitle": "Research Analyst",
      "startDate": "2024-08-05 - 2024-09-04",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Durbanville",
        "region": "Western Cape"
      },
      "details": "PRIMARY RESPONSIBILITIES:\n\nDoing rigorous primary and secondary research across a range of projects to develop credible, meaningful insights that help to solve development problems\nDeveloping effective written documents and presentations that communicates insights identified\nPresenting research work both internally and externally\nEngaging with external stakeholders – regulators, policymakers, private sector players, donor organizations and/or development partners\nContributing to proposals\nCoaching and mentoring more junior team members (Interns)\n\nQUALIFICATIONS AND EXPERIENCE:\n\nA completed master’s degree in economics, public policy, international development, finance or other related fields\nA strong interest in research-related activities and passion for achieving for positive impact in the world\nExcellent written and verbal communication skills\nGood quantitative and analytical skills\nThe willingness and ability to travel within South Africa and abroad\nAt least 1 year of research experience would be to your advantage\n\nAdvantageous experience, not required:\n\nFrench speaking\nExperience with Stata\nExposure to development or behavioral economics, financial inclusion or international development\n",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002511-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pd2307087-6c45-4f78-935e-bf61c732c933"
    },
    {
      "jobTitle": "Debtors Clerk",
      "startDate": "2024-08-05 - 2024-09-04",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Key Responsibilities:\n\nProcess and manage all invoices related to mining operations.\nEnsure accurate and timely billing to clients.\nMaintain detailed records of transactions and manage accounts receivable.\nReconcile invoices and resolve any discrepancies.\nCommunicate with clients to follow up on outstanding payments.\nCollaborate with the finance team to improve processes and reporting.\nAssist in preparing financial reports and statements.\nTravel to mining sites to deliver and follow up invoicing\n\nQualifications:\n\nDiploma in Finance, Accounting, or related field.\nProven experience as a Debtors Clerk or in a similar role.\nFamiliarity with accounting software, Eworks and MS Office (especially Excel).\nStrong attention to detail and excellent organizational skills.\nAbility to work independently and as part of a team.\nExcellent communication and interpersonal skills.\nExperience in the mining industry.\n",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002512-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p605ccfa4-66bd-4526-9c25-11f1dd1daa2d"
    },
    {
      "jobTitle": "Supervisor",
      "startDate": "2024-08-01 - 2024-08-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Hygiene",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The ideal candidate needs to have the following requirements and experience:* Must have a valid grade 12 certificate* Must know MS Excel (formulas) very well* Previous working experience as a supervisor within a cleaning/ hygiene environment.* Must be in possession of a valid driver's license* Excellent communications skills in Afrikaans and English* Delivery of stock and invoices to clients* Conduct and assist in weekly vehicle and equipment checks* Be able to start immediately",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002508-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p8fd2364b-0c69-488a-90e9-45b973717589"
    },
    {
      "jobTitle": "Counter Salesman (Truck Parts)",
      "startDate": "2024-07-31 - 2024-08-30",
      "vacancyType": "Permanent",
      "jobSpecFields": "Automotive",
      "location": {
        "city": ", Midrand",
        "region": "Gauteng"
      },
      "details": "Requirements\n\nMatric\nComputer literate, Pastel experience will be advantageous\nProven experience in truck parts sales, specifically for Scania, Volvo, M.A.N, and Mercedes-Benz.\nStrong knowledge of truck parts and their applications.\nExcellent customer service and communication skills.\nAbility to function effectively in a high-pressure, fast-paced environment.\nStrong organizational skills and attention to detail.\nSelf-motivated with a drive to meet and exceed sales targets.\n",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002506-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pa719e2b9-105e-4b62-bf8c-73cdddd5f664"
    },
    {
      "jobTitle": "Sales Representative - Mining",
      "startDate": "2024-07-31 - 2024-08-30",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Qualifications:\n\nPrevious Sales experience within the mining industry is essential.\nStrong technical skills related to mining equipment and processes.\nProven track record of achieving sales targets.\nExcellent communication and negotiation skills.\nLoyal, trustworthy, and hardworking nature.\n\nKey Responsibilities:\n\nDevelop and maintain strong relationships with clients in the mining industry.\nUtilize technical skills to understand and meet customer needs.\nAchieve and exceed sales targets to drive company growth.\nProvide excellent customer service and support.\n\nBenefits:\n\nCompany vehicle and petrol allowance.\nCompetitive salary of R15,000 per month.\nPension plan after 3 months.\nCommission of 3.5% of turnover after reaching a target of R300,000.\nWork-life balance with working hours:\n\nMonday to Thursday: 7:30 AM - 4:00 PM\nFriday: 7:30 AM - 1:00 PM\n\n\n",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002507-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pe3035b90-c386-46a5-a093-891972f9fc7e"
    },
    {
      "jobTitle": "Counter Salesman",
      "startDate": "2024-07-29 - 2024-08-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Midrand",
        "region": "Gauteng"
      },
      "details": "As a counter salesman, you'll play a crucial role in our operations, assisting customers with their parts needs, providing expert advice, and ensuring they find exactly what they're looking for. If you have a passion for vehicles and a knack for customer service, we want to hear from you!Key Requirements:\n\nProven experience in truck and bus parts sales.\nExpertise in Scania, Volvo, and Mercedes parts.\nStrong communication and interpersonal skills.\nAbility to thrive in a fast-paced environment.\nExcellent customer service skills.\n\nJoin our team and become a valued member of our growing company. Apply now and take the next step in your career!Offering a Competitive salary, medical aid and pension",
      "contact": "Welma Helberg Nel",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002400-WHN",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p43e91d91-f62f-4d1b-bda2-8b8f42dbd431"
    },
    {
      "jobTitle": "Junior HR Manager",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "FMCG",
      "location": {
        "city": ", Durban",
        "region": "KwaZulu Natal"
      },
      "details": "Qualifications and Experience:* Appropriate qualification in Human Resource* Minimum of 5 years' experience as a HR generalist in a retail or similar environment* Proficient knowledge of employment laws such as BCEA, LRA, EE, SDA and Health and Safety regulationsPrimary Responsibilities:* Employee relations* Talent acquisition* Talent Management* Training and development* BBBEE &amp; employment equity* HR Administration",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002501-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p48de3f48-b9a5-4dbc-ae80-d9600cb946e1"
    },
    {
      "jobTitle": "Assistant Software Development Manager (Information Technology)",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Ladybrand",
        "region": "Freestate"
      },
      "details": "Qualifications:* Appropriate bachelor's degree or similar tertiary qualification or experience in IT software development* Proficiency in MS Project or similar project management tools* Minimum of 10 years of experience in software development* Minimum of 5 years management experience regarding IT Software development projectsPrimary Responsibilities:* Instigation and management of IT Software development projects through the evaluation and monitoring of business priorities, the determination of IT priorities and allocation thereof to IT programmers, as well as the productive sand effective utilizations of IT resources* Co-ordinate and planning of IT software development projects, including the approval and finalization of technical specifications* Coordinate and monitoring of testing the implementation of IT Software development projects* Liaising with business regarding IT software projectsSkills:* Excellent communications and language skills in Afrikaans and English* Excellent organizational and project management skills* Experience regarding software development in COBOL and the IDM-i operating systems* Previous experience in a agri-business environemental would be beneficial* Excellent people skills and the ability to lead and manage a team and work together in a team* Strong analytical skills and the ability to function independently",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002496-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pb3f5d2f9-05fc-470d-84a0-17239a9b8406"
    },
    {
      "jobTitle": "IT Support Technician",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Bedfordview",
        "region": "Gauteng"
      },
      "details": "Qualifications:* Minimum of 4 years of practical experience in IT Support* Valid driver's license is a mandatory requirement* Relevant technical certification and qualifications* Willingness to travel occasiobnally to meet the needs of our diverse client base.Skills and Comptenencies:* Strong problem solving and troubleshooting skills* Excellent communication and interpersonal skills* Ability to work independently sand collaborator with a team* Familiarity with various operating systems and software applicationsResponsibilities:* Provide first level technical support to end users, ensuring prompt issue resolution* Install, configure and maintaine hardware and software components* Collabroate with the IT team to implement and support IT support* Troublshoot and resolve hardware, software and network issues* Ensure the smooth operation of computer systems within the organization",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002497-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "pd7645184-46de-431d-948f-c536a230d562"
    },
    {
      "jobTitle": "Grain Marketing Manager",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "Agricultural &amp; Farming",
      "location": {
        "city": ", Bloemfontein",
        "region": "Freestate"
      },
      "details": "Primary Responsibility\n\nMarketing and management of grain against set targets.\nManagement of staff.\nNegotiation with client.\nInnovative marketing strategies.\n\nQualifications and Experience\n\nAppropriate Degree or Diploma in Agriculture.\n5 years management experience.\n5 years’ experience in grain marketing (trading.\nRegistered Safex Trader with SAIFM.\nValid driver’s license.\n\nSkills\n\nExcellent communication skills in English and Afrikaans.\nComputer literate (MS Office).\nStrong customer service orientation and Excellent numerical skills.\nStrong sales and marketing skills.\nStrong negotiation skills.\n\nSalary - R70 000 - R80 000 per month",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002498-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p64f646d6-3dfc-49ae-909a-1ae7b795aab5"
    },
    {
      "jobTitle": "Grain Marketing Manager",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "Agricultural &amp; Farming",
      "location": {
        "city": ", Bloemfontein",
        "region": "Freestate"
      },
      "details": "Qualifications:* Appropriate degree or diploma in Agriculture* 5 Years management experience* 5 years' experience in grain marketing* Registered safex trader with SAIFM* Valid driver's licenseSkills:* Excellent communications skills in Afrikaans and English* Computer literacy (MS Office)* Strong customer service orientation and excellent numerical skills* Strong sales and marketing skills* Strong negotiation skillsPrimary Responsibilities:* Marketing and management of grain against set targets* Management of staff* Negotiation with clients* Innovative marketing strategies",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002499-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p64747b41-f448-40b8-a63a-a09405af120b"
    },
    {
      "jobTitle": "Quality Assurance Generalist",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "Services",
      "location": {
        "city": ", Midrand",
        "region": "Gauteng"
      },
      "details": "Qualifications:* A national diploma or degree in Quality Management or a related qualification at an NQF 6/7 level.* 2 Years quality management or Quality Assurance and /or Business Process Redesign* 1 Year Risk Management (advantageous)* 1 Year aviation (advantageous)Primary Responsibilities:Maintain the Quality management System (QMS)* Develop and maintain QMS documents* Develop, implement and validate quality standards, processes and procedures withing the organization in accordance with the organizational QMS based on ISO 9001* Provide the organizations QMS training (induction and refresher) to all staff to increase awareness and understanding* Regular update the Bam Owl system with the latest audit informationMonitor Compliance with Quality Standards:* To audit business units' conformances* Auditing that all standards, processes and procedures have been documented and the adherences of all organizations staff to requirements* Tracking and following up on outstanding corrective actions*Submitting statical activity reportsPromote Continuous Improvement:* Develop implement and maintain a continuous improvement mechanism* Promote the quality management systemsDevelopment of QMS Templates* Develop organizational templates for policy, procedures work instructions (including TGM and MOP's) forms and checklistsRisk Identification:* Relevant risks are identified at an operational level* Report on identifies risks and inform EWRM function accordinglyDesign and Redesign of Processes (BPR)* Design and redesign of processes (BPR) within the organization to improve the organizations business process efficacy.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002502-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p00d1eeea-7252-441a-91a0-1ce7bbfcbe41"
    },
    {
      "jobTitle": "Quality Assurance Generalist",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "Services",
      "location": {
        "city": ", Midrand",
        "region": "Gauteng"
      },
      "details": "Primary ResponsibilitiesMaintain The Quality Management System (QMS)\n\nDevelop and maintain QMS documents: typing, layout, format, pagination, database compilation, editing, review(amendments) and maintenance, revision control and status, draw complex diagrams, attachments, scanning and converting documents.\nDevelop, implement and validate quality standards, processes and procedures within the organisation in accordance with the organisations QMS based on ISO 9001.\nProvide the organisations QMS training (induction and refresher) to all staff to increase awareness and understanding.\nEnsure that all company processes and procedures include process controls based on segregation rules and requirements.\nAssist staff with any queries in respect of the QMS.\nRegularly update the BarnOwl system with the latest audit information.\n\nMonitor Compliance With Quality Standards\n\nTo audit the business unit’s conformance for conformance with organisations QMS, by:\nAuditing that all standards, processes and procedures have been documented and the adherence of all organisations staff a to the requirements, standards, processes and procedures.\nEnsuring that any corrective and follow up actions addresses findings in full.\nCollecting data on corrective and preventive action and analyse trends to improve QMS.\nTracking and following up on outstanding corrective actions to verify closure based on objective evidence.\nSubmitting statistical activity reports to the M: QA\n\nPromote Continous Improvement\n\nDevelop implement and maintain a continuous improvement mechanism which is in line with the international standard.\nPromote the quality management system and continuous improvement through training, workshops and mentoring.\n\nDevelopment Of QMS Templates\n\nDevelop organisational templates for: policy, procedures, work Instructions (including TGM and MOPs), forms and checklists and other pertinent documents.\nEnhance QMS documents: typesetting, incorporate external (national/international) and internal formatting requirements, consult and disseminate information into new/amended requirements and control external and internal formatting requirements.\n\nRisk Identification\n\nRelevant risks are identified at an operational level utilising appropriate tools and techniques taking cognisance of changes in the risk environment.\nReport on identified risks and inform the EWRM function accordingly.\nAssist Risk Specialists to develop mitigation plan to address identified risks.\n\nDesign and Redesign of Processes (BRP)\n\nDesign and Redesign of Processes (BPR) within the organisation to improve the organisations business process efficacy (efficiency and effectiveness).\nEnsure optimum internal and external processes resulting in customer service excellence both within the organisation and to our external clients.\n\nQualifications and Experience\n\nA National Diploma or Degree in Quality Management or a related qualification at an NQF 6/7 level\n2 years Quality Management or Quality Assurance and/or Business Process Redesign\n1 year Risk Management (advantageous)\n1 year Aviation (advantageous)\n\nPeople with Disabilities will be prioritized",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002500-D",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p7bfa9b58-61aa-430f-9bba-b6da047f43bd"
    },
    {
      "jobTitle": "Key Accounts Manager",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Midrand",
        "region": "Gauteng"
      },
      "details": "Qualifications and Experience:* Valid grade 12 Certificate* Diploma in Marketing or business-related field* Previous experience in Account Management or territory sales* Experience managing major national accounts at head office level* Excellent understanding of FTTx networks and products* Solid track record of meeting targets* Working in close collaboration with an international OEM (Product mix, strategy, sales process) such as CommScope or similar would-be advantage)Primary Responsibilities:* Developing and sustaining solid relationships with key clients that bring in the most revenue for the company*&nbsp; Addressing and resolving key clients' complaints* Acting as the main point of contact between key clients and internal teams* Communicating and collaborating with logistics departments to ensure that the key clients' needs are met* Compiling reports on account progress, goals and forecasts for account teams and stakeholders* Developing a thorough understanding of key clients' needs and requirements and preparing customized solutions* Negotiations contracts with key clients and meeting established deadlines for the fulfillment of each client's long term goals",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002504-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p3fbe6fbe-2afe-446c-8e32-f51db75d30a2"
    },
    {
      "jobTitle": "Junior HR Manager",
      "startDate": "2024-07-26 - 2024-08-25",
      "vacancyType": "Permanent",
      "jobSpecFields": "FMCG",
      "location": {
        "city": ", Durban",
        "region": "KwaZulu Natal"
      },
      "details": "QUALIFICATIONS AND EXPERIENCE:Appropriate qualification in Human Resources.Minimum of 5 years’ experience as a HR Generalist in a retail or similar environment.Proficient knowledge of employment laws such as BCEA, LRA, EE, SDA, and Health and Safety regulationPRIMARY RESPONSIBILITIES:Employee RelationsProvide advice to line managers regarding the conduct and misconduct management processes.Provide advice to line managers and investigate/process disciplinary cases.Participate in consultations with organised labour.Coach Line Managers on effective delivery of Disciplinary hearings.Represent the organisation at CCMA (Conciliation and Arbitration).Talent AcquisitionEnsure that the Resourcing process is adhered to and jobs are timeously advertised and tracked on the&nbsp; Social Media channels externally and via hand delivered applications internally.Manage, coordinate and conduct interviews with Line Managers and make recommendations.Utilize various sourcing methods, including job boards, social media, and networking, to identify and engage with potential candidates.Evaluate candidates' skills, experience, and cultural fit during the interview process.Manage communication with candidates, ensuring a positive candidate experience.Assist with onboarding and orientation processes as needed.Talent ManagementCoach Line Managers on Performance Management Process and Talent &amp; Org Review process.Coordinate the performance appraisal documents and consolidate performance ratingsDrive the succession planning.Facilitate employment equity target setting and monitor profile.Organisational DesignLiaise with Line Managers to get rationale for proposed positions, draw up new proposed org and submit to HR Manager for sign off.Drive change management initiatives in line with the business and organisational objectivesTraining &amp; DevelopmentConduct training needs and skills gap analysis for business and assist with the compiling of training&nbsp;budget/plan.Plan, coordinate and organise relevant training initiativesFacilitate HR training including adhoc refresher for employees and Line Managers.Assist with reporting, analysis and submission of the Workplace Skills Plan and the Annual Training Report for relevant SETAFacilitate the implementation and tracking of all related Skills Development legislative requirements. This includes (but is not limited to) Skills Development Plans, Annual Training Reports, Learnerships.BBBEE &amp; Employment EquityDrawing quarterly reports and discuss at EE meeting also using the same reports of appointmentsAssist with the compilation of EE and BBBEE info for Skills DevelopmentSupport and facilitate BBBEE Skills Development initiativesHR AdministrationManage new employee on-boarding process.Manage terminations and exit interviews.Manage the capturing of HR information and data into the relevant systems and assure the integrity of the data.Provide advice and information to management and employees on HR policies and proceduresAdvise management on work matters, career development, personal problems and industrial matters.Counsel employees on policies and rules relating to employment policies and programmes, and on the&nbsp; company’s rules and regulations.Prepare and analyse HR reports for HR Manager",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002503-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p07da9316-9dd7-457f-b02c-9a3899200a86"
    },
    {
      "jobTitle": "Internal Sales",
      "startDate": "2024-07-23 - 2024-08-22",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Requirements:* Valid matric certificate* Excellent communications skills* Previous technical sales experience, to your advantage* Be able to start immediately* Have valid driver's license and own transport",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002490-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p86d7ba18-e952-49fc-8f9e-0cf8f49b47bf"
    },
    {
      "jobTitle": "Accountant",
      "startDate": "2024-07-23 - 2024-08-22",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Position Title: Property Management Accountant&nbsp;Location: Rustenburg, South Africa&nbsp;Job Type: Full-time&nbsp;Reporting to: Managing Director&nbsp;&nbsp;Salary: Negotiable based on experience (12 -15k)&nbsp;Position Overview:The Property Management Accountant will be responsible for managing financial operations related to a large portfolio of properties, including budgeting, payment allocations, 10-year maintenance plans, levy increases, and financial reporting. The incumbent will also oversee audit procedures for Financial Year ends for Sectional Titles and Homeowners Associations, ensuring compliance with relevant regulations and standards. The accounting program is We Connect U (WCU), based on Pastel.&nbsp;Key Responsibilities:Budget Management:Develop and maintain annual budgets for properties within the portfolio.Monitor budget performance and variance analysis.Provide recommendations for budget adjustments as needed.Payment Allocations:Allocate payments received from property owners to relevant accounts, including levies, maintenance fees, and other expenses.Ensure accurate and timely processing of payments and reconcile accounts.10-Year Maintenance Plans:Collaborate with property managers to develop and update 10-year maintenance plans for properties.Analyse maintenance requirements, costs, and priorities to ensure effective planning and budget allocation.Levy Increases:Coordinate levy increase processes in accordance with legal requirements and stakeholder approvals.Communicate levy increases to property owners and address any inquiries or concerns.Financial Reporting:Prepare and analyse financial reports, including income statements, balance sheets, and cash flow statements.Provide regular financial updates to stakeholders and management.Audit Procedures:Oversee audit procedures for Financial Year ends for Sectional Titles and Homeowners Associations.Ensure compliance with relevant accounting standards and regulations.Coordinate with external auditors and provide necessary documentation and support during audits.&nbsp;WeConnectU Integration:Familiarize oneself with the WeConnectU platform and utilize it for financial management tasks.Work with the IT team to ensure effective integration of financial data into the WeConnectU platform.&nbsp;Compliance and Regulation:Ensure compliance with relevant laws, regulations, and industry standards governing financial management in the real estate sector.Stay informed about changes in regulations and update financial practices accordingly.&nbsp;Collaboration and Communication:Collaborate with property managers, stakeholders, and other departments to address financial concerns and achieve portfolio objectives.Communicate financial information effectively to non-financial stakeholders.&nbsp;Qualifications and Experience:Bachelor’s degree in accounting, Finance, or related field.Articles in financial accounting.Minimum of 3-5 years of experience in accounting or financial managementExperience with budgeting, financial analysis, and reporting.Proficiency in accounting software and Microsoft Excel.Experience or willingness to learn WeConnectU platform.&nbsp;Skills and Competencies:Strong analytical and problem-solving skills.Excellent attention to detail and accuracy.Ability to work independently and collaboratively in a team environment.Effective communication and interpersonal skills.Proactive and adaptable to changing priorities.Knowledge of South African real estate regulations and compliance requirements.&nbsp;Working Conditions:This role is based in Rustenburg, South Africa, and may require occasional travel to properties within the portfolio.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002491-YDG",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p21678fed-d605-4088-be5d-5fbb89bbc1f8"
    },
    {
      "jobTitle": "Section Manager (U/G)",
      "startDate": "2024-07-23 - 2024-08-22",
      "vacancyType": "Permanent",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Responsibilities:\nAssist in controlling, managing, and directing underground mining operations per regulations.\nMinimum Requirements:\nGrade 12 or NQF 4 EquivalentMine Manager's Certificate of Competency3-5 years’ experience as a Mine Manager (MHSA 2.6.1 or 3.1 appointment)Degree or NQF 7 Equivalent in Mining Engineering\nPreferred Qualifications:\nManagement Programme / MDP / MAP3-4 years Trackless Mining experience\nSkills and Knowledge:\nStrong interpersonal skillsKnowledge of HR systems and related legislationProficient in MS Office and SAP System\nPhysical/Legal Requirements:\nMedical fitness certificateClear criminal recordValid driving license",
      "contact": "Welma",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002492-R",
      "iconLink": "/assets/agency_icons/pro-personnel.jpg",
      "uuid": "p9f685f34-84db-499c-b735-de19a5cd7bbb"
    }
  ]
}
