{
    "title": "govpage-public-sector",
    "blogPosts": [
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/kwazulu-natal-transport_orig.jpg",
            "href": "https://www.govpage.co.za/kwazulu-natal-transport-vacancies-blog/kwazulu-natal-department-of-transport-vacancies5835135",
            "title": "KWAZULU NATAL DEPARTMENT OF TRANSPORT VACANCIES",
            "content": [],
            "postedDate": "14/8/2024",
            "iframe": "https://drive.google.com/file/d/1mEoXS1Da0YaUhPInIxtw2K1pPgrwyhZH/preview",
            "uuid": "pe166fb3b-f0a6-4012-92f2-c573b737cc75"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/north-west-department-of-health_orig.png",
            "href": "https://www.govpage.co.za/north-west-health-vacancies-blog/north-west-department-of-health-vacancies6964746",
            "title": "NORTH WEST DEPARTMENT OF HEALTH VACANCIES",
            "content": [
                " \nNORTH WEST DEPARTMENT OF HEALTH\n \nHealthy Living for All\n ",
                " \n \n \nSTAFF NURSE\nSalary: R209 112.00 – R362 187.00 p.a (plus benefits) \n• Ref No: K36563/01 \n• Centre: Ditsobotla Sub-District x4, Matlosana Sub District x1, Witrand Hospital x1, Klerksdorp/Tshepong Hospital Complex x4, General De Larey Hospital x4, Gelukspan District Hospital x1, Koster Hospital x1, Moses Kotane Hospital x4, Joe Morolong Memorial Hospital x1 & Potchefstroom Hospital x1\nFinal salary will be determined by appropriate/recognizable experience in Nursing after registration with the South African Nursing Council as Enrolled Staff Nurse. \n \nRequirements: • Qualification that allows registration with the South African Nursing Council as a Staff Nurse (Enrolled Nurse) • Shortlisted candidates will be required to submit current proof of registration with SANC as Staff Nurse (Enrolled Nurse) • Appropriate/recognizable experience in nursing after registration with the South African Nursing Council as Staff Nurse • Good communication and interpersonal skills • Sound knowledge of nursing procedures • Report writing skills, planning and organizing.\n \nDuties: • Provide elementary assistance to the Medical and Nursing professions • Provide health promotion through health education • Perform a basic clinical nursing practice in accordance with the scope of practice and nursing standards as determined by the relevant health facility • Promote quality of basic nursing care as directed by the professional scope of practice and standards as determined by the relevant health facility • Demonstrate basic communication with patients and supervisors • Work as part of a multi-disciplinary team to ensure good nursing care • Work effectively, cooperatively and amicably with person of diverse intellectual, cultural racial or religious difference • Display a concern for patients, promoting and advocating basic care, including awareness and willingness to respond to patient’s needs, requirements and expectations • Adhere to Batho Pele Principles and Patient’s Rights.\n \nEnquiries: Mr A Bogatsu, Tel. (018) 384 0240 (Ditsobotla Sub-District, General De La Rey Hospital & Gelukspan District Hospital)\nMs J Olivier, Tel. (018) 464 2210 (Matlosana Sub-District)\nMs L Matsipe, Tel. (018) 294 9100 (Witrand Hospital)\nMs L Mosia, Tel. (018) 406 4600 (Klerksdorp/Tshepong Hospital Complex)\nMr E Mmusi, Tel. (014) 590 5100 (Koster Hospital & Moses Kotane Hospital)\nMr M.S Montshiwagae, Tel. (053) 928 9312 (Joe Morolong Memorial Hospital) \nMr K Molatudi, Tel. (018) 293 4417 (Potchefstroom Hospital)\n \n \n \n \n \nNURSING ASSISTANT\nSalary: R165 177.00 – R 283 347.00 p.a (plus benefits)\n• Ref No: K36563/02 \n• Centre: Mafikeng Provincial Hospital x1, Bophelong Psychiatric Hospital x1, Joe Morolong Memorial Hospital x1, General De Larey Hospital x1, Tswaing Sub-District x5, Gelukspan District Hospital x1, Witrand Hospital x1, Job Shimankana Tabane Hospital x3, Klerksdorp/Tshepong Hospital Complex x2, Madibeng Sub-District x1, Moretele Sub-District x1, Rustenburg Sub-District x2, Moses Kotane Hospital x4 & Potchefstroom Hospital x2\nFinal salary will be determined by appropriate/recognizable experience in Nursing after registration with the South African Nursing Council as a Nursing Assistant. \n \nRequirements: • Qualification that allows registration with the South African Nursing Council as Nursing Assistant (Enrolled Nursing Assistant) • Shortlisted candidates will be required to submit current proof of registration with South African Nursing Council as a Nursing Assistant • Appropriate/recognizable experience in nursing after registration with the South African Nursing Council as Nursing Assistant.\n \nDuties: • Perform a basic clinical nursing practice in accordance with the scope of practice and nursing standards as determined by the relevant health facility • Promote quality of basic nursing care as directed by the professional scope of practice and standards as determined by the relevant health facility • Demonstrate basic communication with patients and supervisors • Work as part of a multi-disciplinary team to ensure good nursing care • Work effectively, cooperatively and amicably with person of diverse intellectual, cultural racial or religious difference • Display a concern for patients, promoting and advocating basic care, including awareness and willingness to respond to patient’s needs, requirements and expectations • Adhere to Batho Pele Principles and Patient’s Rights.\n \nEnquiries: Mr M Legote, Tel. (018) 383 6700 (Mafikeng Provincial Hospital)\nMs E Tau, Tel. (018) 383 6700 (Bophelong Psychiatric Hospital)\nMr M.S Montshiwagae, Tel 053 928 9312 (Joe Morolong Memorial Hospital) \nMr A Bogatsu, Tel. (018) 384 0240 (Gelukspan District Hospital, Tswaing Sub-District & General De Larey Hospital)\nMs L Matsipe, Tel. (018) 294 9100 (Witrand Hospital)\nMs S Magwaza, Tel. (014) 590 5100 (Job Shimankana Tabane Hospital) \nMs L Mosia, Tel. (018) 406 4600 (Klerksdorp/Tshepong Hospital Complex) \nMr E Mmusi, Tel. (014) 590 5100 (Madibeng Sub District, Moretele Sub District, Rustenburg Sub District & Moses Kotane Hospital)\nMr K Molatudi, Tel. (018) 293 4417 (Potchefstroom Hospital)\n \n \n \n ",
                " \n \n \n \n \nEMERGENCY CARE TECHNICIAN \nSalary: R250 947.00 – R399 705.00 p.a (plus benefits)\n• Ref No: K36563/03 \n• Centre: Ditsobotla Sub-District x1, Ratlou Sub-District x1 & Matlosana Sub-District x2 \nFinal salary will be determined by the years of experience after registration with the Health Professions Council of South Africa as an Emergency Care Technician.\n \nRequirements: • Successful completion of Emergency Care Technician (ECT) Course that allows registration with the Health Professions Council of South Africa (HPCSA) as Emergency Care Technician (ECT) • Shortlisted candidates will be required to submit current proof of registration with the Health Professions Council of South Africa as Emergency Care Technician (ECT) • Appropriate experience after registration with the Health Professions Council of South Africa as an Emergency Care Technician.\n \nDuties: • Transport and care of patients according to scope of practice • Maintain vehicle and medical equipment in good working order • Wash, clean and disinfect the interior/exterior of the vehicle • Change and replenish surgical sundries and medical gas and ensure that all items used before expiry date • Maintain best clinical practices in accordance with quality standards while supervising ECO’s • Maintain accurate and reliable records at all times • Undertake any other duties as allocated by shift leader.\n \nEnquiries: Mr A Bogatsu, Tel. (018) 384 0240 (Ditsobotla Sub District & Ratlou Sub-District)\nMs J Olivier, Tel. (018) 464 2210 (Matlosana Sub-District)\n \n \n \n \n \nPHYSIOTHERAPY ASSISTANT\nSalary: R205 773.00 - R278 910.00 p.a (plus benefits)\n• Ref No: K36563/04 \n• Centre: General De Larey Hospital\nFinal salary will be determined by appropriate/recognizable experience in Physiotherapy Assistant after registration with the Health Professions Council of South Africa as Physiotherapy Assistant.\n \nRequirements: • Appropriate qualification that allows for the required registration with the Health Professions Council of South Africa (HPCSA) in Physiotherapy Assistant • Shortlisted candidates will be required to submit current proof of registration with the Health Professions Council of South Africa (HPCSA) as Physiotherapy Assistant • Appropriate/recognizable experience in Physiotherapy Assistant after registration with the Health Professions Council of South Africa (HPCSA) as Physiotherapist Assistant.\n \nDuties: • Administer health education, therapeutic exercises, massage and therapeutic exercise for children and adults • Promote health, prevent disability, rehabilitate patients, motivate and safeguard patients • Modify and coordinate treatment • Monitor and record patient’s progress during treatment • Fitting patients for orthopaedic braces and other supportive devices. \n \nEnquiries: Ms M Motshegwa, Tel. (018) 632 3041\n \n \n \n \n \n \nCLINICAL PROGRAMME CO-ORDINATOR \nSalary: R520 560.00 p.a (plus benefits)\n• Ref No: K36563/05 \n• Centre: Tswaing Sub-District: Tuberculosis x1, Mental Health x1 & Chronic Diseases x1, Matlosana Sub-District: HIV/AIDS x1 & Klerksdorp/Tshepong Hospital: Tuberculosis x1, Infection & Prevention Control x2\n \nRequirements: • Basic qualification accredited with the South African Nursing Council in terms of Government Notice 425 (i.e. diploma/degree in nursing) or equivalent qualification that allows registration with the South African Nursing Council as a Professional Nurse • Shortlisted candidates will be required to submit current proof of registration with the SANC as a Professional Nurse • A minimum of 7 years appropriate/recognisable experience in nursing after registration as a Professional Nurse with the South African Nursing Council in General Nursing • Shortlisted candidates will be required to submit a valid work permit for Non-South African Citizens • A valid driver’s license.\n \nDUTIES FOR TUBERCOLOSIS: • TB management and planning of programs in line with TB guideline, safe quality care to patient, documentation, performing self-assessments • Improve the quality of health services through ideal hospital implementation, finance, human resource, equipment stock • Ensure and accelerate the implementation of the HIV and TB, management of admitted patients • Co-ordinate of TB statistics, quality daily data collection, submission and updated registers • All in and out patients screened for HIV and TB in all Units • Patients who are diagnosed with HIV and TB to be initiated on treatment • Risk management, Screening of patients and staff • Ensure all TB patients are weighed.\n \nDUTIES FOR MENTAL HEALTH: • Co-ordinate and manage mental health and substance abuse programme activities • Monitor and evaluate the mental Health Programme • Ensure communication involvement and participation by forming support group and planning with the stakeholders • Liaise with other Department and interact with NGO’s and Community-based organisation • Plan and organise own work and that support of personnel to ensure proper nursing care • Display a concern for patient promoting and advocating proper treatment and care, including awareness to respond to patient’s needs • Implement quality assurance programme • Assist the Sub District Management with compilation of strategic and Operational plans for the programme in accordance with national and provincial Health goals and objective in collaboration with relevant health personnel.\n \nDUTIES FOR CHRONIC DISEASES: • Co-ordinate Chronic, Geriatric and Rehabilitation program in the Sub District • Provide professional and technical support through management of chronic, Geriatric and Rehabilitation program in the Sub District • Conduct and participate in inter-professional and multi-disciplinary team work that promotes the goals of the chronic, Geriatric and Rehabilitation program • Verify, validate and monitor indicators and of Chronic Program and per DHIS and implementation of quality assurances guidelines, protocols, norms and standards of chronic, Geriatric and Rehabilitation program • Manage and utilise resources Human, Financial and Physical in accordance with relevant directives and legislation Chronic, Geriatric and Rehabilitation program, CHS Programs and as SDM team member.\n \nDUTIES FOR HIV/AIDS: • Co-ordinate and manage HIV/AIDS programme activities • Monitor and evaluate the HIV/AIDS Programme • Ensure communication involvement and participation by forming support groups and planning with the stakeholders • Liaise with other department and interact with NGOs and community-based organization • Plan and organize own work and that support of personnel to ensure proper nursing care • Display a concern for patient promoting and advocating proper treatment and care, including awareness and willingness to respond to patient needs requirement and expectation of Batho Pele Principles • Implement quality assurance programme • Assist the Sub-District Management with compilation of Strategic and Operational plans for the programme in accordance with national and Provincial Health goals and objective in collaboration with relevant health personnel external outlets • Inspect wards • Compile statistics and record keeping • Adhere to Batho Pele Principles and Policies.\n \nDUTIES FOR INFECTION AND PREVENTION CONTROL (IPC): • Responsible for planning, managing, coordinating and maintaining optimal infection prevention and control services to the institution • Infection Prevention Control ideal facilitation, Risk management, Infectious disease management and staff development • Effective management and utilization of human and financial resources to ensure optimal operational function in the area • Initiate and participate in training development and research within the nursing Department • Deliver a support to the nursing service and the institution • Maintain ethical standard and promote professional growth and self-development.\n \nEnquiries: Mr M Chacha, Tel. (053) 948 0883 (Tswaing Sub-District)\nMs J Olivier, Tel. (018) 464 2210 (Matlosana Sub-District) \nMs L Mosia, Tel. (018) 406 4600 (Klerksdorp/Tshepong Hospital Complex) \n \n \n \n \n ",
                "EMERGENCY CARE OFFICER GRADE 3 \nSalary: R206 619.00 - R271 584.00 p.a (plus benefits)\n• Ref No: K36563/06 \n• Centre: Mafikeng Sub District x1, Ramotshere Moilwa x2, Matlosana Sub District x3, Lekwa Teemane Sub-District x1 & Rustenburg Sub-District x1\nFinal salary will be determined by appropriate/recognizable experience in Ambulance Emergency Assistant (AEA) after registration with the Health Professions Council South Africa as Ambulance Emergency Assistant (AEA).\n \nRequirements: • Successful completion of an appropriate intermediate Life Support (ILS) course that allows registration with the Health Professions Council of South Africa as Ambulance Emergency Assistant (AEA) • Shortlisted candidates will be required to submit current proof of registration with the Health Professions Council of South Africa (HPCSA) as Ambulance Emergency Assistant • Knowledge of rules and regulations of the Roads Traffic • A valid 10 driver`s license and Public driver’s Permit.\n \nDuties: • Treat and transport patient to Hospital from scene and between Hospitals in accordance with relevant protocols • Change and replenish surgical sundries and medical gases and ensured items are disposed of timeously and are exchanged for fresh stock • Assist in maintaining a clean and tidy base • Maintain best clinical practices in accordance with quality standard • Perform overtime duties in accordance with Emergency in-service training and refresher courses • Undertake any other duties as allocated by supervisor.\n \nEnquiries: Mr A Bogatsu, Tel. (018) 384 0240 (Mahikeng Sub-District & Ramotshere Moiloa Sub District)\nMs J Olivier, Tel. (018) 464 2210 (Matlosa Sub-District)\nMr G.N Maibi, Tel. (053) 928 0503 (Lekwa Teemane Sub-District) \nMr E Mmusi, Tel. (014) 590 5100 (Rustenburg Sub District)\n \n \n \n \n \n \nPHARMACIST ASSISTANT (POST BASIC)\nSalary: R250 947.00 – R355 812.00 p.a (plus benefits) \n• Ref No: K36563/07 \n• Centre: JB Marks Sub-District (Ventersdorp Local Area)\nFinal salary will be determined by appropriate/recognizable experience in Pharmacist Assistant (Post Basic) after registration with the Health Professions Council South Africa as Pharmacist Assistant (Post Basic)\n \nRequirements: • Post-Basic Pharmacist Assistant qualification that allows registration with the South African Pharmacy Council as a Pharmacist Assistant (Post-Basic) • Shortlisted candidates will be required to submit current proof of registration with the South African Pharmacy Council as Pharmacist Assistant (Post-Basic) • Appropriate/recognizable years of experience after registration with the South African Pharmacy Council as a Pharmacist Assistant (Post-Basic). \n \nDuties: • Control supply and provisioning of stock to wards and District outlet • Receive and store pharmaceutical supplies • Dispense medication to patient • Issue medication to external outlets • Inspect wards • Compile statistics and record keeping • Prepare labels/pre-printed sachets and correct labels • Adhere to Batho Pele Principles and Policies.\n \nEnquiries: Mr P Nape, Tel. (018) 264 2048\n \n \n \n \n \n \nEMS SHIFT LEADER GRADE 3 \nSalary: R317 751.00 – R355 812.00 p.a (plus benefits) \n• Ref No: K36563/08 \n• Centre: Moses Kotane Sub-District \n \nRequirements: • For Grade 3: • Successful completion of the intermediate Life Support (ILS) course that allow registration with the Health Professions Council of South African (HPCSA) as Ambulance Emergency Assistant (AEA) • Shortlisted candidates will be required to submit current proof of registration with HPCSA as AEA • A minimum of 3 years after registration with HPCSA as AEA • For Grade 4: • Successful completion of the ECT programmes courses that allows registration with HPCSA as ECT • A minimum of 3 years after registration with HPCSA as ECT • For Grade 5: • Successful completion of the CCA course or National Diploma that allows registration with HPCSA as Paramedic • For Grade 6: • Successful completion of the B-Tech/BEMC Degree that allows registration with HPCSA as ECP • A valid code 10-14 (C1-EC) driver’s license with PDP. \n \nDuties: • Ensure vehicles medical equipment and station are kept clean, disinfected and in good working order at all times • Respond to major incidents and co-ordinate such incidents within the operational area care for and transport patients when need arise at an appropriate level of care • Manage surgical sundries and medical gas • Oversee best clinical practices in accordance with quality standards while maintaining CPD • Complete and submit all appropriate paperwork to the Station Manager before termination of the shift/daily and monthly as required • Hand over vehicle, equipment to the next shift fully replenished, clean and in good working order • Control and perform over time duties when required • Participate in training and quality assurance programs • Evaluate and manager performance of supervisees • Ensure an effective communication system in place within the shift • Respond to accidents involving emergency vehicles and prepare reports • Investigate all complaints received from internal and external resources and provide reports. \n \nEnquiries: Mr E Mmusi, Tel. (014) 590 5100",
                "NOTE: In line with the Employment Equity Plan of the Department of Health it is our intention to achieve equity in the workplace by offering opportunities for promotion and fair treatment through the elimination of unfair discrimination. People with disabilities are encouraged to apply. \n \n \nNOTE: Applications must be submitted on the new form Z83 (fully completed), obtainable from any Public Service Department or www.dpsa.gov.za and should be accompanied by a recently updated, comprehensive CV and ID document and the names of three referees. Only shortlisted candidates for the post will be required to submit certified documents. Non-RSA citizens/permanent resident permit holders must attach a copy of their permanent residence permits to their applications. Should you possess a foreign qualification, it must be accompanied by an evaluation certificate from the South African Qualifications Authority (SAQA). Failure to submit the requested documents will result in the application not being considered. All qualifications will be verified. It will be expected of candidates to be available for selection interviews on a date, time and place as determined by the Department. Applicants must indicate the reference number of the post in their applications. Candidates requiring additional information regarding advertised posts should direct their enquiries to the relevant person as indicated in the advertisement. Applications received after the closing date will not be considered. \n \nNote: Short-listed candidates will be subjected to security clearance and reference checking. Suitable candidates will be subjected to personnel suitability checks (criminal record check, citizenship verification, financial/asset record checks, qualification/study verification and previous employment verification). The Department reserves the right not to make appointments to the advertised posts. Failure to comply with the above requirements will result in the disqualification of the application. Receipt of applications will not be acknowledged and correspondence will be limited to short-listed candidates only. If you have not been contacted within 3 months of the closing date of this advertisement, please accept that your application was unsuccessful. \nNB: Candidates should note the following information on the new Z83 application form: \nPart A: All fields must be completed in full. \nPart B: All fields must be completed in full except when: \nPassport number: South African applicants need not provide passport numbers. \nAn applicant has responded “No” to the question “Are you conducting business with the State? or are you a Director of a Public or Private company conducting business with the State? If yes (provide the details)”, then it is acceptable for an applicant to indicate not applicable or leave blank to the question, “in the event that you are employed in the Public Service, will you immediately relinquish such business interests?” \n“If your profession or occupation requires official registration, provide date and particulars of registration”- Some applicants may not be in possession of such therefore it is acceptable if left blank or if not applicable is indicated. \n \nPart C: All fields must be completed. \nPart D: All fields must be completed. \nPart E, F, G: Noting that there is limited space provided applicants often indicate “refer to Curriculum Vitae (CV) or see attached”, this is acceptable as long as the CV has been attached and provides the required information. If the information is not provided in the CV, the applicant may be disqualified. It must be noted that a CV is an extension of the application of employment Z83, and applicants are accountable for the information that is provided therein. The questions related to conditions that prevent re-appointment under Part F must be answered. \nDeclaration must be completed and signed (including any attachments). \n \nAll posts attached to Ditsobotla Sub-District Office, must be forwarded to: Private Bag X 12051, Lichtenburg, 2740, Attention to: Mr R Digoamaje. \n \nAll posts attached to Matlosana Sub-District Office must be forwarded to: Private Bag A2, Klerksdorp, 2570, Attention to: Ms J Olivier. \n \nAll posts attached to Witrand Hospital, must be forwarded to: Private Bag X 253, Potchefstroom, 2520, Attention to: Ms L Matsipe. \n \nAll posts attached to Klerksdorp/Tshepong Hospital Complex must be forwarded to: Private Bag A14, Klerksdorp, 2570, Attention to: Ms L Mosia. \n \nAll posts attached to General De La Rey Hospital Complex must be forwarded to: Private Bag X 12025, Lichtenburg, 2740, Attention to: Mr J Nontenjwa. \n \nAll posts attached to Gelukspan District Hospital must be forwarded to: Private bag X 116, Mmabatho, 2735, Attention to: Ms K.E Mathe. \n \nAll posts attached to Koster/Swartruggens Hospital must be forwarded to: Private Bag X 1002, Swartruggens, 2835, Attention to: Ms C Motsei. \n \nAll posts attached to Moses Kotane Hospital must be forwarded to: Private Bag X 2, Sun City, 0316, Attention to: Ms M.M Marakalla. \n \nAll posts attached to Joe Morolong Memorial Hospital, applications must be forwarded to: Private Bag X 4, Vryburg, 8600, Attention to: Mr M.S Montshiwagae.\n \nAll posts attached to Potchefstroom Hospital, applications must be forwarded to: Private Bag X 938, Potchefstroom, 2531, Attention to: Mr K Molatudi. \n \nAll posts attached to Mafikeng Provincial Hospital must be forwarded to: Private Bag X 2031, Mafikeng 2745, Attention to: Mr M Legote. \n \nAll posts attached to Bophelong Psychiatric Hospital must be forwarded to: Private Bag X 2031, Mafikeng, 2745, Attention to: Ms E Tau. \n \nAll posts attached to Tswaing Sub-District Office must be forwarded to: Private Bag X 116, Mmabatho, 2735, Attention to: Mr M Chacha. \n \nAll posts attached to Job Shimankana Tabane Hospital must be forwarded to: Private Bag X 82079, Rustenburg, 0300, Attention to: Ms S Magwaza. \n \nAll posts attached to Madibeng Sub-District Office must be forwarded to: Private Bag X 5084, Brits, 2050, Attention to: Mr K Maluleke. \n \nAll posts attached to Moretele Sub District Office must be forwarded to: Private Bag X 454, Hammanskraal, 0400, Attention to: Mr P Dikobe. \n \nAll posts attached to Rustenburg Sub District Office must be forwarded to: Private Bag X 82055, Rustenburg, 0300, Attention to: Mr R Ramugondo. \n \nAll posts attached to Ratlou Sub-District Office must be forwarded to: Private Bag A 208, Madibogo, 2772, Attention to: Ms T Baase. \n \nAll posts attached to Mafikeng Sub-District Office, must be forwarded to: Private Bag X 116, Mmabatho, 2735, Attention to: Mr M.N Motlhabane. \n \nAll posts attached to Ramotshere Moiloa Sub-District Office, must be forwarded to: Private Bag X 6338, Zeerust, 2865, Attention to: Mr D Moloto. \n \nAll posts attached to Lekwa Teemane Sub-District Office, applications must be forwarded to Private Bag X 07, Bloemhof, 2660, Attention to: Ms T.H Ntsompe.\n \nAll posts attached to JB Marks Sub-District Office must be forwarded to: Private Bag X 1007, Ventersdorp, 2510, Attention to: Mr P Nape. \n \nAll posts attached to: Moses Kotane Sub District Office must be forwarded to: Private Bag X 1045, Mogwase, 314, Attention to: Mr L Mokotedi. \n \nCLOSING DATE: 23 AUGUST 2024"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "pcd32a996-bc29-4d80-92d1-1ccaeae46edd"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-joburg_orig.jpg",
            "href": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies5914232",
            "title": "CITY OF JOHANNESBURG VACANCIES",
            "content": [
                " \n\nCITY OF JOHANNESBURG\n \nGroup Corporate & Shared Services: Group Human Capital Management\n6th Floor, B Block Metropolitan Centre, 158 Civic Boulevard, Braamfontein\nPO Box 1049  Johannesburg, South Africa, 2000\nTel +27(0) 11 407 6111 - Fax +27(0) 11 339 1878\nwww.joburg.org.za\n ",
                "VACANCY CIRCULAR 075/2024 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Candidates \n \nCLOSING DATE: FRIDAY, 23 AUGUST 2024 \n \nWE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \nPERMANENT POSITION \nMANAGER: FLEET MAINTENANCE\n \nAPPLICATION REQUIREMENTS \n• Complete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \n• Applicants should take note that they can be required to provide proof of original documents during the selection process. \n• You will be requested to provide a brief description of your work experience relating to the vacancy. \n• Applicants with membership to professional bodies need to provide a membership number and expiry date. \n• If you are an internal applicant, your employee number will be required. \n• Applicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\n• The City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \n• The City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal-opportunity employer. \n• By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \n• However, registering your CV and/or receipt and acknowledgment of any kind shall not be an indication that your application will be successful and/or lead to employment. \n• The City of Johannesburg shall not be liable for any damage, loss, or liability of whatsoever nature arising from your use of the job opportunity section of this website. \n• The City of Johannesburg reserves the right not to make an appointment. \n• Any misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application.",
                "MANAGER: FLEET MAINTENANCE \nDepartment: Group Corporate and Shared Services \nBranch: Group SHELA & FCM \nDesignation: Manager: Fleet Maintenance \nRemuneration: R44 693,36 pm (basic salary, excluding benefits) \nLocation: 27 Stiemens Street, JD House, Braamfontein \n \nMinimum Requirements: \nGrade 12 / NQF level 4. \nBachelor’s degree in Transport, Logistics Management or Fleet related (NQF level 7). \nCertificate in Automotive Repair and maintenance or related. \n5 years’ functional experience within Fleet Management environments. \n2 years’ experience in fleet maintenance and operations. \nExperience or exposure in fleet bid process and contract management. \n \nPrimary Function: \nCoordinate and provide oversight support activities for all vehicle managed maintenance contracts acquired for the City core department and entities. \n \nKey Performance Areas: \nPlan, coordinate and oversee vehicle maintenance database in liaison with City user departments and entities. \nAssess vehicle needs and utilization and advise users group on implications and processes to follow. \nEnsure that there is sufficient financial planning, budget, monitoring and reporting within the department in consultation with user department and entities. \nManage the compliance to standard operation procedures with regards to maintenance of vehicle and equipment in line with original equipment Manufacturer (OEM) standards. \nManage and promote safety of employees in the workplace and comply with all relevant legislation. \n \nLeading Competencies: \nComputer Literacy \nCommunication (verbal and written) \nLeadership\nPlanning and organising \nPeople Management \nInnovative and analytical \nPresentation skills \nTime Management \nDecision making \nMulti-tasking\nInterpersonal.\n \nCore Competencies: \nKnowledge of the following: \nRisk Management \nVehicle Maintenance Management \nMunicipal Financial Management \nProject management \nSupply Chain Management. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1D3BEb9SbSeKWDhFMxNKBjwew554\nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Samukelisiwe Yeni \nTel No: 060 306 3452 \nCLOSING DATE: FRIDAY, 23 AUGUST 2024 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation, \nEmployment record verification, \nCriminal check, \nIdentity validation."
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p02eec2bc-86d2-41b3-8a2d-c078d707b05e"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-tshwane_orig.jpg",
            "href": "https://www.govpage.co.za/city-of-tshwane-metropolitan-municipality-vacancies-blog/city-of-tshwane-vacancies5963644",
            "title": "CITY OF TSHWANE VACANCIES",
            "content": [
                " \nCITY OF TSHWANE\n \nJOB FORUM 17/2024\n \nINTERNAL/EXTERNAL JOB FORUM\n \nOur policy is to provide equal employment opportunities to all qualified persons without regard to race, religious belief, age, national origin, marital status, physical disability, HIV status, gender, social origin, culture, political opinion, conscience and sexual orientation. Persons with disabilities are encouraged to apply. The City of Tshwane is committed to employment equity. Preference may be given to appointable applicants from underrepresented designated groups in terms of the City of Tshwane Employment Equity Plan. The City retains the right not to make an appointment and to verify all information provided by candidates. \n \nApplicants should note that they will be required to provide proof of their qualifications or any other relevant documents (certified copies or original documents) during the selection process. Appointments will be subject to the positive verification of qualifications (from Grade 12 upwards). Any misrepresentation of qualifications or information on the application of an applicant, failure to present proof of claimed qualifications or fraudulent qualifications will disqualify a candidate for appointment. If it is an internal candidate, he/she may be disciplined for misconduct. \n \nThe online system closes at midnight on the closing date and no late applications can be accepted. If you do not receive correspondence from our office within 21 days of the application’s closing date, please consider your application unsuccessful.\n ",
                "The City of Tshwane seeks to fill the positions in this job forum on a permanent basis.\n \nThe complete job forum can be accessed by visiting the City of Tshwane public website (https://www.tshwane.gov.za) and clicking on Documents and then Job Forums.\n \nPLEASE APPLY ONLINE BY VISITING THE CITY OF TSHWANE PUBLIC WEBSITE AND CLICKING THE E-RECRUITMENT LINK\n(LOCATED UNDER BOTH THE E-SERVICES AND THE CAREERS LINK)\nClosing date: 21 August 2024\n(Online applications close at midnight.)\n \nGeneral enquiries: LJ Moleli (012 358 4346)\nRecruitment Centre\nUpper Ground Level, Middestad Building\n252 Thabo Sehume Street\nPretoria CBD\n \nIf you have trouble in registering your profile or applying for positions, send an email with a detailed description to: eRecruitHelp@tshwane.gov.za",
                "SAFETY, SECURITY AND EMS\n \nDEPARTMENT: TSHWANE METRO POLICE\nDivision: Generic\nSection: Generic\nLocation: All Tshwane regions\nReference number COSA151-2024\nWARRANT OFFICER (82 POSTS)\nTo be advertised Internal External\nThis position seeks to attract African female, African male, Coloured female, Coloured male, Indian female, Indian male, White female, White male\nJob level T11 \nScale R359 952,00 – R499 920,00 per annum\nEstimated remuneration package R518 224,91 – R696 373,84 per annum\n \nJob purpose\nTo effectively execute all activities, operations and interventions related to all fields within the operational policing environment in order to ensure effective and efficient service delivery in the City of Tshwane metropolitan area by taking charge of operational shifts during the execution of operational duties as well as requested ad hoc duties\n \nAppointment requirements\nGrade 12\nRegistration as a Traffic Officer in terms of the National Road Traffic Act, 1996 (Act 93 of 1996)\nAppointment as a member of a municipal police service in terms of the South African Police Service Act, 1995 (Act 68 of 1995)\nAt least four years’ relevant working experience\nMust possess a valid Code B or EB driving licence\nMust pass a medical and physical test as determined by the Chief of Police\nNo criminal convictions, record or pending criminal charges (excluding previous conviction(s) relating to political activities in the previous dispensation) and such a person shall allow their fingerprints to be taken\nMust be prepared to take the Oath of Office of the Tshwane Metro Police Department\nApplicants must be willing to be placed or deployed anywhere in Tshwane from time to time, as required and determined by departmental management. Thus, by applying for any of these positions, the applicants irrevocably accept this condition.\n \nPersonal attributes and/or competencies\nGood verbal and written communication skills; adaptability and flexibility; leadership and people skills; independence regarding the execution of assigned\n \nduties; ability to work under pressure; willingness to accept responsibility; ability to work with deadlines; ability to make sound decisions; innovative thinking skills; ability to pay attention to detail; good linguistic proficiency; physical and mental fitness; physical capability to operate under operational requirements and external conditions; ability to perform under physically threatening situations and social trauma; integrity; decisiveness\n \nPrimary functions\nPerform law enforcement actions according to the departmental scorecard in terms of the enforcement of the National Road Traffic Act, 1996 (Act 93 of 1996), by-laws, patrols, roadblocks and information-driven operations\nPerform crime prevention actions through visible policing\nAttend and secure accident scenes\nAttend to any incident on public roads to ensure the safe and free flow of traffic\nSupervise and ensure compliance in terms of complaints (animals, noise, traffic-related, etc)\nExecute duties professionally and efficiently according to all procedures and policies\nSupervise road policing, crime prevention and municipal by-law actions in all areas of Tshwane\nSupervise and assist with escort duties\nSupervise all activities within a unit\nPerform ad hoc duties when requested\n \n \nSAP\nS70011823; S70011827; S70011830; S70011845; S70011846; S70011847; S70011848; S70011849; S70011850; S70011851; S70011852; S70011853; S70011854; S70012629; S70012630; S70012631; S70012428; S70012429; S70012431; S70012438; S70012439; S70012440; S70012441; S70012442; S70012443; S70095913; S70095914; S70095915; S70095916; S70095917; S70012754; S70012755; S70012764; S70012771; S70013048; S70013049; S70013050; S70013055; S70013059; S70013060; S70013061; S70013062; S70013063; S70013064; S70013065; S70013066; S70013067; S70013278; S70013279; S70013280; S70095918; S70095919; S70095920; S70095921; S70095922; S70013340; S70013456; S70013462; S70013463; S70013464; S70013465; S70013466; S70013467; S70013468; S70013629; S70095947; S70013742; S70013744; S70013749; S70013752; S70013753; S70013921; S70013922; S70013923; S70013924; S70013925; S70013926; S70013927; S70013928; S70014378; S70095958; S70095959\n \nNew/natural attrition: Natural attrition\n \nEnquiries: Dorah Letshela (012 358 5676)/Marga Boucher (012 358 5698)"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p8808467e-c4f3-45c6-9d3a-8fdbf17e5823"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-credit-regulator-ncr_orig.jpg",
            "href": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies7860878",
            "title": "NATIONAL CREDIT REGULATOR (NCR) VACANCIES",
            "content": [
                " \nNATIONAL CREDIT REGULATOR (NCR)\n \nThe National Credit Regulator (NCR) was established as the regulator under the National Credit Act 34 of 2005 (the Act) and is responsible for the regulation of the South African credit industry. It is tasked with carrying out education, research, policy development, registration of industry participants, i.e. credit providers, credit bureaux, alternative dispute resolution agents, payment distribution agents and debt counsellors, investigation of complaints, and enforcement of the Act.\nThe Act requires the NCR to promote the development of an accessible credit market, particularly to address the needs of historically disadvantaged persons, low income persons, and remote, isolated or low density communities. \n ",
                "The NCR invites applications from suitable candidates for the following position:\n \nSENIOR LEGAL ADVISOR: INVESTIGATIONS & ENFORCEMENT \nPaterson Grade: D-Lower \nSalary ranges from R405 200 – R769 900 \n \nRequirements:\n▪ The suitable candidate must hold a four-year legal degree (LLB / BProc) Degree and must be an admitted attorney or advocate with substantial commercial litigation experience. \n▪ The suitable candidate must have at least 5 years post admission litigation experience. \n▪ The suitable candidate must have knowledge of debt counselling practices and processes. \n▪ The suitable candidate must have a minimum of five (5) years relevant working experience in a financial, regulatory, or legal environment. \n▪ A minimum of two (2) years in a supervisory role will be an added advantage. \n▪ Experience working within the credit industry will serve as an added advantage. \n▪ Insolvency procedure knowledge and experience will serve as an added advantage. \n \nDuties:\n▪ The successful candidate will deal with litigation matters, which will include complex and contentious matters, on behalf of the Investigations and Enforcement Department within the National Consumer Tribunal, High Court, SCA and Constitutional Court. \n▪ Assessment of investigation reports and evidence \n▪ Drafting of pleadings and/or the necessary enforcement action on behalf of the NCR \n▪ Representation and litigation of matters on behalf of the NCR and the Department at the National Consumer Tribunal and/or Courts. \n▪ Provide support to the Investigations and Enforcement Manager in ensuring the department achieves its targets. \n▪ Handle complex complaints and enquiries referred by the Manager of the Department / Exco as and when required. \n▪ Oversee the enforcement team (Junior and – Legal Advisors) by providing technical inputs as well as monitoring performance. \n▪ Review of drafts and pleadings submitted by the enforcement team. \n▪ Providing guidance/training to inspectors, legal advisors, internal and external stakeholders. \n▪ Liaising with internal and external stakeholders. \n▪ Contract Management and review of performance in line with service level agreements. \n▪ Provide effective legal advice in respect of the NCA and other relevant legislation. \n▪ Weekly, monthly, and quarterly report compilation of departmental performance. \n▪ Assist with development and implementation of departmental policies and procedures. \n▪ Legal Risk detection. \n▪ Participate in appropriate committees as and when required and provide the necessary legal inputs. \n▪ Draft and review Terms of Reference, Memorandums, Contracts, Service Level Agreements, Tenders, Settlement Agreements and Opinions. \n▪ Conduct research on legal matters impacting the NCA to ensure improved regulatory dispensation. \n▪ Budget monitoring. \n▪ Investigations and Report compilation when required to do so. ▪ Ensure timeous delivery of agreed outcomes \n\nTechnical Skills:\n▪ Knowledge of the National Credit Act and civil court procedures.\n▪ At least 5 years’ post admission litigation experience.\n▪ Good understanding of the South African Consumer Credit Market.\n▪ Supervisory skills.\n▪ Leadership skills.\n▪ Excellent writing ability.\n▪ Evaluative and problem-solving skills.\n▪ Computer literate and administrative skills.\n▪ Strong interpretative skills.\n▪ Research and presentative skills.\n▪ Contract Management Skills.\n▪ Time Management.\n \nPersonal Competencies:\n• Presentable, professional, and confident while being diplomatic and tactful.\n• Critical thinking.\n• Dependable.\n• Ability to make decisions, give direction, provide solutions, take accountability, and accept criticism or corrections.\n• Must be able to work in a team-oriented environment, manage conflict and promote teamwork.\n• Focused and disciplined as well as results driven.\n• Well-spoken with good communication and listening skills.\n• Flexible and innovative.\n• Negotiation skills.\n• Must have strong personal and professional ethics with high levels of integrity.\n• Must be able to work under immense pressure.\n• Must be willing to travel if and when required.\n• Supportive skills.\n• Strong service oriented.",
                "Closing Date: 20 August 2024\n \nThe National Credit Regulator is an equal opportunity organisation which offers competitive market related packages.\n \nSuitable persons should send a detailed CV quoting the relevant reference number to: EST-recruitment@ncr.org.za\n \nCorrespondence will only be entered into with short listed candidates. The National Credit Regulator reserves the right not to make an appointment.\n \nRef: SLA/8/24"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p94e26e95-9546-4298-a8e6-a48e33a0cbb2"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ecdc_orig.jpg",
            "href": "https://www.govpage.co.za/eastern-cape-development-corporation-ecdc-vacancies-blog/eastern-cape-development-corporation-ecdc-vacancies6015075",
            "title": "EASTERN CAPE DEVELOPMENT CORPORATION (ECDC) VACANCIES",
            "content": [
                " \nEASTERN CAPE DEVELOPMENT CORPORATION (ECDC)\n ",
                "PROGRAM MANAGER- INFRASTRUCTURE SERVICES AND FACILITIES MANAGEMENT \nEAST LONDON \nCONTRACT FOR 12 MONTHS \n \nKEY DUTIES AND RESPONSIBILITIES \nThe incumbent will be engaged under the incubation project/ programme framework management responsible for initiation, planning and implementation of allocated infrastructure projects for National, Provincial and municipal clients. The role will entail management of performance of project team to ensure that projects are implemented applying the principles of project management which includes quality, timeframes, budget parameters, consultant and contractor service delivery agreements. Ensure compliance with any relevant and applicable legislation. Prepare individual project reports on status, expenditure, variations, delays, etc on allocated projects and submit to the Snr: Programme Manager Infrastructure and Facilities Services. Continuous monitoring and evaluation of project performance to ensure delivery of project objectives and retention of existing clients. Risk management to identify and mitigate risk for project success. \n \nMINIMUM REQUIREMENTS \nRelevant bachelor’s degree or equivalent in-Built Environment, professional accreditation will an added advantage (Quantity Surveying, Architecture, Engineering). \nAt least 7 years relevant experience in the built environment on infrastructure projects and/or facilities maintenance / management of which 3 years should be at supervisory or consultancy level. \nAn in-depth understanding of facilities management and/ or Infrastructure programme management, advanced project and maintenance management, sound understanding of Health, Safety and Environmental legislation and its application to the built environment; as well as working with multi-disciplinary teams is a pre-requisite. \nThe incumbent will be engaged under the incubation / project programme framework \n \nThis is a contract position for 12 months, and the successful candidate will be subjected to signing of a performance contract and verification of qualification. If you have not been contacted within eight (8) weeks after the closing date of the advertisement, please regard your application as unsuccessful. \n \n \nIn making these appointments, the ECDC reserves the right to apply the principles enshrined in the Employment Equity Act, its policies, and plans. \n \nPlease send your detailed CV and certified copies of qualifications to The Human Resources Department \nTel: (043) 704 5620 \nEmail: humanresources@ecdc.co.za\n \nClosing date: 23 August 2024",
                "HEAD: LEGAL, GOVERNANCE AND COMPLIANCE \nFIVE (5) YEAR CONTRACT: GRADE 21 – (TOTAL COST TO COMPANY) \n \nThe incumbent shall be responsible for the following: \nThe role entails overseeing and directing the management of the Corporation’s legal, governance and compliance function. The Head shall be responsible for providing overall strategic leadership for the Corporation relating to planning, resourcing, execution, monitoring and reporting for functions falling under the legal, governance, and compliance portfolio. In relation to legal services, the role entails the management of the Corporation legal services function in a manner that effectively prevents, mitigates and neutralises legal risks and legal matters in a cost-effective manner. In relation to governance, the role entails provision of direction and oversight relating to the company secretariat services, risk and ethics management, as well as fraud prevention and anti-corruption measures. With respect to the compliance function, the role entails directing and managing the overall compliance obligation of the Corporation, ensuring compliance planning, monitoring and reporting with the ultimate objective of safeguarding compliance with relevant laws and regulations. \n \nMINIMUM REQUIREMENTS \nA bachelor’s degree in law and a relevant post graduate degree at master’s level or legal profession accreditation particularly admission as an attorney or advocate. \nA minimum of 10 years working experience in professional legal services practice and/or: management or governance environment involving company secretariat or legal services of which 5 years must be at senior management level. \nAn experience of working in a public entity environment will be an added advantage. \n \nThis is a five-year contract position, and the successful candidate will be subjected to signing of a performance contract and verification of qualification. If you have not been contacted within eight (8) weeks after the closing date of the advertisement, please regard your application as unsuccessful. \n \n \nIn making these appointments, the ECDC reserves the right to apply the principles enshrined in the Employment Equity Act, its policies, and plans. \n \nPlease send your detailed CV and certified copies of qualifications to \nThe Human Capital Department \nTel: (043) 704 5783 \nEmail: humanresources@ecdc.co.za\n \nClosing date: 05 August 2024"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p69e82ac7-b296-4442-9594-9de0530b6f5a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/eastern-cape-liquor-board_orig.png",
            "href": "https://www.govpage.co.za/eastern-cape-liquor-board-eclb-vacancies-blog/eastern-cape-liquor-board-eclb-vacancies1446823",
            "title": "EASTERN CAPE LIQUOR BOARD (ECLB) VACANCIES",
            "content": [
                " \nEASTERN CAPE LIQUOR BOARD (ECLB)\n ",
                "CALL FOR NOMINATIONS TO SERVE ON THE AUDIT COMMITTEE OF THE EASTERN CAPE LIQUOR BOARD \n \nThe entity wishes to invite nominations for the appointment to the Audit Committee in terms of section 77 of the Public Finance Management Act No. 1 of 1999.  One vacancy currently exists in the ECLB Audit Committee that needs to be filled to assist the entity to comply with the PFMA and related legislative framework.\n \nRequirements: Nominees must be in possession of a relevant three-year degree/ qualification in Information and Communication Technology. A postgraduate degree/qualification will be an added advantage.\n \nExperience and Skills: Public sector experience ●Corporate governance & financial management experience ●Understanding of the role of the public entity Boards ●Experience in risk management practices ●Understanding of internal controls ● Understanding of the PFMA, Treasury Regulations and related legislation governing public entity administration ●Understanding the role of internal and external auditors ●Understanding Public Service Regulations framework. ●Extensive expertise in ICT governance, strategy & its implementation, ICT investment as well as monitoring the management and mitigation of ICT risks. ●Knowledge and understanding of King IV Report on Corporate Governance. ●Well-developed business acumen and leadership skills. ●Excellent communication skills (verbal and written).\n \nThe Audit Committee shall meet at least once a quarter to regulate and discharge its responsibilities as contained in the charter outlining its formal terms of reference. The responsibilities of the Audit Committee include to review, inter alia, the following: The effectiveness of the internal controls including computerised information systems control and security, the quality of financial and other management information produced to ensure integrity and reliability, as well as any related significant findings and recommendations of internal and external auditors, together with Management’s responses thereto ● The effectiveness of the internal audit function ● The risk areas of the entities’ operations to be covered in the scope of internal and external audits ●The adequacy, reliability and accuracy of the financial information provided to management and other users of such information ● The entities compliance with legal and regulatory provisions ● The activities of the internal audit function, including its annual work programme, coordination with the external auditors, the reports of significant investigations, etc.\n \nTerm of office and remuneration: The term of appointment is for a 3 year period. Members of the Audit Committee are remunerated in terms of the tariffs that have been set by the DEDEAT for the ECLB.",
                "The ECLB is an equal opportunity organization. Nominations are to be submitted in the form of a detailed CV, accompanied by certified copies of qualifications, certificates and identity documents. Failure to submit the required documents will result in the application not being considered. \n \nGovernment employees interested in serving in the ECLB Audit Committee must submit an appropriate approval allowing them consideration for the filling of this vacancy.\n \nNominations can be hand delivered at: The Eastern Cape Liquor Board offices situated at: Shop 10 Beacon Bay Crossing; Beacon Bay; East London.\n \nOR\nEmailed to: recruitment@eclb.co.za\n \nFor further details contact the Senior Manager Corporate Services Ms. L.L. Tini on 043 700 0900.\n \nTHE BOARD RESERVES THE RIGHT NOT TO MAKE AN APPOINTMENT.\n\nNominations close on Wednesday, 21 August 2024.\n \nNB: Due to the number of applications expected only shortlisted candidates will receive correspondence, the Board would however like to thank you for showing interest."
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p1da236af-7c21-4f55-89cb-10c225c207d4"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/mega-logo_orig.png",
            "href": "https://www.govpage.co.za/mpumalanga-economic-growth-agency-mega-vacancies-blog/mpumalanga-economic-growth-agency-mega-vacancies2454279",
            "title": "MPUMALANGA ECONOMIC GROWTH AGENCY (MEGA) VACANCIES",
            "content": [
                " \nMPUMALANGA ECONOMIC GROWTH AGENCY (MEGA)\n  \nEXTERNAL ADVERTISEMENT\n ",
                " \nThe Department of Economic Development & Tourism (DEDT), in collaboration with the Department of Trade, Industry and Competition (the ‘Dtic”), are in the process of implementing the Nkomazi Special Economic Zone (NSEZ) at Komatipoort in Mpumalanga. The NSEZ happens to be one of the strategic projects driven by the Mpumalanga Government not only to expand the industrial base of the provincial economy but also to, among other things,\n▪ Stimulate robust inclusive economic growth and create more job opportunities for the people of Mpumalanga and beyond;\n▪ Increase the capabilities and capacity to promote export and services into targeted high growth markets such as the African Continental Free Trade Area, BRICS, etc.; and\n▪ Attract foreign direct investment and domestic inflows into Mpumalanga Province.\n \nCurrently, DEDT has assigned the Mpumalanga Economic Growth Agency to, inter alia, recruit suitably qualified individuals to fill in the following positions on a Fixed-term contract of five (5) years:\n \nNOTE: Dear applicant, we regret to inform you that the position of Chief Executive Officer (CEO ref: NKOSEZ 2024/01) that was published on the 11th of August 2024, in the Sunday Times Newspaper has been retracted/withdrawn. Please accept our sincerest apologies for any inconvenience this may have caused.\nAll the other information remains the same.\n \n ",
                " \n \nCHIEF FINANCIAL OFFICER \nReference code NKOSEZ 2024/02\nType of employment 5 YEAR CONTRACT\n \nPurpose\nTo formulate and execute SEZ’s financial strategy, policies and guidelines, supports the commercial success, compliance to PFMA and related finance principles as well as managing the introduction of financial best practice’s governance, accounting and treasury standards per the Public Finance Management Act that will ensure SEZ’s long-term financial viability and sustainability.\n \nRequired minimum qualification\n• Chartered Accountant (CA) and MBA degree or equivalent qualification.\n• Leadership Certificate / Tax and Managerial Finance will be an added advantage.\n \nSALARY Market-Related\n \nRequired minimum work experience\n• 10 years senior management experience in a team-oriented environment functioning as Head of Finance/Chief Financial Officer.\n• Strong analytical and problem-solving skills.\n• Excellent presentation and reporting skills.\n• Ability to communicate in a clear and confident manner.\n \nKey Performance Areas\n• Develop and ensure the implementation of the financial strategy of the Nkomazi SEZ.\n• Develop and implement financial management systems.\n• Oversee the finance function by ensuring legislative compliance and ensure accurate and qualitative financial reporting.\n• Safe-guard the assets of the company by ensuring adequate policies are in place to manage risks related to the potential loss of assets.\n• Secure funding from stakeholders (the dti, Provincial Treasury) based on business requirements.\n• Oversee the Supply Chain Management (SCM) function of the company to ensure compliance to policies, procedures and the SCM Legislative Framework (PPPFA).\n• Oversee the preparation of financial statements in accordance with applicable accounting frameworks (GRAP/IFRS)\n• Ensure compliance to PFMA and other applicable legislation e.g. SEZ Act, Companies Act and Treasury Regulations.\n• Ensure that all issues of governance are adhered to, including but limited to obtaining clean audit report always.\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Quality orientation;\n• Building trust;\n• Problem solving;\n• Client and customer service orientation;\n• Resilient contributor;\n• Ethical behavior.\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n \n \nEXECUTIVE MANAGER: TRADE AND INVESTMENT \nReference code NKOSEZ 2024/03\nType of employment 5 YEAR CONTRACT\n \nPurpose\nTo market Nkomazi SEZ as a trade and investment opportunity to local and international investors to achieve set financial target.\n \nRequired minimum qualification\n• Honours degree in Economics or related/Finance or International Trade with a postgraduate qualification in Trade and Investment.\n• MBA degree, Masters in Economics or related will be an added advantage. \n \nSALARY Market Related\n \nRequired minimum work experience\n• 10 years as a manager in Trade and Investment / Foreign & Direct Investments or related field.\n• 5 years of this must have been as a Specialist in Trade and Investment.\n• Proven track record in managing a similar-type organization.\n \nKey Performance Areas\n• Provide strategic leadership to the Trade and Investment Promotion department.\n• Develop a business plan and compelling value proposition to attract local and foreign trade partners.\n• Provide direction to Nkomazi SEZ and the Board on local and international trade and investment markets.\n• Establish standards for trade and investment opportunities to be pursued;\n• Implement governance measures to ensure trade and investment division operates in an ethical manner.\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Networking skills;\n• Presentation (verbal and written);\n• Global awareness;\n• Persuasiveness/selling skills;\n• Ethical behaviour.\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n \n \n \n \nEXECUTIVE MANAGER: CORPORATE SERVICES \nReference code NKOSEZ 2024/04\nType of employment 5 YEAR CONTRACT\n \nPurpose\nTo provide strategic leadership to the Corporate Services of Nkomazi SEZ which include all aspects of HRM, Information Technology, Communications and Marketing and administrative functions to ensure organisational effectiveness.\n \nRequired minimum qualification\n• Business Management Degree / Bachelor’s Degree in HRM/ ICT/Communications & Industrial Psychology or related field.\n• Related post-graduate degree, an MBA will be an added advantage \n \nSALARY Market Related\n \nRequired minimum work experience\n• 10 years in Corporate Services management or related field;\n• 3 Years in Senior Management role in Human Capital Management, Information Communications Management.\n \nKey Performance Areas\n• Provide strategic leadership to the Corporate Services division;\n• Implement measures to control business risks associated with physical security, real estate matters and other risk areas concerning the business;\n• Manage the department’s financial budget;\n• Capacitate administrative staff to guarantee smooth business operations and the provision of accurate and timely information;\n• Build sound functional relationships with key stakeholders’ (e.g. government, suppliers, and local communities) to ensure that the Corporate Services objectives are attained;\n• Create a service-oriented culture within the department\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Customer Service Orientation;\n• Verbal and written communication;\n• Resilient Contributor;\n• Problem-solving.\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n ",
                " \n \n \n \n \nEXECUTIVE MANAGER: INFRASTRUCTURE DEVELOPMENT\nReference code NKOSEZ 2024/05\nType of employment 5 YEAR CONTRACT\n \nPurpose\nTo provide strategic leadership to assist the Nkomazi SEZ to peruse its main activity of infrastructure development by ensuring electrical, water and waste treatment infrastructure, fencing and waste to energy projects as well as the required assistance to potential investors in top structure development to suit their specific needs. Engineering and project management functions to ensure effectiveness in the infrastructure delivery program.\n \nRequired minimum qualification\n• BSC Engineering or Bachelor’s Degree in Built Environment or related field and a post-graduate degree will be an added advantage. \n \nSALARY Market Related\n \nRequired minimum work experience\n• 8 years in Engineering/Built Environment Management or related field and 3 years have been occupying a Senior Manager role in Engineering or Project Management.\n• Proven track record in managing of complex infrastructure development projects.\n• Managing multiple engineering and project management functions and complex projects.\n• Governance and risk control in an engineering and built environment.\n \nKey Performance Areas\n• Provide strategic leadership to the infrastructure development division.\n• Excellent knowledge and understanding of all Engineering and Project Management related legislation and compliance requirements as well as acts and guidelines requirements for the implementation of major civil works- infrastructure development.\n• Understanding of Nkomazi SEZ strategy and business models and extensive knowledge of the built environment governance policies and procedures.\n• Knowledge of the Public Finance Management Act (PFMA) and Treasury regulations as well as advanced knowledge and understanding of Engineering systems and practices.\n• Good knowledge and understanding of Nkomazi SEZ infrastructure demands and opportunities, systems and processes and Risk Management\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Technical and Professional Knowledge\n• Quality orientation\n• Financial management\n• Project implementation and problem solving\n• Presentation (verbal and written)\n• Ethical behavior.\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n \n \nSENIOR MANAGER: LEGAL SPECIALIST \nReference code NKOSEZ 2024/06\nType of employment 5 YEAR CONTRACT\n \nPurpose\nTo provide legal services to the Nkomazi SEZ by providing legal support on commercial transactions, litigation, conveyancing, corporate governance and supply chain management as well as labour matter to ensure the Entity adheres to prescribed legal prescripts.\n \nRequired minimum qualification\n• LLB Degree or related postgraduate qualification.\n• Must be an admitted attorney or member of the bar of advocates.\n• A LLM Degree will be an added advantage. \n \nSALARY Market-Related\n \nRequired minimum work experience\n• 6-8 years in a Corporate or Commercial Law firm and practicing as a lawyer in these fields of which 5 years must have been in legal services as a Specialist or Manager of the legal services division.\n• Proven track record in managing legal requirement in a similar-type organization.\n \nKey Performance Areas\n• Provide strategic leadership to the Legal Services Division.\n• Develop legal prescripts for the operations of the Nkomazi SEZ.\n• Provide direction to Nkomazi SEZ and the Board on legal requirements pertaining to the operations and activities of the Nkomazi SEZ.\n• Establish legal standards for operations to be pursued and implement legal governance measures to ensure the SEZ Entity operates in an ethical and legally sound manner.\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Problem solving;\n• Presentation (verbal and written);\n• Global awareness;\n• Customer service orientation;\n• Ethical behavior.\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n \n \nCIVIL ENGINEER \nReference code NKOSEZ2024/03\nType of employment 5 YEAR CONTRACT\n \nPurpose\nImplement, monitor and reports on all civil engineering aspects of various projects. Make recommendations regarding material, vendor and sub-contractor selection. Approves and maintains quality control of civil engineering drawings and prepares man-hour estimates and project schedules.\n \nRequired minimum qualification\n• BSC Civil Engineering Degree or related postgraduate qualification.\n• Must be a certified engineer.\n• A postgraduate qualification will be an added advantage. \n \nSALARY Market-Related\n \nRequired minimum work experience\n• 4-6 years in an Engineering environment and practicing as an engineer in a civil engineering environment.\n• Proven track record in managing engineering requirement in a similar-type organization.\n \nKey Performance Areas\n• Knowledge and understanding of property development industry and applicable legislation, codes, standards and regulations Knowledge and understanding of project and programme management especially within the built environment Understanding of the technical requirements relating to building design.\n• Establish engineering standards for infrastructure operations to be pursued and implement engineering measures to ensure the SEZ Entity operates in an environment of engineering excellence.\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• System agility;\n• Customer services provider;\n• Programme and project management;\n• Problem solving;\n• Presentation (verbal and written);\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n ",
                "PROJECT MANAGER \nReference code NKOSEZ2024/08\nType of employment 5 YEAR CONTRACT\n \nPurpose\nTo ensure that projects are completed within the time and cost limit as well as to the agreed specifications. Also responsible for determining location of site as well as site build and completion. This role coordinates the work done by technicians, supervisors and project administration ensuring that the detailed engineering layout is delivered in an economically fashion. The role is the key contact with clients and is the first level of escalation.\n \nRequired minimum qualification\n• A Project Management qualification supported by a related qualification that focuses on the Engineering or Built Environment. \n \nSALARY Market Related\n \nRequired minimum work experience\n• 6-8 years in a project management environment of which 2-3 years must have been as a Project Manager for a civil engineering project.\n• A proven track record in project managing complex infrastructure projects in a similar-type organization will be an added advantage.\n \nKey Performance Areas\n• Provide project administrative support by developing and analyzing tender documentation.\n• Ensure consultants and contractors remain within the project scope and cost as prescribed by the Bill of Quantities for each project.\n• Monitor project implementation progress, conduct site visits and have regular technical meetings with various project players.\n• Update Executive management on project implementation progress and advice on best practice project implementation methods and standards.\n• Establish project management systems and standards for infrastructure operations to be pursued and implemented to ensure the SEZ Entity operates in an ethical and legally sound manner while executing infrastructure projects.\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Problem solving;\n• Project reporting\n• Presentation (verbal and written);\n• Project lead and coordination;\n• Customer service orientation;\n• Ethical behavior.\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n \n \nICT SPECIALIST \nReference code NKOSEZ2024/09\nType of employment 5 YEAR CONTRACT\n \nPurpose\nTo provide a secure platform for the Nkomazi SEZ’s business operations and management of the ICT network, infrastructure and systems whilst ensuring that the associated systems preform accordingly. Also provide the required technical leadership in the development of the medium and long term strategic objectives and management of Nkomazi SEZ‘s IT infrastructure and systems\n \nRequired minimum qualification\n• A B.SC degree in Computer Science / Information Technology / B Tech in Information Technology or related qualification is the minimum required qualification.\n• While a honours degree in Computer Science or Information Technology or related field will be an added advantage \n \nSALARY Market-Related\n \nRequired minimum work experience\n• 4-6 years as a manager in Information Communication Technology environment of which\n• 5 years must have been in ICT programming, systems infrastructure, ICT configuration and or, data management.\n• A proven track record in managing complex ICT projects in a similar-type organization will be an added advantage.\n \nKey Performance Areas\n• Overseeing Nkomazi SEZ‘s ICT infrastructure design, and implementation.\n•Collaborating with Nkomazi SEZ‘s executive management and other relevant stakeholders to ensure IT systems are aligned with Nkomazi SEZ‘s business requirements and translating Nkomazi SEZ‘s business requirements from different divisions into specific IT solutions.\n• Develop and manage IT Security strategy and address business continuity and assess and provide Nkomazi SEZ‘s specific IT needs for the design, development and management of the recovery back-up of data and for protection against any security threat issues.\n• Evaluate and mitigate the risks to the Nkomazi SEZ business that can be caused by security threats to information and IT systems; and implement compliance of information security systems, standards, process and methods; namely Systems for access control, beam doors, cameras, provincial key points, etc.\n• Provide specialized Network Management advisory services to ensure accurate service level management and ensure the implementation of approved Network Management System policies, procedures and standards;\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Problem solving;\n• Project reporting;\n• Presentation (verbal and written);\n• Project lead and coordination;\n• Customer service orientation;\n• Ethical behavior;\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.\n \n \n \n \n \nEXECUTIVE MANAGER: BUSINESS DEVELOPMENT AND AGRO-PROCESSING \nReference code NKOSEZ2024/10\nType of employment 5 YEAR CONTRACT\n \nPurpose\nThe Business Development and Agro-Processing Specialist position, as part of a team of technical consultants working in collaboration with technical partners and government, will develop a series of policy papers to identify short, medium and longer-term strategies for the sector, as well as the development of market-driven action plans for Agro-processing, including key linkages to food safety, value addition, infrastructure investment and export market development pertaining to the development and diversification of the Nkomazi SEZ\n \nRequired minimum qualification\n• A Bachelor’s degree in Agricultural Economics / Marketing or Business Management or related qualification is the minimum required qualification\n• while a Masters degree in Agricultural Economics / marketing or Business Management will be an added advantage \n \nSALARY Market Related\n \nRequired minimum work experience\n• 6 – 8 years’ experience in farm management and economic analysis with extensive experience in small to medium-scale agro-enterprise management.\n• Extensive practical experience in the domestic agro-processing industry.\n• Experience with externally funded development programs would be desirable, preferably with experience in market-oriented projects.\n \nKey Performance Areas\n• Document and map ongoing work in the Agro-processing sector both nationally and regionally, highlighting partnership opportunities for short, medium and longer-term, conducting targeted interviews with key government and private sector partners for validation.\n• Review government and private sector investments in agro-processing to determine lessons learned and areas where the Nkomazi SEZ can build upon.\n• Work closely with specialists in Climate Smart Agriculture, Food Safety, Resilience, Food Systems Development, Agri-Business, Food and Nutrition Security, and others to ensure implementation of inter -sectoral linkages and requirements.\n• Develop Agro-processing components of larger programme proposals and strategies and develop concepts and proposals for the implementation of SMME projects within the various agro-processing value chains.\n• Explore opportunities for partnerships with international agro-business and investments.\n• Review the agro-inputs market to identify market gaps in technology and investment, indicating strategies to fill gaps in availability of, and quality of, agricultural inputs and technology – highlighting options for technical innovations including Return on Investment and Value For Money for various subsectors, i.e. like sugarcane, dairy, livestock; horticulture and Infrastructure investments to promote the Nkomazi SEZ.\n• Identify key specialist in the country and other regions for further potential collaboration on agro-processing for export.\n \nCompetencies Required\nThe preferable candidate should display the following competencies at an advanced level:\n• Problem solving;\n• Project reporting;\n• Presentation (verbal and written);\n• Project lead and coordination;\n• Customer service orientation;\n• Ethical behavior;\n \nExpectations\nThe successful candidate will:\n• Enter into an Employment and Performance Contract for 5 years.\n• Be subjected to vetting and screening and he/she will be subjected to a Competency assessment\n• Further be subjected to vetting and screening.",
                "SUBMISSION OF APPLICATIONS:\nInterested candidates should submit an application stating reference number, a detailed CV, and copies of qualifications and identity document to Human Capital Management e-mail address: recruits@mega.gov.za or hand-deliver to Human Capital Management, MEGA Office Park, 02 Eastern Boulevard, Riverside Mbombela.\n \nREMUNERATION\nNkomazi SEZ offers competitive remuneration and benefits package that may be negotiable based on qualification, experience and evidence of current remuneration package of the successful candidate\n \nEnquiries: Mr. Mthokozisi Manzini, 013 492 5818, or Elsie Ramodike\n \nClosing date for applications: 23 August 2024 @ 16h00.\nNo late application will be considered\n \nEquity Statement: Preference will be given to suitably qualified applicants that will assist the SEZ to be representative of the demographics of the province. Applicants who have not been contacted within 60 days of the closing date may assume that their applications have been unsuccessful."
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "pf7b79d41-8093-4005-b826-b03cbc676651"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/tikzn_orig.jpg",
            "href": "https://www.govpage.co.za/trade-and-investment-kwazulu-natal-tikzn-vacancies-blog/trade-investment-kwazulu-natal-tikzn-vacancies8533691",
            "title": "TRADE & INVESTMENT KWAZULU-NATAL (TIKZN) VACANCIES",
            "content": [
                " \nTRADE & INVESTMENT KWAZULU-NATAL (TIKZN)\n ",
                " \n \nINTERNAL/EXTERNAL VACANCY ADVERTISEMENT\n \nBusiness Unit: Strategy and Operations\nPERFORMANCE MONITORING AND EVALUATION OFFICER\nReference: TIKZN/09/2024\nReporting to: Executive Manager: Strategy and Operations\nJob Grade: C3\nDuration: Permanent\n \nBrief Outline of Duties: \nThe PM&E specialist will be responsible for implementing and maintaining the performance activities for the organisation, assisting the Strategy and Operations Executive in preparing annual and quarterly reports on the organisation’s performance progress. The specialist is also responsible for working with the organisation’s business units in the collection and verification (through the internal audit process) the performance data and supporting documentation provided by the business unit to ensure its accuracy and validity. \n \nKEY PERFORMANCE AREAS (Among others) \n1. Assist in the development of the performance systems and tools for the organization. \n2. Assist in the management of the Annual performance process including the compiling of APP, AOP and any other related documentation. \n3. Implementation and Monitoring of performance management processes \n4. Performance Data Management \n5. Impact Measurement \n6. Drive Continuous Improvement \n \nJOB SPECIFICATION \nEducational and /or Technical Competencies: \nA bachelor’s degree in business management and/or Administration. \n \nExperience:\nMust have 4 - 5 years’ experience in managing organisational performance strategy and operational plans. \n \nPROFESSIONAL COMPETENCIES \nKnowledge of government-wide programme on planning, monitoring and evaluation. \nBasic knowledge of Provincial growth and development strategy and plan. \nKnowledge of the National Development plan. \nKnowledge of the PFMA. \nGood understanding organisational performance management. \nProficiency in monitoring and evaluation methodologies, data analysis tools, and statistical software. \nStrong analytical skills and attention to detail for interpreting complex data sets. \nExcellent communication and interpersonal skills for engaging with stakeholders and presenting evaluation results effectively. \nAbility to work independently, prioritize tasks, and meet deadlines in a fast-paced environment. \nCommitment to continuous learning and professional development in the field of monitoring and evaluation. \n \n \nClosing date: 16 August 2024 @ 00h00. \n \nTo apply for this position, kindly submit your motivation letter, curriculum vitae and copies of educational qualification. Application for the position can be emailed to vacancies@tikzn.co.za.\n \nTIKZN subscribes to the principles of employment equity in its recruitment processes. People with disability are encouraged to apply for this position. Prospective employees will be subjected to competency assessments and background checks as part of the selection process. \n \nNB: Applicants who have not received any correspondence from us within three (3) months of the closing date can consider their applications unsuccessful. \n \n(PLEASE QUOTE THE POSITION NAME AND REFERENCE NUMBER ON YOUR APPLICATION SUBJECT LINE)\n \n \n \n \n ",
                "INTERNAL/EXTERNAL VACANCY ADVERTISEMENT\n \nBusiness Unit: Knowledge Management\nINFORMATION TECHNOLOGY (IT) SPECIALIST\nReference: TIKZN/08/2024\nReporting to: Executive Manager: Knowledge Management\nJob Grade: C4\nDuration: Permanent\n \nBrief Outline of Duties: \nTo manage and maintain secure and efficient IT systems that support business processes, thereby assisting the organisation to achieve its overall strategic business objectives. \n \nKEY PERFORMANCE AREAS (Among others) \nDevelop and manage IT plans, policies, and procedures. \nManage IT related systems. \nImplement information security and disaster recovery procedures. \nImplement and monitor cybersecurity measures in the organization. \nTechnical Support and fault resolution. \nICT Asset control administration. \n \nJOB SPECIFICATION \nEducational and /or Technical Competencies: \nA bachelor’s degree in Information Technology or relevant IT qualification \n \nExperience:\n3 years’ experience in the information technology environment.\n \nPROFESSIONAL COMPETENCIES \nGood understanding of systems and networking. \nKnowledge of Protection of Personal Information Act. \nKnowledge of cybersecurity. \nGood understanding of ICT policies and legislation. \nAbility to support and guide staff. \nGood communication skills. \nAbility to work in a diverse environment and resolve conflicts. \n \n \nClosing date: 16 August 2024 @ 00h00. \n \nTo apply for this position, kindly submit your motivation letter, curriculum vitae and copies of educational qualification. Application for the position can be emailed to vacancies@tikzn.co.za.\n \nTIKZN subscribes to the principles of employment equity in its recruitment processes. People with disability are encouraged to apply for these positions. Prospective employees will be subjected to competency assessments and security vetting as part of the selection process. \nNB: Applicants who have not received any correspondence from us within three (3) months of the closing date can consider their applications unsuccessful. \n \n(PLEASE QUOTE THE POSITION NAME AND REFERENCE NUMBER ON YOUR APPLICATION SUBJECT LINE)",
                "INTERNAL / EXTERNAL ADVERT\n \nBusiness Unit: Corporate Services\nRECEPTIONIST\nReference: TIKZN/10/2024\nReporting to: General Manager: Marketing & Communications\nJob Grade: B2\nDuration: Permanent\n \nBrief Outline of Duties: \nTo ensure professional management and running of the TIKZN reception area, which includes the operation of the switchboard as well as office administration activities as and when necessary. \n \nKEY PERFORMANCE AREAS (Among others) \nFront office management. \nService provider liaison. \nOffice administration. \nBoardroom booking management.\n \nJOB SPECIFICATION \nEducational and /or Technical Competencies: \nNational Senior Certificate / Matric. \n \nExperience:\nA minimum of two (2) years’ reception or customer service experience and experience on operating a switchboard is essential. \n \nPROFESSIONAL COMPETENCIES \nBusiness language proficiency. \nGeneral office practices. \nProfessionalism\n \nPERSONAL ATTRIBUTES \nOrganisational and Planning Skills. \nGood verbal and written communication skills. \nComputer Literate at an intermediate level. \nProfessional manner. \nGood interpersonal skills. \nGood Telephonic Etiquette. \n \nCLOSING DATE: 16 August 2024 @ 00h00 \n \nTo apply for this position, kindly submit your motivation letter, curriculum vitae and copies of educational qualification. Application for the position can be emailed to vacancies@tikzn.co.za\n \nEquity Statement \nTIKZN is committed to Employment Equity when recruiting internally and externally and will ensure our recruitment process is in line with achieving our Employment Equity goals. People with Disabilities are encouraged to apply. Prospective employees will be subjected to competency assessments and background checks as part of the selection process. \n \nNB: Applicants who have not received any correspondence from us within three (3) months of the closing date can consider their applications unsuccessful. \n \n(PLEASE QUOTE THE POSITION NAME AND REFERENCE NUMBER ON YOUR APPLICATION SUBJECT LINE)"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p9813f138-9103-4452-a72d-0ab1a8cfb5a2"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/johannesburg-water_orig.jpg",
            "href": "https://www.govpage.co.za/johannesburg-water-vacancies-blog/johannesburg-water-vacancies8307651",
            "title": "JOHANNESBURG WATER VACANCIES",
            "content": [
                " \nJOHANNESBURG WATER\n ",
                " \n \nFOREMAN SEWER \n– REF: JW390EX/2024\n \nJob Description\nREMUNERATION: R430 884 BASIC SALARY PER ANNUM \n \nPURPOSE\nManage all functions related to the maintenance of the sewer system in order to effectively manage the sewer infrastructure.\n \nKEY RESPONSIBILITIES\nSupervise operational plans to coordinate and optimise the utilisation of the area’s resources for all field work to be undertaken. Ensure that correct materials and resources are available for scheduled operations on a daily basis. Monitor and supervise the quality, standard and productivity levels for all field work by doing site inspections and job assessments. Ensure that repairs and maintenance are carried out within the accepted response times and deadlines to ensure proper service delivery to customers Coordinate all maintenance and construction work under his / her control. Investigate and implement new and more effective work methods and techniques in consultation with the Operations Manager Investigate and report on industrial effluent compliance issues. Update plans of sewer reticulation and forward to the Operational Manager for correction. Supervise the inspection of vehicles for roadworthiness and ensure that logbooks and checklists are completed and submitted. Participate in the planning and coordination of company policies and procedures relating to the sewer network. Monitor and evaluate staff performance according to the Staff Management Plan. Liaise with customers, members of public and councillors on sewer related issues. Supervise activities to ensure that it is within the budget provision. Conduct regular site inspections to ensure compliance to the safety procedures.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• Grade 12 or N3 (NQF4) + Plumbing trade test certificate/Appropriate Learnership NQF 4\n• 4 years’ experience in operation and maintenance of sewer reticulation of which 1 year must be at a supervisory level.\n• Driver’s License Code EB\n\nPlease forward your CV and qualifications to: E-mail: Jw.foremansewer390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence.\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n ",
                " \n \n \n \n \nREGIONAL MAINTENANCE MANAGER \n– REF: JW390EX/2024\n \nJob Description\nREMUNERATION: R1 291 344 TOTAL COST TO COMPANY PER ANNUM \n \nPURPOSE\nManage the operations on repairs and maintenance to all mechanical and electrical equipment and instrumentation located at Johannesburg Water’s Treatment Works in accordance to General Machinery Regulations section 2.1 and 2.7 (OHASA) and SANS codes of practice.\nManagement of the central Minor Plant/Yellow Machines Workshop\n \nKEY RESPONSIBILITIES\nResponsible for the participative development of strategy for the various Treatment Works in conjunction with the Divisional Manager: Bulk wastewater, for technically and environmentally sound operations. Participate in the development of overall strategy for the Bulk Wastewater division in the context of the policy framework set by Johannesburg Water. Assist the Divisional Manager: Bulk wastewater, to define in consultation with the Capital Investment Department (CAPEX), the required infrastructure development and rehabilitation programmes of JW facilities in accordance to CAPEX programmes. Manage and ensure that all electrical and mechanical equipment located at Treatment Works are maintained in a good state and standby equipment is functional at all times to ensure the provision of continuous sanitation services in compliance with statutory requirements and other agreements. Ensure the general facilities maintenance to buildings and grounds in order to improve and maintain the aesthetics of the sites. Implement and maintain preventative measures to contain and minimize overflows originating from Containment Dams in order to comply with Permit conditions as set by the Department of Water Affairs. Ensure that the minor plant/yellow machines equipment is kept in a good state of operation in order to achieve availability to end users. Manage the relevant SAP asset database inputs so that all maintenance interventions/repairs are accurately compiled and recorded\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• National Diploma or National Diploma in Mechanical or Electrical Engineering and Government Certificate of Competence (GCC) Factories.\n• 5 years appropriate experience of which 2 years must be managerial level\n• Computer literate\n• Drivers Licence Code EB\n \nPlease forward your CV and qualifications to: E-mail: Jw.regionalmaintenance390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n ",
                " \n \n \n \n \nMANAGER: WATER LABORATORY \n– REF: JW390/2024\n \nJob Description\nREMUNERATION: R919 224 TOTAL COST TO COMPANY PER ANNUM\n\n\nPURPOSE\nTo provide a cost effective analytical and scientific advisory service to all Johannesburg Water Departments, approved outside organisations and to manage the development of relevant methodology as new analyses are required.\n \nKEY RESPONSIBILITIES\nPlan activities in the laboratory including the development of analytical methods and the procurement of equipment to enhance productivity and to improve the quality of results. Plan staff development using company PDP and training schedule for interns, plan future direction of the Lab based on customer need and analytical developments. Utilise each staff member in such a way that his/her capabilities are developed. Ensure that staffs are adequately trained and motivated to carry out assigned tasks. Manage the performance management system, Coordinate, and manage the daily laboratory activities. Manage QA system in all laboratory areas, including SOP reviews and development. Ensure that all relevant data is processed in such a way that the data is readily accessible when required, utilising the necessary computer equipment. Daily, provide analytical service to City of Johannesburg’s Environmental Quality Management Department by analyzing and reporting on surface water quality. Coordinate the implementation of corrective actions for all the non-conformances identified during internal and external audits. Liaise with the Innovation and Technology Department regarding new developments in the Water Industry. Comply with company procurement policy and financial regulations. Draw up technical specifications for tender purposes when required, make recommendations on new chemicals and or equipment. Liaise with external bodies such as the SABS, CSIR and tertiary education institutions on analytical techniques and methodologies and inter-laboratory calibration exercises. Provide advice to other Departments and Communities in cases where specialist knowledge is required. Keep abreast of legislative requirements pertaining to product quality such as Wastewater and reticulated water legislation, standards such as SANS 241 and Acts such as SACNASP, the Water Act and the Accreditation Act.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• Bachelor of Science in Chemistry /Applied Chemistry or BTech Analytical Chemistry (NQF 7).\n• 6 years of experience in a chemical laboratory where water or environmental analysis are done with at least one (1) year of analytical work supervision/ overseeing/ coaching experience. Working knowledge of ISO 17025.\n• Code B drivers’ licence.\n• Be eligible to become a Technical Signatory within 24 months.\n \n\nPlease forward your CV and qualifications to: E-mail: Jw.managerwaterlab390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n ",
                " \n \n \n \n \nOPERATIONAL MANAGER: PLANNING \n– REF: JW390EX/2024\n \nJob Description\nREMUNERATION: R500 076 BASIC SALARY PER ANNUM \n \nPURPOSE\nPlanning and scheduling the repairs and maintenance to mechanical and electrical plant, instrumentation, yellow machines, and minor plant equipment located at Johannesburg Water’s Treatment Works in accordance to OHASA and SANS code of practice. Management of the centralized Wastewater Treatment works Stores.\n \nKEY RESPONSIBILITIES\nTo all plant/equipment at the Treatment Works, including Minor Plant/Yellow machines in order to maintain maximum plant availability, manage and ensure that preventative maintenance plans are developed, implemented and monitored according to Best Practices and standards, Manage and monitor the use of spares, materials and equipment through the internal stores and department to ensure effective control and distribution of materials and tools, develop, implement, and maintain SOP’s for Treatment Works maintenance operations. Manage and Control staff in terms of HR Policies, identify job specific training and development needs in line with JW skills development plan, this will be done in consultation with the Regional Maintenance Manager. Transferring of skills to subordinates by mentoring and coaching, requirements in the workplace by carrying out risk assessments and on job assessments. Ensure that all new employees are informed of and trained to the requirements of OHASA, assist with the preparation of regional budget (OPEX) by monitoring and ensuring correct usage of cost centers and line items on works orders, creating purchase requisitions and ensure GRN’S (Goods Receive Note) as per procurement policies and Procedures. Liaise with service providers on an ad hoc basis to ensure that all outsourced work is completed within agreed timeframes, Liaise with internal/external auditors for audit purposes. Provide leadership and management in the Treatment Works through proactive Planning, Evaluate and priorities risks, and assess the options for accommodating the risks.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• N6 plus Trade Certificate (Electrical/Mechanic)\n• 5 years in repairs and maintenance of mechanical and electrical machinery and equipment of which 2years must be at supervisory level. Knowledge of Basic Occupational Health and Safety in the workplace.\n• Computer literate and SAP\n• Code EB driver’s licence.\n \n\nPlease forward your CV and qualifications to: E-mail: Jw.operationalmanager390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n ",
                " \n \n \n \n \nCONTROL ROOM CO-ORDINATOR \n– REF: JW390EX/2024\n \nJob Description\nREMUNERATION: R375 552 BASIC SALARY PER ANNUM \n \nPURPOSE\nSupervising and coordinating the JW Control Room Operations.\n \nKEY RESPONSIBILITIES\nManage the delivery of the control room service and ensure delivery of operational KPI’s. Liaise with the shift supervisors and confirm sites coverage. Ensure Effective management of Guard monitoring, Base radio communication alarm monitoring and CCTV system etc. Ensure occurred incidents are immediately reported and escalated to the management, JMPD and SAPS. Ensure incident report is submitted within 24 hours and keep records as per SOP. Act as a focal point for security operations decision making during routine and emergency situations. Act as a focal point for security operations decision making during routine and emergency situations. Ensure the efficient and correct system use by staff. Ensure operating systems are functioning correctly and are fit for purpose, troubleshoot and organize for corrective action, mitigating against any risk to the JW sites. Coordinate training, development, and recruitment of control room staff. Conduct and monitor control room staff appraisals and encouraging further development. Develop and implement the control room operations manual that supports all JW security related operations, reviewing when required. Deputize for Security Operations Manager when required.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• Grade 12\n• Certificate (NQF 4) in Security Management/Policing\n• Drivers Licence Code 08 (B)\n• PSIRA Grade B.\n• 5 years’ experience in Security Management of which 3 years must be in Control Room supervision\n \nPlease forward your CV and qualifications to: E-mail: Jw.controlroom390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence.\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n ",
                " \n \n \n \n \nMANAGER: FIXED ASSETS \n– REF: JW390EX/2024\n \nJob Description\n \nREMUNERATION: R919 224 TOTAL COST TO COMPANY PER ANNUM PURPOSE\nTo enable an entity to meet its service delivery objectives efficiently and effectively. It involves guiding the acquisition, use and disposal of assets, and managing the related risks and costs over all phases of the asset life cycle. Ensure orderly accounting and GRAP compliant reporting of fixed assets.\n \nKEY RESPONSIBILITIES\nManage departmental resources. Responsible in maintaining JW Fixed Asset Policy Management of the Fixed Asset register for accuracy and reliability taking ownership of the register module of the JW’s accounting system and adhering to all related processes and accounting procedures. Ensure GRAP compliant accounting standards. To ensure that the fixed assets register is managed and verified electronically, tracking the movement of assets and liaising with both internal and external auditors. Reconcile the fixed asset register to the General Ledger (GL) and to the Annual Financial Statement (AFS). Ensure verification of all assets owned by the JW with the fixed asset register. Provide input into the preparation of PPE (Property, Plant and Equipment) and note in the financial statement. Preparation of lead schedules and working papers for the AFS. Support auditors by preparing for audits of the Fixed Asset unit. Perform year-end closing processes. Initiate process improvements for the efficiency and productivity of fixed asset management. Engage with the JW Finance team and with other departments within the JW to ensure an understanding of their needs pertaining to fixed asset accounting transactions and reports.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• BCom Degree (NQF 7) in Accounting\n• 5 years’ experience in fixed assets.\n• Valid Drivers License\n \n\nPlease forward your CV and qualifications to: E-mail: Jw.managerfixed390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n \n ",
                " \n \n \n \n \nPROJECT MANAGER\n – REF: JW390EX/2024\n \nJob Description\nREMUNERATION: R1 020 324 TOTAL COST TO COMPANY PER ANNUM \n \nPURPOSE\nResponsible for project management and contract administration of projects within the capital programme, actively driving the technical, administration, contractual and financial framework.\n \nKEY RESPONSIBILITIES\nMonitor contractors and consultants in terms of the contract document, General Conditions of Contract (GCC), specifications and other legislative requirements. Check progress, approve and process payment certificates submitted by contractors and consultants. Conduct site visits to check if work is undertaken according to plans. Compile project plans on MS Projects and track progress. Review Preliminary and Detailed Design Reports in conjunction with Johannesburg Water stakeholders. Evaluate if the Bill of Quantity supplied by consultants is in line with the project scope and is reasonable and market related. Indicate proposed new services on GIS. Procure resources such as contractors, consultants, and equipment in accordance with the Company’s procurement policies and procedures and CIDB legislation. Prepare and present Bid Committee reports and conduct tender briefing sessions in conjunction with Supply Chain Management Unit. Formulate project cost plans and cash flow plans before the start of the project. Monitor expenditure versus budget and report potential over- and under expenditure to the Investment Manager. Ensure that contractors adhere to quality plans as well as the GCC and SA National Standards (SANS 1200). Monitor the quality of the activities on projects, consultants, contractors, and all stakeholders throughout the duration of a project. Ensure overall compliance with Occupational Health and Safety and Environmental Management. Identify and quantify project risks. Develop and implement mitigation plans. Check close-out report compiled by the consultant to ensure that all the elements of the project have been recorded. Brief Ward Councilors, together with the Communications Department on the project. Manage all human resource activities related to this position.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• BTech/ BSc degree In Civil Engineering (NQF 7)\n• 5 years’ experience in civil engineering (water and sewerage/sanitation) of which 2 must be in project management.\n• Valid driver’s license (Code B)\n\n\nPlease forward your CV and qualifications to: E-mail: Jw.projectmanager390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence.\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n ",
                " \n \n \n \n \nMANAGER: OCCUPATIONAL HEALTH & SAFETY AND DISASTER MANAGEMENT\n– REF: JW390EX/2024\n \nJob Description\n \nREMUNERATION: R1 291 344 TOTAL COST TO COMPANY PER ANNUM \n \nPURPOSE\nAdvise Executive Director, Senior Managers, Line Management and HR Practitioners. Liaise with Department of Labour, Health & Safety Organisations, Legal Representatives, Safety equipment and training suppliers. Lead and direct the functions of Occupational Health and Safety and Compensation for Occupational Injuries and Diseases (COID) in Johannesburg Water strategically and operationally in order to promote and ensure the health and well-being of all employees and ensure legal compliance.\n \nKEY RESPONSIBILITIES\nDevelop and present the OH&S and Disaster Management’s annual budget and operations plan for incorporation into the OH&S and Disaster Management’s budget. Ensure that staff have the capability to effectively provide and deliver services according to identified needs and the planned programmes. Plan and direct employee development, performance management processes and programmes. Ensure that the core values of Johannesburg Water are upheld. Develop and ensure the implementation of policies and procedures relating to occupational health and safety throughout JW. Develop and implement control systems and processes necessary for the OH&S and Disaster Management’s success. Control expenditure by ensuring spending is appropriate and necessary for achievement of objectives. Manage all other resources of the OH&S and Disaster Management in a responsible and cost-effective manner. Act on behalf of the Executive Director in terms of Section 16(2) of the Occupational Health and Safety Act, to ensure that the duties of the employer are properly maintained. Ensure compliance with procedures in terms of the Compliance for Occupational Injuries and Diseases Act (COID). Lead and direct strategies relating to risk analysis of all workplaces within Johannesburg Water. Prioritise the identification of potentially dangerous activities and processes and recommend corrective measures. Conduct needs analysis to determine specific training needs as well as requirements in terms of legislation. Monitor the accomplishment of established objectives in terms of Health and Safety. Develop specific disaster management plans in liaison with line management for specific high-risk areas, head office and Diepsloot Pipe Bridge. Conduct investigations to assess the environmental and public health impact of incidents, depending on severity of case.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• B Tech/ Degree (NQF 7) (Safety, Risk, Environment Management/Health, Science, Engineering)\n• 5 years working experience in safety and health or environment or risk quality systems development, planning and implementation of which 3 years must be at management level.\n• Valid Driver’s License.\n \nPlease forward your CV and qualifications to: E-mail: Jw.managerohsdm390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence\n \nClosing date: 22 August 2024\n \nPost expires at 4:00pm on August Thursday 22nd, 2024\n \n \n \n \n \n ",
                "SENIOR MANAGER: INFRASTRUCTURE PLANNING & ASSET MANAGEMENT\n– REF: JW390EX/2024\n \nJob Description\n \nREMUNERATION: R1 485 025 TOTAL COST TO COMPANY PER ANNUM \n \nPURPOSE\nTo manage the compilation of the annual capital budgets and longer term capital plans for the whole of Johannesburg Water as well as all planning related to the water and sanitation infrastructure including reticulation, reservoirs, pump stations and wastewater treatment works. The management and coordination of activities and practices for infrastructure asset management throughout Johannesburg Water.\n \nKEY RESPONSIBILITIES\nDevelop and review long term operational plans for division of the whole department. Evaluate and prioritise risks and assess the options for accommodating the risks. Develop departmental management plans and authorise implementation of the plans. Develop systems and procedure for the management and control of the departmental performance and deliverables. Ensure that systems meet requirements of all applicable legislation. Control departmental expenditure by ensuring spending is appropriate and necessary for achievement of objectives. Attend to brief JWater policies and performance progress. Participate in Committees to facilitate the review and implementation of long-term projects. Liaise with DWAE, Province, Rand Water, Water Research Commission, CoJ, Planning, CoJ Housing, adjacent municipalities, members of the public. Ensure that adequate monitoring, forecasting and demand management investigations are carried out on an ongoing basis to allow for timeous augmentation of the water and sanitation infrastructure. Manage the preparation of the annual capital budget and longer-term financial plans for Johannesburg Water. Ensure projects are appropriately prioritised and motivated for in time for inclusion in the following year’s capital budget. Manage the preparation and maintenance of the Water Services Development Plan (WSDP). Ensure compliance with the employment equity, skills development planning, succession planning and performance appraisal initiatives. Oversee the alignment of asset management practices to Local Government, National Treasury and Internal guidelines and best practice. Approval of engineering scheme reports and construction drawings. Manage the development and access to GIS applications.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• B-Tech / BSc. Civil Engineering (NQF 7)\n• Registered for Pr.Eng or Pr. Tech\n• 15 years post qualificatons experience in Civil Engineering of which 5 years at a Senior Management level in the Local Government environment\n• Experience in developing, implementing policies and procedures, strategy development, business planning, trouble shooting and problem solving\n• Excellent knowledge of planning environment and leadership\n• Must be analytical and strategic thinker with sound judgement and business acumen\n• Service orientated, innovative, assertive and decisive\n• Drivers’ Licence Code B\n \nPlease forward your CV and qualifications to: E-mail: Jw.seniormanager390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence\n \nClosing date: 22 August 2024\n \nPost expires at 4:00pm on August Thursday 22nd, 2024",
                "METER READER X7 \n– REF: JW390EX/2024\n \nJob Description\nREMUNERATION: R210 216 BASIC SALARY PER ANNUM \n \nPURPOSE:\nEnsure that all meters are read accurately and consistently with a high level of integrity.\n \nKEY RESPONSIBILITIES:\nConfirm plotting of walling routes, GIS maps and data o electronic devices as well as manually spread sheets daily. Give input to Senior Meter Reader related to route anomalies found on site or requirement for re-ordering. Accurately locate the relevant water meter using address, GIS and meter number to verify its validity. Identify new meter and/or change meters and record the data accordingly. Ensure the submission of manually recorded data. Perform revisits on no access codes previously obtained, daily per route issued. Perform data cleansing activities as and when required including but not limited to unmetered properties, unbilled properties, meter master data and initial property usage data on questioner. Advise customers on measures that would help reduce water wastage or high bills due to unseen leaks e.g. (how to detect a leak). Log the following customer service issue on route, using relevant coding e.g., leaking/burst water meters, leaking/burst pipes, blocked/damaged sewer pipes or external utility issues.\n \nJOB REQUIREMENTS\nEssential qualifications and experience:\n• Matric (NQF 4).\n• Must have 2 years periodic Meter Reading experience within the Municipal environment.\n• Must have sound knowledge of meter reading process.\n \n\nPlease forward your CV and qualifications to: E-mail: Jw.meterreader390@jwater.co.za quoting the relevant reference number and job title in the subject line of your correspondence.\n \nClosing date: 22 August 2024\nPost expires at 4:00pm on August Thursday 22nd, 2024"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p2f21f070-8a60-4354-b21d-e11a5bad736a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/agriseta_orig.gif",
            "href": "https://www.govpage.co.za/agricultural-sector-education-training-authority-agriseta-vacancies-blog/agricultural-sector-education-training-authority-agriseta-vacancies5923732",
            "title": "AGRICULTURAL SECTOR EDUCATION TRAINING AUTHORITY (AGRISETA) VACANCIES",
            "content": [
                " \nAGRICULTURAL SECTOR EDUCATION TRAINING AUTHORITY (AGRISETA)\n ",
                " \n \nRE-ADVERTISEMENT\n \nASSISTANT MANAGER: EASTERN AND WESTERN CAPE REGIONAL SUPPORT\nSALARY SCALE: D1 Level 6 R772 013.37 (CTC)\nRef: AgriS01/08/2024\nDesignation\nAssistant Manager: Eastern and Western Cape Regional Support\nReporting to Manager: Rural Development\nDivision Learning Programmes and Projects\nOffice Location Head Office, Pretoria\n \nJob Purpose\n• To co-ordinate all approved learning programmes, reporting, and monitoring of implementation in the relevant provinces.\n• Monitor implementation and act as first-line of assistance on issues relating to payments and document submissions.\n \nKEY PERFORMANCE AREAS\n \nKey Performance Area - Functional outputs / Actions\n \nProject Coordination\n• Supports and coordinates the skills development programmes in Eastern and Western Cape in partnership with Government Departments, commodity organisations, and communities in land reform, rural development, and agriculture.\n• Establishes, participates in relevant skills development forums in the provinces (Eastern and Western Cape) that promotes support to rural agricultural structures through mentorship programmes.\n• Coordinates applications from State Departments in provinces for approval.\n• Assess readiness of projects, through support and/or assistance from AgriSETA.\n• Oversees the generation, distribution, and receiving approval letters and contracts.\n• Monitor and implement approved mentorship projects and learning programmes in the provinces.\n• Site verification and monitoring of all AgriSETA funded learning programmes and partnership initiatives.\n• Prepare site monitoring for project managers.\n• Monitor the compliance of project implementation plan.\n• Responds to provincial enquiries with regards to skills development in the provinces.\n• Assist with facilitation of provincial strategic partnerships with public and private stakeholders.\n• Conducts weekly site visits to provide ongoing support and ensure training is being rendered.\n \nAdhoc\n• Any other duties which may be assigned from time to time.\n \nMinimum Qualification and Experience\n• Degree (NQF level 7) in Public or Business Administration, Agriculture or Community Development.\n• 5 years experience in administration and monitoring of projects.\n• Added advantage, the incumbent should have experience in project management.\n \nRequired Competencies\n• Monitoring of projects and monthly reporting.\n• Presentation skills.\n• Business writing skills.\n• Stakeholder Management.\n• Willing to work under pressure.\n• Able to travel extensively.\n \n \nEmployment Period: Permanent position (SETA License).\n \nAn updated CV with a covering letter (excluding certificates) should be forwarded to: Asm@agriseta.co.za\n \nClosing date: Tuesday, 27 August 2024 @ 16h30\n \nEnquiries: Tshepiso@agriseta.co.za\n \nNote: Please indicate your current and required salary. Communication will be restricted to the shortlisted candidates only. Should you not hear from us in 4 weeks after closing date of this advertisement, consider your application unsuccessful. This advertisement has minimum requirements listed. Management reserves the right to use additional relevant information as criteria for short-listing. AgriSETA is an equal opportunity employer and preference will be afforded to candidates in terms of Employment Equity Plan.\n \nPlease note that this is a re-advertisement, applicants who previously applied to this position are encouraged to apply, quoting the reference as per above.\n \nDisabled candidates are encouraged to apply and an indication in this regard will be appreciated.\n \n \n \n \n ",
                " \n \n \n \n \nADVERTISEMENT\n \nASSISTANT MANAGER: EXPENDITURE\nPERMANENT\nSALARY SCALE: PATERSON C5 LEVEL 6 R658 733,53 - R797 067,57\nRef: AgriS0808/2024\nDESIGNATION Assistant Manager: Expenditure\nReporting to Manager: Finance\nDivision Administration\nBusiness Unit Finance\nOffice Location Head Office (Pretoria)\n \nJOB PURPOSE\nTo assist in the management of the expenditure of AgriSETA\n \nKEY PERFORMANCE AREAS\n \nKEY PERFORMANCE AREA - FUNCTIONAL OUTPUTS / ACTIONS\n \nLiability Management\n• Reconcile creditor’s accounts\n• Pay liabilities within 30 days\n• Propose changes or updates on the creditor’s master file\n \nExpenditure\n• Recognition and payment of invoices (admin and projects)\n• Process bank statement transactions on the accounting system and maintain source documents\n• Recognition and payment of payroll transactions (e.g. interface payroll into the accounting system, etc)\n• Verification and safekeeping of source documents\n• Recognition and payment of Mandatory grants\n \nManagement of Fruitless, wasteful and irregular expenditure\n• Identify, record, and report irregular expenditure\n• Identify, record, and report fruitless and wasteful expenditure\n \nCash Management\n• Manage all prepayments\n \nReporting\n• Ensure completeness of source documents\n• Monthly reporting of accruals (admin and projects)\n• Monthly report of irregular expenditure\n \nMINIMUM QUALIFICATION & EXPERIENCE\n• Degree in Accounting/Finance (NQF Level 7)\n• Minimum of 5 years working experience within the financial environment\n• SETA Environment experience\n \nSkills Required:\n• Attentive to details\n• Ability to work with a high volume of data\n• Team player\n• Ability to supervise and transfer skills to subordinates.\n• Ability to meet deadlines and comply with applicable norms and standards\n \nCompetencies Required:\n• Strong knowledge of PFMA, PFMA Regulations, National Treasury norms and standards\n•Moderate knowledge of CaseWare or any financial reporting system\n• Computer proficiency in Microsoft Excel, Word, and PowerPoint\n \n \nEmployment Period: Permanent\n \nAn updated CV with a cover letter (excluding certificates) should be forwarded to: ASM.Expenditure@agriseta.co.za\n \nClosing date: Tuesday, 27 August 2024\n \nEnquiries: Baepi@agriseta.co.za\n \nNote: Communication will be restricted to the shortlisted candidates only. Should you not hear from us within 4 weeks after the closing date of this advertisement, consider your application unsuccessful.\n \nThis advertisement has minimum requirements listed. Management reserves the right to use additional relevant information as criteria for short-listing. AgriSETA is an equal opportunity employer and preference will be afforded to candidates in terms of the Employment Equity Plan. \n \nDisabled candidates are encouraged to apply and an indication in this regard will be appreciated.\n \n \n \n \n ",
                "ADVERTISEMENT\n \nPERMANENT\nMARKETING AND COMMUNICATION PRACTITIONER\nSALARY SCALE: C2 LEVEL 6\nR381 216.17 - R419 337.78\nRef: AgriS0807/2024\n \nDESIGNATION Marketing and Communication Practitioner\nREPORTING TO Assistant Manager: Marketing and Communication\nDIVISION Marketing and Communication\nBUSINESS UNIT Corporate Services\nOFFICE LOCATION Head office, Pretoria – Arcadia\n \nJOB PURPOSE\n• Assist with the administration of the Marketing and Communications unit.\n• Marketing and Communication support to all relevant stakeholders, internally and externally.\n \nKEY PERFORMANCE AREAS\n \nKEY PERFORMANCE AREA - FUNCTIONAL OUTPUTS / ACTIONS\n \nSTAKEHOLDER AND RELEVANT EVENTS\n• Assist in the development of the annual stakeholder calendar in conjunction with management.\n• Identify opportunities to promote AgriSETA at appropriate events. Plan and organise stakeholder and related events - EXPOs, exhibitions, and promotional campaigns.\n• Programme planning in conjunction with the relevant department(s) for the event.\n• Event Management - Undertake full planning of the event – venues, catering, speakers, etc according to checklist requirements.\n• Identifying communication platforms internally and to external Stakeholders e.g. via the media, internet, exhibitions and promotions, campaigns and EXPOs, intranet, etc.\n• Ensure that invitations are sent to the relevant stakeholders.\n• Ensure that appropriate feedback is communicated to external stakeholders.\n• Obtain event feedback and communicate to relevant internal departments.\n• Ensure necessary stationery, equipment, and printing requirements are available for events.\n• Ensure appropriate use of branding at all events.\n• Work in conjunction with the Head: Marketing and Communication / Assistant Manager for all administrative issues.\n \nADVERTISING AND PUBLICATIONS\nANNUAL REPORT\n• Internal and external newsletter contribution – newsworthy articles.\n• Liaise with internal departments for monthly submissions of newsworthy articles.\n• Compilation of content for newsletters, advertisements, etc.\n• Coordinate the design and printing of all communication and promotional material/items e.g., pamphlets, newsletters, annual reports, t-shirts, etc.\n• Proofreading, editing, and updating of various publications – career guidance booklets, pamphlets.\n• Distribution of AgriSETA publications.\n• Assist with the gathering of information for content and images.\n \nCORPORATE BRANDING AND COMMUNICATION\n• Inputs to the design of corporate branding – corporate documents etc.\n• Inputs and updating the development of the Marketing and Communication Policy and Strategy aligned to the goals and objectives of the AgriSETA.\n• Maintaining the corporate image of the SETA, inclusive of the use of logos, and correct branding on stationery and other corporate and promotional materials.\n• Coordinate the design and printing of all communication and promotional material/items e.g., pamphlets, newsletters, annual reports, t-shirts, etc.\n• Control and distribution of promotional materials/equipment to the AgriSETA provincial departments.\n• Internal communication with regard to adhering to the policy of branding for documents and related material.\n \nDIGITAL MARKETING AND COMMUNICATIONS\n• Implementation of social platforms strategy for online traffic to the SETA website.\n• Contributing / implementing to the development campaigns using digital communication and social media to promote the SETA services and products.\n• Monitoring the brands and campaigns to raise brand awareness.\n• Monitor usage/hits and assess data to determine trends.\n \nWEBSITE AND INTRANET\n• Updating the website as and when required.\n• Follow up on information not placed by the required time.\n• Monthly information updates per division\n• Checking information (editing) before placement on the website.\n• Communicate with the ICT division as appropriate to obtain technical support for website infrastructure and content updating.\n \nAD HOC AND ADMINISTRATION\n•Any other duties, which may be assigned from time to time.\n• Working in conjunction with the Supply Chain Management department\n• Arranging meetings.\n• Travel coordination in accordance with policy and regulations\n• Administration of annual performance targets – filing systems: electronically and hard copy.\n \nINTERNAL AND EXTERNAL CONTACTS\n• Internal divisions: All divisions within AgriSETA\nExternal: Stakeholders\n \nMINIMUM QUALIFICATION & EXPERIENCE\n• A National Diploma NQF Level 6 or equivalent qualification in Marketing / Communications, Public Relations or Business Administration.\n• 3 years of work experience in marketing, communications, or stakeholder relations.\n• Experience in implementing/delivering marketing or communications campaigns (including digital content).\n• Experience in event planning and management.\n• Experience in website design or management will be an added advantage.\n• A valid driver’s license is a requirement.\n \nSkills Required:\n• Communication skills enabling verbal and written communication at all levels\n• Good Interpersonal skills.\n• Good Organisational and Planning skills\n• Attention to Detail\n• Presentation Skills\n• Project Management Skills\n• Innovation\n• Team-Orientated\n• Time Management Skills\n• Deadline Driven\n \nCompetencies Required:\n• Computer literacy (especially Excel)\n• Knowledge of relevant legislation within the SETA environment, Skills Development Act, PFMA, and Electronic Communication is an added advantage\n• Understanding of branding principles and application of these in communication and marketing.\n• Understanding company policies and procedures applicable to the specific work environment to ensure that work outcomes are compliant.\n• Ability to do trend analysis and advise thereon.\n• The ability to accurately give an account of information on the performance of outputs.\n• Ability to work proactively using own initiative, prioritise work and meet deadlines, with well-developed time management skills and demonstrable project management skills.\n• Good written communication skills, with the proven ability to write engaging copy for a range of channels and audiences.\n• Good verbal communication and presentation skills, for face-to-face contact at meetings; presentations and briefings\n• Innovative – introducing new thoughts and ideas\n• Team player – ability to work with colleagues and necessary stakeholders\n• Proactive – to implement the necessary actions. Willing and able to work overtime when required.\n• Required to travel extensively\n \nEmployment Period: Permanent\n \n \nAn updated CV (excluding certificates) should be forwarded to: MarCommsPractitioner@agriseta.co.za\n \nClosing date: Tuesday, 27 August 2024\n \nNote: Communication will be restricted to the shortlisted candidates only. Should you not hear from us within 4 weeks after the closing date of this advertisement, consider your application unsuccessful.\n \nThis advertisement has minimum requirements listed. Management reserves the right to use additional relevant information as criteria for short-listing. AgriSETA is an equal opportunity employer and preference will be afforded to candidates in terms of the Employment Equity Plan.\nDisabled candidates are encouraged to apply and an indication in this regard will be appreciated."
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p189c72a9-c0e9-4e30-b223-af9841f53817"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/agriseta_orig.gif",
            "href": "https://www.govpage.co.za/agricultural-sector-education-training-authority-agriseta-vacancies-blog/agricultural-sector-education-training-authority-agriseta-vacancies5923732",
            "title": "AGRICULTURAL SECTOR EDUCATION TRAINING AUTHORITY (AGRISETA) VACANCIES",
            "content": [
                " \nAGRICULTURAL SECTOR EDUCATION TRAINING AUTHORITY (AGRISETA)\n ",
                " \n \nRE-ADVERTISEMENT\n \nASSISTANT MANAGER: EASTERN AND WESTERN CAPE REGIONAL SUPPORT\nSALARY SCALE: D1 Level 6 R772 013.37 (CTC)\nRef: AgriS01/08/2024\nDesignation\nAssistant Manager: Eastern and Western Cape Regional Support\nReporting to Manager: Rural Development\nDivision Learning Programmes and Projects\nOffice Location Head Office, Pretoria\n \nJob Purpose\n• To co-ordinate all approved learning programmes, reporting, and monitoring of implementation in the relevant provinces.\n• Monitor implementation and act as first-line of assistance on issues relating to payments and document submissions.\n \nKEY PERFORMANCE AREAS\n \nKey Performance Area - Functional outputs / Actions\n \nProject Coordination\n• Supports and coordinates the skills development programmes in Eastern and Western Cape in partnership with Government Departments, commodity organisations, and communities in land reform, rural development, and agriculture.\n• Establishes, participates in relevant skills development forums in the provinces (Eastern and Western Cape) that promotes support to rural agricultural structures through mentorship programmes.\n• Coordinates applications from State Departments in provinces for approval.\n• Assess readiness of projects, through support and/or assistance from AgriSETA.\n• Oversees the generation, distribution, and receiving approval letters and contracts.\n• Monitor and implement approved mentorship projects and learning programmes in the provinces.\n• Site verification and monitoring of all AgriSETA funded learning programmes and partnership initiatives.\n• Prepare site monitoring for project managers.\n• Monitor the compliance of project implementation plan.\n• Responds to provincial enquiries with regards to skills development in the provinces.\n• Assist with facilitation of provincial strategic partnerships with public and private stakeholders.\n• Conducts weekly site visits to provide ongoing support and ensure training is being rendered.\n \nAdhoc\n• Any other duties which may be assigned from time to time.\n \nMinimum Qualification and Experience\n• Degree (NQF level 7) in Public or Business Administration, Agriculture or Community Development.\n• 5 years experience in administration and monitoring of projects.\n• Added advantage, the incumbent should have experience in project management.\n \nRequired Competencies\n• Monitoring of projects and monthly reporting.\n• Presentation skills.\n• Business writing skills.\n• Stakeholder Management.\n• Willing to work under pressure.\n• Able to travel extensively.\n \n \nEmployment Period: Permanent position (SETA License).\n \nAn updated CV with a covering letter (excluding certificates) should be forwarded to: Asm@agriseta.co.za\n \nClosing date: Tuesday, 27 August 2024 @ 16h30\n \nEnquiries: Tshepiso@agriseta.co.za\n \nNote: Please indicate your current and required salary. Communication will be restricted to the shortlisted candidates only. Should you not hear from us in 4 weeks after closing date of this advertisement, consider your application unsuccessful. This advertisement has minimum requirements listed. Management reserves the right to use additional relevant information as criteria for short-listing. AgriSETA is an equal opportunity employer and preference will be afforded to candidates in terms of Employment Equity Plan.\n \nPlease note that this is a re-advertisement, applicants who previously applied to this position are encouraged to apply, quoting the reference as per above.\n \nDisabled candidates are encouraged to apply and an indication in this regard will be appreciated.\n \n \n \n \n ",
                " \n \n \n \n \nADVERTISEMENT\n \nASSISTANT MANAGER: EXPENDITURE\nPERMANENT\nSALARY SCALE: PATERSON C5 LEVEL 6 R658 733,53 - R797 067,57\nRef: AgriS0808/2024\nDESIGNATION Assistant Manager: Expenditure\nReporting to Manager: Finance\nDivision Administration\nBusiness Unit Finance\nOffice Location Head Office (Pretoria)\n \nJOB PURPOSE\nTo assist in the management of the expenditure of AgriSETA\n \nKEY PERFORMANCE AREAS\n \nKEY PERFORMANCE AREA - FUNCTIONAL OUTPUTS / ACTIONS\n \nLiability Management\n• Reconcile creditor’s accounts\n• Pay liabilities within 30 days\n• Propose changes or updates on the creditor’s master file\n \nExpenditure\n• Recognition and payment of invoices (admin and projects)\n• Process bank statement transactions on the accounting system and maintain source documents\n• Recognition and payment of payroll transactions (e.g. interface payroll into the accounting system, etc)\n• Verification and safekeeping of source documents\n• Recognition and payment of Mandatory grants\n \nManagement of Fruitless, wasteful and irregular expenditure\n• Identify, record, and report irregular expenditure\n• Identify, record, and report fruitless and wasteful expenditure\n \nCash Management\n• Manage all prepayments\n \nReporting\n• Ensure completeness of source documents\n• Monthly reporting of accruals (admin and projects)\n• Monthly report of irregular expenditure\n \nMINIMUM QUALIFICATION & EXPERIENCE\n• Degree in Accounting/Finance (NQF Level 7)\n• Minimum of 5 years working experience within the financial environment\n• SETA Environment experience\n \nSkills Required:\n• Attentive to details\n• Ability to work with a high volume of data\n• Team player\n• Ability to supervise and transfer skills to subordinates.\n• Ability to meet deadlines and comply with applicable norms and standards\n \nCompetencies Required:\n• Strong knowledge of PFMA, PFMA Regulations, National Treasury norms and standards\n•Moderate knowledge of CaseWare or any financial reporting system\n• Computer proficiency in Microsoft Excel, Word, and PowerPoint\n \n \nEmployment Period: Permanent\n \nAn updated CV with a cover letter (excluding certificates) should be forwarded to: ASM.Expenditure@agriseta.co.za\n \nClosing date: Tuesday, 27 August 2024\n \nEnquiries: Baepi@agriseta.co.za\n \nNote: Communication will be restricted to the shortlisted candidates only. Should you not hear from us within 4 weeks after the closing date of this advertisement, consider your application unsuccessful.\n \nThis advertisement has minimum requirements listed. Management reserves the right to use additional relevant information as criteria for short-listing. AgriSETA is an equal opportunity employer and preference will be afforded to candidates in terms of the Employment Equity Plan. \n \nDisabled candidates are encouraged to apply and an indication in this regard will be appreciated.\n \n \n \n \n ",
                "ADVERTISEMENT\n \nPERMANENT\nMARKETING AND COMMUNICATION PRACTITIONER\nSALARY SCALE: C2 LEVEL 6\nR381 216.17 - R419 337.78\nRef: AgriS0807/2024\n \nDESIGNATION Marketing and Communication Practitioner\nREPORTING TO Assistant Manager: Marketing and Communication\nDIVISION Marketing and Communication\nBUSINESS UNIT Corporate Services\nOFFICE LOCATION Head office, Pretoria – Arcadia\n \nJOB PURPOSE\n• Assist with the administration of the Marketing and Communications unit.\n• Marketing and Communication support to all relevant stakeholders, internally and externally.\n \nKEY PERFORMANCE AREAS\n \nKEY PERFORMANCE AREA - FUNCTIONAL OUTPUTS / ACTIONS\n \nSTAKEHOLDER AND RELEVANT EVENTS\n• Assist in the development of the annual stakeholder calendar in conjunction with management.\n• Identify opportunities to promote AgriSETA at appropriate events. Plan and organise stakeholder and related events - EXPOs, exhibitions, and promotional campaigns.\n• Programme planning in conjunction with the relevant department(s) for the event.\n• Event Management - Undertake full planning of the event – venues, catering, speakers, etc according to checklist requirements.\n• Identifying communication platforms internally and to external Stakeholders e.g. via the media, internet, exhibitions and promotions, campaigns and EXPOs, intranet, etc.\n• Ensure that invitations are sent to the relevant stakeholders.\n• Ensure that appropriate feedback is communicated to external stakeholders.\n• Obtain event feedback and communicate to relevant internal departments.\n• Ensure necessary stationery, equipment, and printing requirements are available for events.\n• Ensure appropriate use of branding at all events.\n• Work in conjunction with the Head: Marketing and Communication / Assistant Manager for all administrative issues.\n \nADVERTISING AND PUBLICATIONS\nANNUAL REPORT\n• Internal and external newsletter contribution – newsworthy articles.\n• Liaise with internal departments for monthly submissions of newsworthy articles.\n• Compilation of content for newsletters, advertisements, etc.\n• Coordinate the design and printing of all communication and promotional material/items e.g., pamphlets, newsletters, annual reports, t-shirts, etc.\n• Proofreading, editing, and updating of various publications – career guidance booklets, pamphlets.\n• Distribution of AgriSETA publications.\n• Assist with the gathering of information for content and images.\n \nCORPORATE BRANDING AND COMMUNICATION\n• Inputs to the design of corporate branding – corporate documents etc.\n• Inputs and updating the development of the Marketing and Communication Policy and Strategy aligned to the goals and objectives of the AgriSETA.\n• Maintaining the corporate image of the SETA, inclusive of the use of logos, and correct branding on stationery and other corporate and promotional materials.\n• Coordinate the design and printing of all communication and promotional material/items e.g., pamphlets, newsletters, annual reports, t-shirts, etc.\n• Control and distribution of promotional materials/equipment to the AgriSETA provincial departments.\n• Internal communication with regard to adhering to the policy of branding for documents and related material.\n \nDIGITAL MARKETING AND COMMUNICATIONS\n• Implementation of social platforms strategy for online traffic to the SETA website.\n• Contributing / implementing to the development campaigns using digital communication and social media to promote the SETA services and products.\n• Monitoring the brands and campaigns to raise brand awareness.\n• Monitor usage/hits and assess data to determine trends.\n \nWEBSITE AND INTRANET\n• Updating the website as and when required.\n• Follow up on information not placed by the required time.\n• Monthly information updates per division\n• Checking information (editing) before placement on the website.\n• Communicate with the ICT division as appropriate to obtain technical support for website infrastructure and content updating.\n \nAD HOC AND ADMINISTRATION\n•Any other duties, which may be assigned from time to time.\n• Working in conjunction with the Supply Chain Management department\n• Arranging meetings.\n• Travel coordination in accordance with policy and regulations\n• Administration of annual performance targets – filing systems: electronically and hard copy.\n \nINTERNAL AND EXTERNAL CONTACTS\n• Internal divisions: All divisions within AgriSETA\nExternal: Stakeholders\n \nMINIMUM QUALIFICATION & EXPERIENCE\n• A National Diploma NQF Level 6 or equivalent qualification in Marketing / Communications, Public Relations or Business Administration.\n• 3 years of work experience in marketing, communications, or stakeholder relations.\n• Experience in implementing/delivering marketing or communications campaigns (including digital content).\n• Experience in event planning and management.\n• Experience in website design or management will be an added advantage.\n• A valid driver’s license is a requirement.\n \nSkills Required:\n• Communication skills enabling verbal and written communication at all levels\n• Good Interpersonal skills.\n• Good Organisational and Planning skills\n• Attention to Detail\n• Presentation Skills\n• Project Management Skills\n• Innovation\n• Team-Orientated\n• Time Management Skills\n• Deadline Driven\n \nCompetencies Required:\n• Computer literacy (especially Excel)\n• Knowledge of relevant legislation within the SETA environment, Skills Development Act, PFMA, and Electronic Communication is an added advantage\n• Understanding of branding principles and application of these in communication and marketing.\n• Understanding company policies and procedures applicable to the specific work environment to ensure that work outcomes are compliant.\n• Ability to do trend analysis and advise thereon.\n• The ability to accurately give an account of information on the performance of outputs.\n• Ability to work proactively using own initiative, prioritise work and meet deadlines, with well-developed time management skills and demonstrable project management skills.\n• Good written communication skills, with the proven ability to write engaging copy for a range of channels and audiences.\n• Good verbal communication and presentation skills, for face-to-face contact at meetings; presentations and briefings\n• Innovative – introducing new thoughts and ideas\n• Team player – ability to work with colleagues and necessary stakeholders\n• Proactive – to implement the necessary actions. Willing and able to work overtime when required.\n• Required to travel extensively\n \nEmployment Period: Permanent\n \n \nAn updated CV (excluding certificates) should be forwarded to: MarCommsPractitioner@agriseta.co.za\n \nClosing date: Tuesday, 27 August 2024\n \nNote: Communication will be restricted to the shortlisted candidates only. Should you not hear from us within 4 weeks after the closing date of this advertisement, consider your application unsuccessful.\n \nThis advertisement has minimum requirements listed. Management reserves the right to use additional relevant information as criteria for short-listing. AgriSETA is an equal opportunity employer and preference will be afforded to candidates in terms of the Employment Equity Plan.\nDisabled candidates are encouraged to apply and an indication in this regard will be appreciated."
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "pe4afed0d-b460-4e30-835b-b3ca3e2dd325"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/hwseta_orig.png",
            "href": "https://www.govpage.co.za/health-and-welfare-sector-education-and-training-authority-hwseta-vacancies-blog/health-and-welfare-sector-education-and-training-authority-hwseta-vacancies7401869",
            "title": "HEALTH AND WELFARE SECTOR EDUCATION AND TRAINING AUTHORITY (HWSETA) VACANCIES",
            "content": [
                " \nHEALTH AND WELFARE SECTOR EDUCATION AND TRAINING AUTHORITY (HWSETA)\n ",
                "DIVISIONAL SECRETARY FINANCE\n2024-08-07 - 2024-08-16\nPermanent\nJHB000164\nOther\nGauteng, JHB - Eastern Suburbs\nThe Successful Candidate will be responsible for providing secretarial, clerical and administrative support to the Executive Manager and division in order to ensure that the division functions in an effective and efficient manner.\n\nMinimum Qualification: \nNational diploma in Office admin and/or Post Matric Secretarial certificate.\n \nMinimum Experience: \n3-5 years Secretarial experience\n \nDuties:\nDrafting administrative correspondence and minutes.\nObtaining, proposing and monitoring deadlines and follow-up dates.\nScreening requests for meetings, scheduling and organizing meetings and travel Arrangements.\nAssisting in the preparation of budgets, monitoring of expenditures, drafting of contracts and purchasing or acquisition orders.\nLiaising with other staff about a range of matters relating to the organization’s operations.\nWriting and answering business or technical letters and other similar correspondence.\nPreparing verbatim reports of proceedings in legislative assemblies, courts of law or other places using shorthand or specialised office equipment.\nSupervising the work of clerical support workers.",
                "Cost to Company per annum: Salary Range:  R323 161 per annum\n\nThe HWSETA is an AA/EE employer and reserves the right not to fill any advertised positions.\n \nThis position will be based in Bedfordview\n \nFor more information please contact:\nLybon Mnisi\n \nAPPLY"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p7f849c13-2b5f-4169-9ded-a240fd80f938"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/sasseta.png?1723664842",
            "href": "https://www.govpage.co.za/safety-and-security-sector-education-training-authority-sasseta-vacancies-blog/safety-and-security-sector-education-training-authority-sasseta-vacancies7416213",
            "title": "SAFETY AND SECURITY, SECTOR EDUCATION & TRAINING AUTHORITY (SASSETA) VACANCIES",
            "content": [
                " \nSAFETY AND SECURITY, SECTOR EDUCATION & TRAINING AUTHORITY (SASSETA)\n ",
                "Safety and Security Sector Education and Training Authority (SASSETA) is a public entity, established in terms of Section 9(1) of the Skills Development Act of 1998, as amended.\n \nThe following fixed-term contract position expiring on 31 March 2030 exists in the organisation:\n \nASSESSMENT AND WORKPLACE PRACTITIONER\nAll-inclusive Annual Remuneration Package (TCTC): R 885 464.00\n \nReporting directly to the ETQA Manager, the incumbent shall be responsible for the following:\n \nAssessment and Design\nEnsure that a systematic process is implemented for the planning, designing, moderation, validation and approval of the final assessment instruments;\nEnsure a systematic process is implemented for tools in order to facilitate consistency;\nManage the quality assurance of moderation of the final assessment instrument;\nEnsure that the moderation process included evaluation of the appropriateness of the time allocated and the cost-effectiveness of the instrument against set criteria is adhered to\nRequest Moderator Reports to quality assure the moderation process;\nManage the quality assurance of validation of the final assessment instrument;\nQuality Assurance of marking;\n Validate that the criteria and appointments for markers and moderators have been set and adhered to.\nDevelop and maintain a database of accredited external qualification evaluators\nManage processes that are for the planning, development, moderation, implementation, validation, and approval of the final assessment conducted;\nManage external assessment processes\nEnsure that there is a reliable and secure electronic database to record learner achievements, assessment centres, external assessment application\nReport to the QCTO on the performance of functions in the form and manner required by the QCTO\nTo report on quality assurance activities, actions and decisions\nCoordinate and Management of External Integrated Final Assessments\nDevelop and maintain database of accredited external qualification evaluators\nInform applicants of outstanding requirements and coordinate receipt of these\nTo monitor and manage the service provider capacity building programme\nTo manage the implementation of legacy qualification certification processes and procedures\n \nCoordinate the development of Assessment instruments\nCoordinate the development and design of external assessment exemplars and instruments\nCoordinate the development and design of the Qualification Assessment Specification (QAS) Addendum\nCoordinate and manage the conduct of External Integrated Final Assessments (EISA)\nDevelop and maintain a reliable and secure electronic database to record learner enrolment and achievements\nInform applicants (Stakeholders) of outstanding requirements and coordinate receipt of documents/Evidence\nSubmit recommendations and supporting documentation for review\nUpdate system with progress steps and actions\nCoordinate Stakeholder Meeting or Workshops\nCoordinate review sessions\nCompile information as evidence for reporting against targets\nMaintain and update evidence files\nDraft standardised, regular and ad hoc reports as required\nCoordinate the evaluation and identify learning programme development gaps and advise applicants\nCompile recommendations on learning programmes and capture onto system\n \nPlan, schedule, manage, conduct EISA\nDevelop processes and procedures for the development of exemplars and assessments instruments.\nCoordinate, implementation and administration of EISA sessions.\nSchedule proposed EISA dates on an annual basis\nCompletes and send through the notification of EISA document to the QCTO three months prior the proposed EISA dates\nCoordinate appointment of invigilators and allocates an SME to conduct monitoring of the EISA\nCoordinate confidentiality Agreements between QP, Assessment Centre, Invigilator, SME monitor, Markers and Assessors\nCoordinate and arrange the EISA tools/instruments to be available\nEnsure that there is a lockable steel cupboard available to store the EISA tools/instruments for the duration of EISA\nEnsure that marking, moderation and recording of results takes place as per SASSETA’s standardised practice\nEnsure that correct submission of final results within 21 working day of the date of the EISA to the QCTO for approval\nDeal with Assessments Appeals\nRecommend the certification of learners to the QCTO within the turnaround time the person to\n \nSite and Monitoring visits Assessment Centre\nConduct site and monitoring visits as per the approved monthly schedule\nDevelop accreditation criteria for assessment centres\nPromote compliance to SDP in line with Accreditation set standards\nProvide regular and Ad hoc reports as per the site visit\n \nJOB REQUIREMENTS:\nGrade 12 or Matric is required.\nA minimum of NQF Level 6 qualification in Training and Development / Education Management / B-Tech in HRM / OD ETD / Learning Development Advisor is required.\nA minimum of 3 years’ experience in learning and development or Skills Development environment.\nA minimum of 2 years’ experience in assessment assurance process is advantageous.\nMust have a moderate understanding of education, training and quality assurance processes.\nMust have a sound understanding of Skills Development Act,\nOccupational Qualification Sub-Framework policy\nMust be computer literate at an intermediate level.\nMust have a valid driver’s Licence\n \nSKILLS AND ATTRIBUTES REQUIRED:\nProfessionalism\nProfessional Ethics and Integrity,\nDiligence,\nConflict management and resolution skills,\nCompliance orientation,\nGood communication skills (oral and written),\nAbility to prioritize and work under pressure\nDetail orientated person,\nAbility to take initiative\n \n \nPLACE OF WORK: SASSETA Head Office, Waterfall Corporate Campus, 74 Waterfall Drive, Midrand, 2090.\n \nApply online using the SASSETA website address provided below and attach a detailed CV and one (1) PDF file consisting of certified copies, not older than six months, of all your qualifications relevant to the position (from Matric / Grade 12 to the highest held tertiary qualifications) including an ID copy and a driver’s licence.\n \nWebsite address: www.sasseta.org.za  \n \nClosing Date for Applications: 2 September 2024  \n \nIt is SASSETA’s intention to promote equity (race, gender and disability) through the filling of this position with a candidate whose promotion/appointment will promote representativity in line with the numerical targets as contained in SASSETA’s EE Plan. Applications from designated groups are therefore encouraged.\n \nThe successful candidate will be subjected to security clearance and will be expected to sign the employment contract and performance contract.\n \nOnly short-listed candidates will be contacted. Should you not hear from the HR Department after four (4) weeks from the closing date, assume that your application was unsuccessful.\n \nPLEASE NOTE: Applications from unsuccessful candidates will not be retained.\n \nNB: SASSETA reserves the right not to make an appointment.\n \nDISCLAIMER: SASSETA employs appropriate, reasonable technical and organisational measures designed to prevent unlawful access, loss or damage of personal information. By applying for a vacant position at SASSETA you expressly give SASSETA consent to process your personal information in accordance with the Protection of Personal Information Act 4 of 2013 (“POPIA”), the SASSETA Recruitment Policy/Procedures, the SASSETA’s POPIA Policy and the SASSETA’s Privacy Policy.\n \nPLEASE APPLY HERE",
                "Safety and Security Sector Education and Training Authority (SASSETA) is a public entity, established in terms of Section 9(1) of the Skills Development Act of 1998, as amended.\n \nThe following fixed-term contract position expiring on 31 March 2030 exists in organisation:\n \nGOVERNANCE, RISK AND COMPLIANCE (GRC) PRACTITIONER\nAll-inclusive total annual remuneration package (TCTC): R637 461.00\n \nReporting to the Governance, Risk and Compliance (GRC) Manager, the incumbent shall be responsible for:\nAssist the Governance, Risk and Compliance (GRC) Manager with the submission of risk related information on the Governance Charter and evidence to DHET as required\nAssist with the preparation of the Quarterly reports on the GRC target for the APP to DHET.\nAssist with the preparation of the Quarterly reports on Strategic risk register to National Treasury.\nAssist with the preparation of Quarterly reports on the compliance framework to National Treasury.\nPrepare evidence file for the submission of annual risk maturity assessment.\nSupport the GRC office on submissions to the Board and/or sub committees.\nAttend and participate in internal Committee meetings as required.\nCollate information from Committee Secretaries on quarterly meetings conducted.\nAssist with the provision of information to the Risk Management Committee (RMC) and the Audit and Risk Committee (ARC) as required.\nAssist with the formulation and review of GRC policies for ARC’s recommendation.\nDevelop and monitor the Organisational Compliance Calendar periodically.\nPrepare the compliance report to the Risk Management Committee.\nCoordinate internal and external audit process.\nCoordinate and arrange Audit Steering Committee meetings as and when required.\nFacilitate engagement letter sessions between Internal Audit and Business units when required.\nFacilitate meetings between AGSA and Internal Audit when required.\nConsolidate and update risk registers on a quarterly basis.\nFacilitate SASSETA staff training sessions on risk management.\nSchedule risk assessment and fraud awareness workshops\nSupport implementation of Risk Management Plan and Fraud Prevention Plan\n \n\nJOB REQUIREMENTS:\nAn NQF level 6 qualification or equivalent with exposure on any of the following areas, Risk Management, Compliance, Internal audit, Financial Management, Project Management and Financial Accounting is required.\nA minimum of 3 years’ experience in any of the following areas: Internal Audit, Risk and Compliance Management and Corporate Governance or similar experience is required.\nSound experience in coordination of activities is required and  \nMust be computer literate at an intermediate level.\n \nSKILLS AND ATTRIBUTES REQUIRED:\nKnowledge of PFMA, Treasury Regulations, and other relevant legislation\nKnowledge of administrative processes and systems.\nRisk Mitigating and Management skills.\nPlanning and Organising skills.\nSystems and process thinking skills.\nMust be a Team Player.\nMust be service oriented.\nTime management skills.\nStakeholder engagement skills.\nAbility to monitor policies, procedures and guidelines.\nGood analytical skills.\nReport writing skills.\nGood interpersonal skills.\nProblem solving skills\n \n \nPLACE OF WORK: SASSETA Head Office, Waterfall Corporate Campus, 74 Waterfall Drive, Midrand, 2090.\n \nApply online using the SASSETA website address provided below and attach a detailed CV together with one (1) PDF file consisting of certified copies, not older than six months, of all your qualifications relevant to the position (from Matric / Grade 12 to the highest held tertiary qualifications) including an ID copy and a driver’s licence.\n \nWebsite address: www.sasseta.org.za  \n \n \nClosing Date for Applications: 2 September 2024  \n \nIt is SASSETA’s intention to promote equity (race, gender and disability) through the filling of this position with a candidate whose promotion/appointment will promote representativity in line with the numerical targets as contained in SASSETA’s EE Plan. Applications from designated groups are therefore encouraged.\n \nThe successful candidate will be subjected to security clearance and will be expected to sign the employment contract and performance contract.\n \nOnly short-listed candidates will be contacted. Should you not hear from the HR Department after four (4) weeks from the closing date, assume that your application was unsuccessful.\n \nPLEASE NOTE: Applications from unsuccessful candidates will not be retained.\n \nNB: SASSETA reserves the right not to make an appointment.\n \nDISCLAIMER: SASSETA employs appropriate, reasonable technical and organisational measures designed to prevent unlawful access, loss or damage of personal information. By applying for a vacant position at SASSETA you expressly give SASSETA consent to process your personal information in accordance with the Protection of Personal Information Act 4 of 2013 (“POPIA”), the SASSETA Recruitment Policy/Procedures, the SASSETA’s POPIA Policy and the SASSETA’s Privacy Policy.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "14/8/2024",
            "iframe": "",
            "uuid": "p257a50ec-bf71-4c0e-b89a-38b3f6693469"
        }
    ],
    "departments": {
        "kwazulu natal department of transport vacancies": "https://www.govpage.co.za/kwazulu-natal-transport-vacancies-blog/kwazulu-natal-department-of-transport-vacancies5835135",
        "north west department of health vacancies": "https://www.govpage.co.za/north-west-health-vacancies-blog/north-west-department-of-health-vacancies6964746",
        "city of johannesburg vacancies": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies5914232",
        "city of tshwane vacancies": "https://www.govpage.co.za/city-of-tshwane-metropolitan-municipality-vacancies-blog/city-of-tshwane-vacancies5963644",
        "national credit regulator (ncr) vacancies": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies7860878",
        "eastern cape development corporation (ecdc) vacancies": "https://www.govpage.co.za/eastern-cape-development-corporation-ecdc-vacancies-blog/eastern-cape-development-corporation-ecdc-vacancies6015075",
        "eastern cape liquor board (eclb) vacancies": "https://www.govpage.co.za/eastern-cape-liquor-board-eclb-vacancies-blog/eastern-cape-liquor-board-eclb-vacancies1446823",
        "mpumalanga economic growth agency (mega) vacancies": "https://www.govpage.co.za/mpumalanga-economic-growth-agency-mega-vacancies-blog/mpumalanga-economic-growth-agency-mega-vacancies2454279",
        "trade & investment kwazulu-natal (tikzn) vacancies": "https://www.govpage.co.za/trade-and-investment-kwazulu-natal-tikzn-vacancies-blog/trade-investment-kwazulu-natal-tikzn-vacancies8533691",
        "johannesburg water vacancies": "https://www.govpage.co.za/johannesburg-water-vacancies-blog/johannesburg-water-vacancies8307651",
        "agricultural sector education training authority (agriseta) vacancies": "https://www.govpage.co.za/agricultural-sector-education-training-authority-agriseta-vacancies-blog/agricultural-sector-education-training-authority-agriseta-vacancies5923732",
        "financial and accounting services sector education and training authority (fasset) vacancies": "https://www.govpage.co.za/agricultural-sector-education-training-authority-agriseta-vacancies-blog/agricultural-sector-education-training-authority-agriseta-vacancies5923732",
        "health and welfare sector education and training authority (hwseta) vacancies": "https://www.govpage.co.za/health-and-welfare-sector-education-and-training-authority-hwseta-vacancies-blog/health-and-welfare-sector-education-and-training-authority-hwseta-vacancies7401869",
        "safety and security, sector education & training authority (sasseta) vacancies": "https://www.govpage.co.za/safety-and-security-sector-education-training-authority-sasseta-vacancies-blog/safety-and-security-sector-education-training-authority-sasseta-vacancies7416213"
    }
}