{
    "title": "govpage-public-sector",
    "blogPosts": [
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-joburg_orig.jpg",
            "href": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies2982540",
            "title": "CITY OF JOHANNESBURG VACANCIES",
            "content": [
                "CITY OF JOHANNESBURG\n \nGroup Corporate & Shared Services: Group Human Capital Management\n6th Floor, B Block Metropolitan Centre, 158 Civic Boulevard, Braamfontein\nPO Box 1049  Johannesburg, South Africa, 2000\nTel +27(0) 11 407 6111 - Fax +27(0) 11 339 1878\nwww.joburg.org.za\n ",
                "STUDENT INTERNSHIP CIRCULAR 016/2024 \n \nInternship opportunity for all qualifying Students in the Johannesburg Community \n \nCLOSING DATE: MONDAY, 02 SEPTEMBER 2024 \n \nSTUDENT INTERNSHIP POSITION: HUMAN SETTLEMENTS DEPARTMENT \n \nAn internship programme is an intervention by the City of Johannesburg to address the growing demand by a tertiary institution for students to undergo on-the-job exposure, as a pre-requisite to acquire an academic qualification or as a requirement after the acquisition of academic qualification to obtain experiential training. The City is committed to providing work-based training for students.\nThis internship opportunity is applicable to youth in the Johannesburg communities, who qualifies for this internship and have never participated in an internship programme before. \nThis Vacancy is open to all qualifying STUDENTS in the Johannesburg Community for a period not exceeding 18 months \nInterested applicants are invited to apply for the positions listed in the circular. \nComplete the online job application form and attach all relevant documents (Certified Qualification/s, ID, and CV). \nApplicants are advised to use Google Chrome when applying for CoJ positions. \nThe City of Johannesburg reserves the right not to make an appointment. \nAppointments will be made in accordance with the COJ Employment Equity policy and People with disabilities are encouraged to apply. \nThe City of Johannesburg is an equal opportunity employer. \nAny misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \nWHERE TO APPLY \nhttps://www.joburg.org.za/work_/Pages/Work%20in%20Joburg/Vacancies/2021%20Internships/2021-Internships.aspx\n\n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: Credit Record, CV validation and Employment record verification, Criminal check, and Identity validation.",
                "The City of Johannesburg (CoJ), Human Settlements Department has the following Internship opportunity available for a period NOT exceeding eighteen 18 months \n \nDepartment: Human Settlements \nBranch: Executive Directors Office \nDesignation: Internship \nRemuneration: (Qualification completed with min 360 credits): R9 531,54 pm (Basic Salary, no benefits) \nLOCATION: 222 Smit Street, Braamfontein \n \nMinimum Requirements: \nGrade 12 (NQF level 4) plus Degree (NQF level 7) in Business Management Administration/ Public Management or Public Administration. \nOnly City of Joburg residents will be considered. \n \nPrimary Function:\nTo perform developmental level professional administrative work, research, and analysis in support at Executive Directors Office at the Department of Human Settlements. To participate in the directorate day-to-day operations that include general office administration, monitoring and evaluation risk management and regulatory compliance, HR and involvement in administrative tasks related to long medium and short-range strategic planning. This further include contribution to development of Business Plan, Quarterly report and strategic planning concept notes. \n \nKey Learning Areas: \nRender developmental level professional administrative and support service in the Business Management Directorate. \nSite visits and research Analysis- Assist with verifying reported information by undertaking site visits and /or physical risk assessments to projects; \nAdministrative tasks related to long, medium, short range strategic planning by assisting with. \nTransporting by hand of restricted documents dealing with all types of sensitive and confidential information. \n \nLeading Competencies: \nComputer Literacy and Office Applications; \nLanguage proficiency (reading and written) in English; \nOrganisational skills; \nExcellent oral and written communication skills; \nProficiency with computer software and applications and ability to analyse data using Microsoft Excel; \nFlexibility / adaptability; \nInterpersonal abilities; \nAnility to plan, organize and prioritise work; \nSelf-confidence;\nCreativity;\nNumeracy.\n \nCore Learning Competencies: \nKnowledge of council standard processes and procedures relating to providing administrative support, General. \nGeneral knowledge of Municipal governments and city regulations / codes. \nAbility to work independently after receiving initial guidance; \nAbility to handle confidential information in a sensitive manner; \nDetails oriented and team player; \n \n \nENQUIRIES ONLY: \nContact Person: Nonjabulo Sibiya \nTel No: (011) 061 3141 \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1mYevUzfVTDGeexJ-VXNenQew554\nAPPLY ONLINE VIA WEBSITE: www.joburg.org.za\nCLOSING DATE: MONDAY, 02 SEPTEMBER 2024 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. Only shortlisted applicants will be contacted."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "pf0815e21-ddfb-4d98-acbf-f6fb792d5749"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-ekurhuleni_orig.png",
            "href": "https://www.govpage.co.za/ekurhuleni-metropolitan-municipality-vacancies-blog/city-of-ekurhuleni-vacancies4415317",
            "title": "CITY OF EKURHULENI VACANCIES",
            "content": [
                " \nEKURHULENI METROPOLITAN MUNICIPALITY\n ",
                " \n \n \nGENERAL ASSISTANT (REFUSE AREAS & TEAMS) - ERWM19562\n \nClosing Date: 2024-09-03\n \nDepartment Environmental Resource & Waste Management Department (2019)\nLocation City of Ekurhuleni\nRemuneration R 171,972.00 to R 235,896.00 - Basic salary per annum (plus benefits)\nAssignment Type Permanent\n \nMinimum Requirements:\nGrade 9\nAbility to perform the physical duties\n \nCore Responsibilities:\nCollect and remove refuse from residential, business and industrial premises\nPlace and remove litter bins and change the refuse bags\nPhysically clean litter on sidewalks, street and public parking areas\nOperate the lifting and compaction controls of vehicles\nHook and empty 240 and 851 litre containers\nClean spillage of refuse during collection\nReport defects on compaction unit of vehicles to driver\nClean and grease vehicles\nRemove animal carcasses from roads, houses and vets\nEnsure compliance with OHSA\n \nEnquiries: Tel: 0860 54 3000\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "TEAM LEADER (REFUSE AREAS & TEAMS) - ERWM19846\n \nClosing Date: 2024-09-03\n \nDepartment Environmental Resource & Waste Management Department (2019)\nLocation City of Ekurhuleni \nRemuneration R 217,920.00 to R 298,932.00 - Basic salary per annum (plus benefits)\nAssignment Type Permanent\n \nMinimum Requirements:\nGrade 12\nRelevant experience\n \nCore Responsibilities:\nPhysical cleaning of litter on sidewalks, street and public parking areas\nPlacement and removal of litter bins and changing of refuse bags\nRemoval of animal carcasses from roads, houses and vets\nDelivery of 851 litre and 240 litre refuse bins\nComply with safety rules and safe working procedures\nWash and grease refuse collection truck and other council vehicles\nOccasional moving of furniture between offices\nResponsible for safekeeping of tools and daily inventory of the number of bins on site\nClean the offloading ramp and between containers\nAssist with general repairs to containers, refuse bins and equipment\nResponsible for operating the hydraulic compaction and lift mechanisms on refuse removal truck\nEnsure that the spillage that occurs during the load process is properly cleaned\nDirect the Lorry Driver when reversing.\nControl the work of co- workers\n \n \nEnquiries: Tel: 0860 54 3000\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE",
                "DIVISIONAL HEAD: SOCIAL DEVELOPMENT - HESD21164\n \nClosing Date: 2024-08-25\n \nDepartment Health & Social Development Department (2019)\nLocation City of Ekurhuleni\nRemuneration R 1 461 024 to R 1 805 448 - Total cost to company\nAssignment Type Fixed Term Contract\n \nKey performance areas:\n• Develop, manage and monitor overall social development strategies, practices and processes.\n• Strategic capability and leadership to execute social development and sustainable strategy in response to organisation strategy.\n• Communicate a meaningful strategic context that guide and direct the development of best practices, integration, process alignment and service delivery.\n• Provide human and material resources to ensure efficient and effective execution of social development programme.\n• Develop annual operating plan and secure resources necessary to achieve identified objectives consistent with the medium term requirements.\n• Ensure effective implementation of Council resolutions with regard to governance and risk management through implementing risk management governance and compliance policy in own practice area to identify and manage governance and risk exposure liability.\n• Oversee the preparations of monthly and annual budgets and financial reports in accordance with statutory and Council presentation requirements.\n\n• Monitor end enforce effective financial controls, corporate governance and financial compliance throughout area of accountability.\n• Develop and deliver on service level agreement (SLA) in alignment with the Batho-Pele principles, monitor feedbacks and ensure continued customer satisfaction.\n• Improve internal and external customer satisfaction level.\n• Build and sustain relationships with decision makers and interests groups in support of Divisional objectives.\n\nCore Requirements:\n• BA degree in Social Development\n• Registration with South African Council for Social Services Professions (SACSSP).\n• 5- 8 Years' Relevant Experience\n• BA Honours to Masters in Social Work and Knowledge of Local Government Processes will be an Added Advantage\n \n \nInterested candidates whose background and experience match these challenging and exciting positions are invited to apply using an online application form attached to the advertisement on the website of the City of Ekurhuleni (www.ekurhuleni.gov.za).\n\nEnquiries: Tel: Natasja Havenga (011) 999 6356.\n\nNote: The successful candidate who does not have the NQF Level 5 Finance Management qualification will be required to obtain it within 18 months, in terms of the National Treasury Requirement.\n\nAppointments will be made on a 5 (five) year fixed term and will be subject to the signing of an employment contract, performance agreement and disclosure of financial interest. Candidates will be subjected to relevant competency assessment as well as security clearance / vetting processes.\n\nApplications will not be considered if the necessary copies of the required qualifications, identity documents, driver’s license (if applicable) and current professional registration (if applicable), are not attached to the application / CV. Candidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p8920477f-5af2-42ac-b4d1-177bcc9c26a9"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/nhls_orig.png",
            "href": "https://www.govpage.co.za/national-health-laboratory-services-nhls-vacancies-blog/national-health-laboratory-services-nhls-vacancies2857639",
            "title": "NATIONAL HEALTH LABORATORY SERVICES (NHLS) VACANCIES",
            "content": [
                " \nNATIONAL HEALTH LABORATORY SERVICES (NHLS)\n ",
                "GUIDELINES TO APPLICANTS \nIf you meet the requirements, kindly email a detailed CV to the relevant Practitioner/Administrator (Human Resources), quoting the reference number and the job title. Should you be in possession of a foreign qualification, it must be accompanied by an evaluation certificate from the South African Qualification Authority (SAQA). \nProof of registration with a Professional body (e.g. HPCSA, SANC etc.) and other supporting documents should accompany all applications. e.g qualifications, Identity document, driver’s license etc. \nResponse Email addresses of the relevant HR representative and is supplied at the end of each regional adverts. The onus is on the applicant to ensure that their application has been received. Incomplete applications and applications received after the closing date will not be considered. \nCandidates credentials will be subject to criminal record checks, citizen verification, financial record checks, qualification/Study verification, previous employment verification, social media accounts behavior/comments verifications. \nCandidates may be required to undergo competency/psychometric assessments, presentations, typing tests or any other related assessments. \nAll health professional roles may be subjected to further assessment in line with the applicable proficiency matrix to determine the correct level. \nAt its discretion, The NHLS reserves the right to remove the advertisement and or not to appoint. \nCorrespondence will be limited to shortlisted candidates only. \nThese positions are open to all employees of the NHLS Including the employees who are on contract in similar or different positions. \nInternal employees are required to complete a period of twelve months in their current role before they can be eligible to apply for transfer. \nThe NHLS is an equal opportunity, affirmative action employer. The filing of posts will be guided by the NHLS employment Equity Targets. \nSuccessful applicants will be remunerated on the published scale associated with the post grade. This means that the remuneration of an applicant who is successful for a position that is lower than his/her current job grade will be adjusted downward with effect from the date of appointment. \nThis is an open advert. External applicants are welcome to apply for this bulletin. \n \nCLOSING DATE: 23 August 2024",
                "BUSINESS UNIT: ACADEMIC AFFAIRS AND RESEARCH \nDISCIPLINE: QUALITY ASSURANCE \nLOCATION: SANDRINGHAM \nPOSITION: RESEARCH MONITORING AND EVALUATION MANAGER (FIXED TERM CONTRACT 12 MONTHS) (RE-ADVERTISED) \nPAY GRADE: D2 \nREFERENCE NUMBER: CORPAARQA0824/001/01 \n \nKey Job Responsibility \n■To identify and implement strategies and measures towards the development of Monitoring, Evaluation and Analytics tools that will lead to adherence to best research practices, substantial improvement to capacity development and provide effective M& E support and interventions for researchers across the NHLS. To develop and strengthen strategies for monitoring and evaluation of academic, research and grants related activities within the NHLS ■ Design, develop and introduce effective tools to monitor programme, project activities, progress and outputs at departmental, regional and institutional levels ■Develop monitoring and evaluation indicators to efficiently measure and report outputs and success■Monitoring and evaluation of overall achievements and progress including sustainability ■Facilitate and be involved in the training, mentoring, supervision as well as any other capacity building activities in biostatistics and M&E as required. ■Tracking, update and analysis of M&E data and information for effective reporting and interventions ■Provide reports (weekly, monthly, quarterly, half-yearly and annual) on NHLS academic, research and grant related activities ■Conduct capacity assessment on existing monitoring and evaluation system and impact analysis of effectiveness of existing programmes and initiatives■ Participate in annual project reviews and planning workshops and contribute to preparation of relevant reports. ■ Assist researchers with monitoring and evaluation tools and support them in their use. ■ Prepare and maintain monitoring and evaluation database. ■ Be actively involved in the writing and submission of scientific papers. ■ Identify and attract resources that will facilitate the role of the NHLS in spearheading the research agenda that promotes effective public health interventions. ■ Understanding of stakeholder requirements for monitoring and evaluation and advising AAR and researchers. ■ Perform other duties as required \n \nMinimum requirements & key competency: \n■ Master’s degree in Public Health, Epidemiology ,Information Technology, Computer Science or related field ■ PhD degree in Public Health, Epidemiology, Information Technology or related ( desirable)■ Eight (8) years’ experience in monitoring and evaluation inclusive of 5 years managerial/supervisory experience and 2 years in database development■ Two (2) years previous experience in a research environment (desirable)■ Sound knowledge of statistical packages preferably SAS or DSTATA:SQL,R or advanced Excel■ Knowledge of Redcap or related web applications■Designing/developing monitoring tools■ Data analysis and interpretation■ Research Methodology ■ Writing of grant proposals■ Computer Literacy■ Analytical skills■ Communication skills (verbal and written). ■ Interpersonal skills. ■Budgeting skills. ■ Data analysis and interpretation skills. ■ Scientific writing skills (Desirable). \n \nContract is renewable at the discretion of the employer and subject to operational requirements. \n \nEnquiries may be directed to Ndabenhle Ngongoma @ (011) 386 6145, or e-mail application to Corporate2@nhls.ac.za\n \n \n \n \n \n \nBUSINESS UNIT: CHARLOTTE MAXEKE ACADEMIC \nDISCIPLINE: CHEMICAL PATHOLOGY \nLOCATION: CHARLOTTE MAXEKE ACADEMIC HOSPITAL \nPOSITION: MEDICAL TECHNOLOGIST (FIXED TERM CONTRACT ENDING 30 SEPTEMBER 2024) \nPAY GRADE: MT1 \nREFERENCE NUMBER: CORPAARQA0524/001-10 \n \nKey Job Responsibility \n■ Perform preventive equipment maintenance performed as per set schedule ■ Perform manual sample pre-treatment including pipetting samples and solvents. ■ Perform sample analysis using LC-MS/MS under the supervision of a laboratory scientist. ■ Adhere to analytical times and basic TAT for organizing and processing samples for a large study. ■ Adhere to analytical times and basic TAT when performing LC-MS/MS analysis of samples under the supervision of a senior laboratory scientist. ■ Verify and release test results. Verify QC of test results. ■ Collate data. ■ Monitor stock for operational needs. \n \nMinimum requirements & key competency \n■ National Diploma: Biomedical Technology (NQF Level 6) or Bachelor of Health Science: Biomedical Technology (NQF Level 7) ■ HPCSA registration as a Medical Technologist in Chemical Pathology or Clinical Pathology. ■ Perform sampling and analysis of blood, tissue and body fluid. ■ Preparation of samples for examination ■ Knowledge for the usage of specialized instrumentation. Knowledge of infection control and sterilization protocols ■ Accurate interpretation of results. Establish and Monitor programmes that ensure data accuracy. ■ Accuracy and organizational skills. ■Attention to detail strive for an error free standard ■ Ability to identify problems and troubleshoot. ■ Ability to work independently and collaboratively ■ Communication Skills (Verbal, Written & presentation) ■ Computer Literacy ■ Time management and evaluation skills. \n\n \nContract is renewable at the discretion of the employer and subject to operational requirements. \n \nEnquiries may be directed to Ndabenhle Ngongoma@ (011) 386 6145, or e-mail application to Corporate2@nhls.ac.za"
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p3f97f5c0-bee8-42f3-b36a-baabbcb84d0d"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/national-home-builders-registration-council-nhbrc.png?1724193975",
            "href": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies7683357",
            "title": "NATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC) VACANCIES",
            "content": [
                " \nNATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC)\n ",
                "CHIEF INFORMATION OFFICER\nCONTRACT TYPE: PERMANENT\nJOB GRADE: COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\nREPORTING TO: CHIEF FINANCIAL OFFICER\nLOCATION: SUNNINGHILL\n \nKEY DELIVERABLES\nThe Chief Information Officer (CIO) is responsible for providing vision and leadership for developing and implementing digital and technology initiatives that align with the mission and strategic objectives of the NHBRC. The CIO is further responsible for the planning and implementation of enterprise Information Technology systems in support of NHBRC operations to improve cost effectiveness, service quality and mission development.\n \nThe Individual will primarily be responsible for, but not limited to the following:\n• Strategy Planning and Architecture\no Development of ICT strategy and architecture aligned to business strategy.\no Ensure measures are in place for implementation of ICT strategy and architecture.\no Align ICT policies, procedures and processes to support the IC strategy.\no Development of enterprise-wide architecture and processes which ensure that the strategic application of change is embedded in the management of the organisation.\n• Technology and Operations Management\no Prioritise and implement suitable technology to enable and streamline all internal operations and help optimise their strategic benefits\no Oversee IT Service Delivery and ensuring high levels of service to the organisation.\no Ensure optimal functioning and maintenance of the NHBRC business support and customer-facing systems.\no Ensure adequate technical infrastructure capabilities in the organisation to ensure optimal performance.\no Develop business applications that match business requirements.\no Ensure effective management of Information Security Controls.\n• People Management\no Manage headcount, recruit, and deploy resources as needed to balance the ICT function budget and leverage skills effectively.\no Ensure skills and capacity needs meet overall business ICT related product and services.\no Manage and oversee team performance through performance planning, coaching and performance appraisals.\no Maintain positive interpersonal relationships with team members and others by demonstrating productivity, initiative and flexibility.\n• Governance, Risk and Compliance Management\no Identifies and manages risks to ICT services and solution by assessing potential risks and building contingencies into ICT Plans.\no Custodian of the NHBRC ICT governance framework and ICT Operating Model.\no Effectively assumes the role of institutional advocate for business management solutions and bring specialist expertise to assist in integrating ICT throughout the organisation.\n\no Implements appropriate ICT reporting to the Council, ARCO, ICTC, CEO, Executive Committee, and Senior Management and facilitate managers to develop reporting protocols, including quantitative and qualitative thresholds, and monitor the reporting process.\no Develop and oversee appropriate policies and procedures to guide the ICT function.\no Ensure compliance to Public Finance Management Act, Corporate Governance and other relevant Treasury regulations and standards.\no Manage the maintenance and enforcement of related Service Level Agreements to minimize business risk and ensure service continuity.\no Ensure that audit requests are promptly adhered to within the stipulated timelines.\n• Financial Management\no Responsible for functional budget and overall financial management of the ICT function.\no Manage IT Service Level Agreements (SLA) with service providers.\no Implement and effectively manage the approved budgets, procurement plans, report variances, and monitor the implementation of remedial actions to minimise impact.\no Identify and analyse trends, review data and evaluate business options to ensure business cases are financially sound.\n• Stakeholder Management\no Establish broad stakeholder involvement and communicates ICT solutions and services status.\no Build client relations by demonstrating professionalism, appropriate self-confidence, a facilitative communication style, and constructive response to client needs.\no Educate Management on Information Technology concepts by using internal control frameworks and other leading practices to design adequate and effective internal controls.\n \nMINIMUM REQUIREMENTS:\n• A bachelor’s degree (NQF7) in Information Technology is mandatory.\n• Chartered Chief Information Officer (C-CIO) certification is mandatory.\n• Minimum 10 years of working experience in an ICT environment with five (5) years at Management level.\n• Industry-related certifications such as the following will be an added advantage: TOGAF, CGEIT, CRISC, CISM, CISSP, PRINCE 2, COBIT, ITIL.\n\nCOMPETENCIES AND SKILLS:\n• An understanding of ICT strategy, enterprise architecture and its application at all levels in this environment and the skills to think strategically.\n• A sound understanding of portfolio, programme and project management and a track record of delivering and enabling large-scale complex ICT projects.\n• Knowledge of ICT standards and security\n• At least five (5) years of ICT experience and management experience within the public sector.",
                "ENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMr. Jabulani Ntshani\nTel: (011) 317 0146\n \nCLOSING DATE: 2 SEPTEMBER 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Chief Information Officer” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates will be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p1e4b441e-a798-49d4-9cde-ad884cebc67f"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/nsfas_orig.jpg",
            "href": "https://www.govpage.co.za/national-student-financial-aid-scheme-nsfas-vacancies-blog/national-student-financial-aid-scheme-nsfas-vacancies3558260",
            "title": "NATIONAL STUDENT FINANCIAL AID SCHEME (NSFAS) VACANCIES",
            "content": [
                " \nNATIONAL STUDENT FINANCIAL AID SCHEME (NSFAS)\n ",
                "The following vacancy exists at NSFAS in Cape Town.\n \nSENIOR SPECIALIST CONTINUOUS VERIFICATION\nType & Grade Permanent, D1\nVacancy No 26 of 2024/25 \nDepartment & Unit Core Business Operations, Continuous Verification\n \nPOSITION OVERVIEW\nTo manage the funder setup process, including defining process cycle dates, disbursement mapping, allowance caps and annual student migration; whilst providing managerial onsite support for TVET Colleges and Universities in collaboration with the Student Services and Regional Coordination functions, to ensure seamless operations and effective data management.\n \nRESPONSIBILITIES:\nPolicy, Systems & Procedure Implementation\n• Implementing and reinforcing compliance procedures related to the NSFAS financial systems.\n• Identifying opportunities and gaps utilizing the knowledge of compliance with legislation, policy and procedures regarding financial systems.\n \nCore Strategic/Operations Objectives Implementation\n• Manage the funder setup process, including defining process cycle dates, disbursement mapping, and allowance caps\n• Analyse outstanding academic results and funding lists to ensure accurate data\n• Resolve exceptions using SQL and Excel to analyse outstanding migrations\n• Identify passed records within N+ and outstanding funding\n• Communicate and resolve exceptions\n• Compare previous funding to current academic year funding to identify discrepancies\n• Review registrations received and generate reports from SQL or Excel\n• Pinpoint potential exceptions and communicate resolutions\n• Provide oversight on the duplicate registrations process\n• Manage the duplicate registration process and responses\n• Analyse and apply duplicate registration resolutions, including reversing records paid to incorrect institutions and processing unpaid records\n• Handle adjustment exceptions and communicate with stakeholders\n• Identify and resolve adjustment exceptions\n• Analyse adjustment received for potential budget implications\n• Review projection files to confirm correct students and amounts being disbursed and communicate the data to the finance department\n• Communicate exclusions with exclusion reasons\n• Reconcile paid records\n• Report on disbursements paid\n• Manage the cancellation process and communicate with stakeholders\n• Create a dedicated mailbox for cancellations\n• Transfer data to SQL Server to be included in disbursement runs\n• Calculate reversals and communicate to the finance department\nPeople Management & Ethical Leadership\n• Manages and participation in the recruitment and selection of unit vacancies in line with EE targets.\n• Delegates tasks to subordinates for implementation.\n• Directs, inspires, coaches and mentor subordinates to deliver quality programmes in line with NSFAS Values.\n• Manages and participates in leading the individual performance contracting and review process for responsible team/s.\n• Manages and participates in all disciplinary matters of subunits related to performance and conduct issues.\nStakeholder Engagement & Relationships\n• Serve as the primary point of contact for key stakeholders, including funders, academic institutions, and internal teams.\n• Proactively identify and address stakeholder concerns, ensuring timely and effective resolutions\n• Collaborate with stakeholders to develop and implement process improvements\n• Facilitate cross-functional meetings and discussions to align on objectives and strategies\n• Represent the department in meetings with senior management and external partners\nProject Management & Leadership\n• Manages multiple tasks and prioritise accordingly without compromising on quality of work\n• Provide oversight and where required participate in projects to address identified needs\n• Where required, analyse and interpret project reports upon completion of the project to evaluate return on investment and to recommend insights for future decision making.\nBudget optimisation\n• Manage expenditure in line with budget for all Continuous Verification related projects (where applicable)\n• Monitors spend aligned to approved budget (where applicable).\nCompliance Monitoring and Evaluation\n• Provide Senior Specialist responsibilities over the Continuous Verification plan and the processes that support the implementation of key risk controls and established compliance risk mitigation processes\n• Where required, support the Senior Manager in conducting monitoring reviews in line with the compliance monitoring plan.\nInformation & Knowledge Management\n• Provide expert training and guidance to staff on all ranges of compliance issues in relation to Continuous Verification.\n• Collaborate with the Senior Manager and ICT to build systems that enable the management of data obtained from different sources.\n• Develop and deliver presentations to communicate findings and recommendations to management.\nReporting & Accountability\n• Prepare monthly and quarterly reports on key performance indicators, process improvements, and stakeholder engagement\n• Analyse data, identify trends, and provide insights to support decision-making.\n \nDESIRED SKILLS AND EXPERIENCE\nMinimum requirements:\n• NQF7 Level qualification in commerce, information systems or related qualifications.\n• Driver’s License\n• Extensive experience (5+ years) in financial systems particularly in two or more of the following functions: data analysis, disbursements, financial reporting and forecasting.\n• Experience (min. 2 years) in the education sector/industry\n• Computer literacy – Intermediate MS Package Suite\n• Strong analytical and problem-solving skills\n• Proficiency in SQL and Excel for data analysis and reporting\n• Excellent communication and stakeholder engagement/management skills\n• Ability to work independently and as part of a team\n• Attention to detail and a commitment to accuracy\n• Understanding and knowledge of compliance with legislation, policy and procedures in regard to financial systems\n• Knowledge and experience of relevant regulations and policies\nPreferred\n• Extensive experience (8+ years) in financial systems particularly in two or more of the following functions; data analysis, disbursements, financial reporting and forecasting.\n• Extensive experience (8+ years) in the education sector/industry\n• Experience with validation of data against standards determined by external stakeholders.\n \nBehavioural Competencies:\n• Effective Communication & Consultation\n• Attention to detail/ Quality Control\n• Monitoring & Evaluation\n• Risk Awareness\n• Integrity\n• Accountability\n• Planning & Organising (e.g. prioritisation & time management)\n• Problem Analysis\n• Decision Making (Judgement)\n• Emotional Intelligence\n• Resilience & Composure",
                "REMUNERATION & BENEFITS\nRemuneration Package: R 924 840– R 1 089 426 per annum\nTotal Cost to Company per annum inclusive of all benefits and company contributions.\n \nPLEASE NOTE\n \nClosing date: 29 August 2024\n \nInterested applicants must apply via this link: Senior Specialist Continuous Verification\n \nThe NSFAS does not consider late applications. The NSFAS talent acquisition team only corresponds with Shortlisted Candidates. Should you not hear from the NSFAS talent acquisition team within 2 months from the closing date, please consider your application unsuccessful.\n \nAppointments will be made in line with the NSFAS Employment Equity goals and targets."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "peed2da25-19da-43e3-a2a8-9ad4b4b18f2b"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/opfa_orig.png",
            "href": "https://www.govpage.co.za/office-of-the-pension-funds-adjudicator-opfa-vacancies/office-of-the-pension-funds-adjudicator-opfa-vacancies2538678",
            "title": "OFFICE OF THE PENSION FUNDS ADJUDICATOR (OPFA) VACANCIES",
            "content": [
                " \nOFFICE OF THE PENSION FUNDS ADJUDICATOR (OPFA)\n ",
                "SENIOR ASSISTANT ADJUDICATOR\nPretoria\nJob Ref #: SAA082024\nIndustry: Academic\nJob Type: Permanent\nSalary: Market Related\n \nDescription:\nMinimum Requirements and Key Competencies:\nStrong administrative skills, including being deadline-driven.\nHigh levels of ethics\nComputer literacy.\nExcellent verbal and written communication skills.\nAbility to think independently and critically about an issue and propose solutions.\nA high level of judgement, confidence and decisive approach.\nAnalytical, problem solving and critical thinking skills\nAbility to manage a caseload and work under pressure\nTake initiative in personal development.\nProper record keeping\nTime management\nTeam player\nAbility to perform in a high-pressure environment.\n \nResponsibilities:\nReceive investigation file and identify areas that require further investigation to dispose of a complaint\nRequest further information from parties to a complaint where required\nIdentify the need for and request expert reports in appropriate matters\nEngage with parties to a complaint concerning the administrative aspects of the file/investigation.\nEnsure that procedural fairness requirements are adhered to\nMaintain a proper record of all complaints allocated, including a record of all correspondence relating to a complaint, proof of service, telephone calls, emails, etc.\nEnsure all information is captured and processed on the OPFA case management system\nEnsure that the submitted draft determinations are of a high quality.\nEnsure adherence to approved workflow process of the organisation.\nParticipate in identifying and reporting risks and challenges experienced by the team in dealing with parties or stakeholders.\nAdhere to all deadlines and turnaround times.\nAdherence to organisational values.\nAssist with projects/ad hoc tasks as and when required\nSubmit weekly and monthly statistics to the Team Leader\nPrepare records for the Financial Services Tribunal or High Court\n \nBehavioural Attributes:\nThe ideal candidate must be results-driven, passionate about service delivery, and able to thrive under pressure while respecting deadlines. They should demonstrate high levels of professionalism, be energetic, outcome-focused, and a strong team player with excellent communication skills and integrity.\n \nRequirements:\nLLB degree (Bachelor of Laws).\nMinimum 5 years post articles experience as an admitted attorney, practising advocate, prosecutor or other relevant experience\nKnowledge and understanding of the appropriate legislative and regulatory frameworks\nLegal research\nAbility to assess facts, interpret legislation and draft legal documents.\nExperience in the financial services sector will be an added advantage.\nExtensive knowledge and understanding of the Pension Funds Act and the role of the Pension Funds Adjudicator.",
                "Candidates who do not meet the aforementioned requirements will not be considered and, therefore, need not apply.\n \nRemuneration:\nOPFA offers market-related remuneration commensurate with the successful candidate’s skills and experience.\n \nThe OPFA is an equal opportunity employer, so preference will be given to candidates from the designated groups in line with the organisation’s employment equity plan.\n \nPersons living with disability are highly encouraged to apply. \n \nThe OPFA reserves the right not to make an appointment. If you do not receive any response within four weeks of the closing date, please accept that your application has been unsuccessful. Regret correspondence will only be sent to interviewed candidates.\n \nIn accordance with the POPI Act 4 of 2013:\nAll candidate personal information is treated with confidentiality and the highest level of security.  Should you not be shortlisted for the vacancy that you have applied for, OPFA will retain your information on our candidate database for a period of 6 months, in the event that you may meet the criteria of a future suitable position which may match your profile and which we will contact you directly for your authorization to proceed with your application.  Should you wish to no longer be listed with us, we will proceed to remove your personal information from our database with your instruction, in accordance with the POPIA guidelines.\n \nAPPLY"
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "pa84c1ff6-3aa3-489f-ad36-2e038b97290a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/psira_orig.jpg",
            "href": "https://www.govpage.co.za/private-security-industry-regulatory-authority-psira-vacancies-blog/private-security-industry-regulatory-authority-psira-vacancies7290277",
            "title": "PRIVATE SECURITY INDUSTRY REGULATORY AUTHORITY (PSIRA) VACANCIES",
            "content": [
                " \nPRIVATE SECURITY INDUSTRY REGULATORY AUTHORITY (PSIRA)\n ",
                "RESEARCHER\nSalary: R 595 125 basic salary P/A plus benefits (Centurion)\n \nRequirements: A recognised Honours Degree in Social Science, Humanities, Law, Criminology, Public Administration and Management, Strategic Studies or other relevant Honours degree, ● coupled with a minimum of 3 years experience working in a research/policy/regulatory environment ● Valid driver’s Licence ● Recognition of Prior Learning (RPL) and applicable knowledge and experience on the job may be considered during the selection process. \n \nEssential criteria: In depth practical knowledge of conducting research ● Extensive Knowledge and understanding the regulatory framework on private security ● Understanding the South African regulatory framework on private security industry ●General understanding of privatization of security in South Africa● Understanding of the PSiRA mandate ● Developing and managing organizational(or other policies) policies ● Demonstrate an understanding of international policy development in security environment ● Ability to provide support in running and managing an efficient research unit ●Demonstrate ability to understand issue quickly and explain them clearly and succinctly ●Demonstrate coherent understanding of how the private security industry is regulated in South Africa in comparison to other countries ●Demonstrate sound judgment● Strong organizational and time management skills, including the ability to assist in managing complex workload ●A calm, logical approach with an ability to work and deliver under pressure ●Excellent negotiation skills ●Confident and capable presenter. Solid knowledge and experience in project management● Efficient stakeholder engagements● Advanced knowledge of computer literacy● Excellent verbal and report writing skills● Qualitative and quantitative skills ● Ability to pay attention to details ●Excellent Planning and Organizing skills ●Problem solving and Analysis skills.\n\n \nKey Performance Areas: To develop a procedure manual for the development of the Authority’s corporate and regulatory policies ●To develop and review and ensure implementation of corporate and regulatory policies for the Authority ●To keep a policy register(both corporate and regulatory) of the Authority● To facilitate proper and adequate consultation before the approval of policies for the Authority ●To popularize all regulatory PSiRA policies to external stakeholders of the Authority ●To draft policy documents(briefs, statements , regulations etc.) on behalf of the Authority ●To conduct research aimed at informing the development of policy documents for the Authority ●To translate research findings to policy documents on behalf of the Authority● To facilitate the approval of corporate and regulatory policy documents for the Authority ●To undertake any other responsibilities as required by the head of the research and development unit● Research, Advisory and public affairs management ● Assist in the building of professional credibility both with peers, local and international stakeholders ● Assist in the promotion of policies( Internal and External).\n \nPLEASE APPLY HERE",
                "RESEARCH CONSULTANTS: FOURTH INDUSTRIAL REVOLUTION AND ARTIFICIAL INTELLIGENCE X2 (06 MONTHS FIXED TERM CONTRACT) \nSalary: R 20 209 per month \n \nRequirements: Degree in Social Science, Humanities, Law, Criminology, Public Administration and Management, Strategic Studies, or other relevant degree ● Post graduate Degree in relevant field will be an added advantage● 2 to 3 years experience working in a research environment● Recognition of Prior Learning (RPL) and applicable knowledge and experience on the job may be considered during the selection process. \n \nEssential criteria: Published at least three (3) or more articles with a recognised journal. Experience in conducting research Studies ● Experience in data collection and research methodology ●Publication in private security or relevant field ●Analytical and writing skills in English● Demonstrate an understanding of the private security industry in South Africa● Knowledge and understanding of key issues in the field of private security in South African. ● Experience of working with internal and external stakeholders ●Understanding the South African regulatory framework of the private industry● General Understanding of the privatization of Security in South Africa● Understanding of the PSiRA mandate ●Confident and capable speaker● Demonstrate ability to understand issues quickly and explain them clearly succinctly ●Demonstrate coherent understanding of how the private security is regulated in South Africa in comparison to other countries● Demonstrate sound judgment● Strong IT skills ●Strong organizational and time management skills, including the ability to assist in managing complex workload● A calm, logical approach with an ability to work and deliver under pressure● Project management and implementation. Ability to work well independently. \n \nKey Performance Areas: To mainly conduct and coordinate research relating to private security industry in South Africa● To assist the Researcher with the development of research proposals, concept notes, research reports, policy briefs, discussion documents and other relevant documents ● To analyse data and provide recommendations to the Researcher on how to improve the regulation of the private security sector in South Africa● To participate in hosting research workshops, seminars and meetings relating the research conducted under the auspices of the Research and Development Unit● To assist the Researcher with research projects that are aimed at informing the development of policy documents for the Authority● To undertake any other responsibilities as required by the Researcher on behalf of the Research and Development Unit.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "pfd4de0ce-e23f-4934-9c5e-febb8d2371cf"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/pic_orig.jpg",
            "href": "https://www.govpage.co.za/public-investment-corporation-pic-vacancies-blog/public-investment-corporation-pic-vacancies9425638",
            "title": "PUBLIC INVESTMENT CORPORATION (PIC) VACANCIES",
            "content": [
                " \nPUBLIC INVESTMENT CORPORATION (PIC)\nPublic Investment Corporation SOC Ltd\nPrivate Bag X187\nPretoria 0001\nRepublic of South Africa\n  \nThe Public Investment Corporation SOC Limited (PIC) is an asset management firm, whose mandate is to make investments in various sectors of the economy on behalf of public sector entities. Amongst our clients are the Government Employees Pension Fund, the Unemployment Insurance Fund and the Compensation Fund. Over the years, we have grown to be amongst the top, large investment managers in South Africa and the rest of the African continent, with current assets under management at just over R2.6 trillion. At the centre of our growth is a team of self-driven professionals who are results-focused.\n ",
                " \n \nWe are currently seeking applications from dynamic individuals for the following position: \n \nOPERATIONAL RISK ANALYST \n• *Job Grade: D1 – D5 \n• Ref: AORM001 \nSalary: All-inclusive remuneration package negotiable \nCentre: Risk Management \n \nPurpose of the role: \nTo identify, assess and mitigate risks within the organization’s operational processes.\n \nRequirements:\nRelevant degree in Risk or Audit or equivalent relevant qualification \nSound understanding of operational risk management principles. \nFinancial services industry knowledge and experience (Preferably Asset Management). \nA good understanding of the key areas of the organization. \n2 - 4 Years relevant experience \n \nDuties:\nConduct day-to-day operational risk activities in terms of the Operational Risk Management Framework (ORMF) and related frameworks, policies, and procedures. \nAssist the Senior Manager: Operational Risk in the identification, assessment, responses, and monitoring of Operational Risk in the PIC \nCoordinate the risk analysis activities of the PIC Business Units, including both listed and unlisted investments. \nWork with Compliance, Internal & External Audit functions and other Assurance Providers to direct their efforts towards reviewing controls that mitigate the identified risks across the organization. \nSupport the process of identifying and reporting risk incidents and assist in the design of risk mitigation and control procedures within PIC. \nSupport process of identifying and reporting issues and actions within PIC. \nConduct control environment assessments for the organization. \nConduct, implement and assess key risk indicators. \nAssist the ORM Department with reporting to various governance structures \n \nCompetencies and skills: \nProblem-solving skills. \nAttention to detail. \nGood communication skills both verbal and written. \nKnowledge of compliance, risk, and financial management. \nKnowledge of financial markets - capital, money, equity, foreign exchange, and financial derivatives. \nKnowledge of insurance coverage, and industry standards. \nKnowledge of the ISO 31000 standards, Basel Operational Risk principles, COSO risk governance principles, and corporate governance principles e.g., King IV. \nKnowledge of (ORX) Operational Risk Reporting Standards. \nKnowledge of enterprise risk management principles. \n \n \nOur firm values diversity, and excellence and is committed to the realisation of these across all operations and investment activities. If you are dynamic, resilient, agile, disciplined and willing to be part of a team that is focused on creating meaningful change, you are welcome to submit your application for this position.\n \nClosing Date: 2 September 2024\n \n* Grade Range: The grade range for this position is from D1 – D4 , commensurate with applicable  minimum requirements. \n \nThe PIC is an equal opportunities employer, aligning appointments with the PIC Employment  Equity plan. \n \nPlease forward a copy of your comprehensive curriculum vitae to: Recruitment4@pic.gov.za  \n \nPrivacy Notice: By submitting your application, you consent to the PIC processing your personal information as per applicable laws and the PIC Privacy Policy available on the PIC website (www.pic.gov.za). You are free to withdraw your consent at any time, after which, the PIC may cease processing your application.\n \n \n \n \n ",
                "We are currently seeking applications from dynamic individuals for the following position: \n \nQUANTITATIVE ANALYST\n• *Job Grade: C3 – D3 \n• Ref:QA001 \nSalary: All-inclusive remuneration package negotiable \nCentre: Research and Innovation division \n \nPurpose of the role: As part of the Research and Innovation team the candidate will undertake quantitative models and provide information and investment ideas to the Quantitative Specialist and other Investment Teams.\n \nRequirements:\nBachelor’s degree with a specialisation in quantitative discipline \nAt least 3- 5 years’ experience in researching quantitative methods in investments. \nStatistical and mathematical skills applied within the asset management industry. \nInquisitive nature, driven to excel in all aspects of the analytical process and in programming – primarily using R, PowerBI, Python, etc. \nData and predictive analytics capabilities and use of Artificial Intelligence (AI) & Machine Learning (ML) in the investment environment. \n \nDuties:\nManage systems to ensure asset allocation decisions for PIC to optimize its dual mandate for financial and developmental returns. \nSupport Quantitative Specialists through research to ensure sector investment models are optimised. \nImprove quantitative models that help to support PIC investment objectives. \nImplementation of models to measure the impact of the investable ideas generated by the division \nData mining, scrubbing, cleaning, mapping and analysis using PowerBI, Python and R skills. \nResearch the latest model-building methodologies and ensure implementation within the business. \nAssist in building the data science capabilities of the business. Data analytics to support business needs. \nAd-hoc analytics/data science projects as required by business. \nRemain relevant to the needs of the PIC to ensure leading investment practices in SA and African opportunities. \n \nCompetencies and skills: \nFinancial analysis and interpretation \nMaintain, develop and update fundamental models \nPresentation skills \nCommunication skills \nAnalytical skills \nNumerical skills \nMust possess the desire and ability to work in a collaborative and intensive team-orientated environment \nMust possess the desire and ability to work in a collaborative and team-orientated environment \nFlexible, responsive, working with a minimum amount of supervision and/or self-starting personality \nAttention to detail. \nOpen-minded thought process and intellectual honesty \n \n \nOur firm values diversity, and excellence and is committed to the realisation of these across all operations and investment activities. If you are dynamic, resilient, agile, disciplined and willing to be part of a team that is focused on creating meaningful change, you are welcome to submit your application for this position. \n \nClosing Date: 30 August 2024 \n \n* Grade Range: The grade range for this position is from C3 - D3, commensurate with applicable minimum requirements. \n \nThe PIC is an equal opportunities employer, aligning appointments with the PIC Employment  Equity plan. \n \nPlease forward a copy of your comprehensive curriculum vitae to: Recruitment4@pic.gov.za\n \nPrivacy Notice: By submitting your application, you consent to the PIC processing your personal information as per applicable laws and the PIC Privacy Policy available on the PIC website (www.pic.gov.za). You are free to withdraw your consent at any time, after which, the PIC may cease processing your application.",
                "We are currently seeking applications from dynamic individuals for the following position: \n \nDEVELOPMENT MANAGER\n- Fixed Term Contract (12 months) \n• *Job Grade: D1 – D5 \n• Ref: DEV 001 \nSalary: All-inclusive remuneration package negotiable \nCentre: PIC Properties \n \nPurpose of the role: The Development Manager manages specific developments from inception to the delivery of a completed Asset. One of the key focus areas of this role is to ensure innovations in terms of resource efficiency, sustainability and green developments. This role plays an integral part in the project management execution of new development opportunities as well as the upgrading of the PIC’s investment property assets. \n \nRequirements:\nRelevant Hons equivalent degree in Business, Built Environment or Property related field\nMinimum 5 - 7 years’ relevant experience within the Property Industry \nFAIS RE 05 Certificate or must be obtained within 6 months of employment \nTechnical Knowledge in Asset Management \nStrong market research capability \nProven understanding of financial models and cost management \n \nDuties:\nCreate and manage development opportunities from inception to delivery \nConduct market research and gather market intelligence on the local Property Market and all development activity. \nInvestigate project desirability in line with Company Strategy and market conditions by generative feasibilities. \nManage developments on existing land in line with associated rights. \nOptimise and approve building design and ensure sustainability of investments, in line with Town Planning principles. \nManage and monitor actual developments versus projects approved by the Investment Committees in terms of design, cost, budget and timeline. \nManage the delivery of all development projects and present feedback to the National Development Manager and Investment Committees in collaboration with the appointed Professional teams. \n \nManage the financial aspects of all development projects including financial modelling\nMonitor spend per project and provide feedback to the Investment Committee. \nCo-create and present monthly budgets to the National Development Manager for all development purposes and monitor actual spend versus budget. \nMonitor profitability per development. \n \nEnsure adherence to legal and regulatory requirements in terms of documentation and contracts \nEnsure the drafting and signing of all necessary contracts in collaboration with the Legal Department. \n \nBuild and maintain strategic business relationships \nManage developers and consultants, working on the PIC projects on behalf of the PIC or Joint Venture developments to achieve completion within agreed timelines. \nBuild and maintain relationships within the Property and Development industry, Joint Venture partners, Local Authorities and other business stakeholders to grow and develop a strong business network. \n \nIdentifies and manages business risk \nControl, manage and govern the processes and systems within the area of accountability to ensure compliance and minimise the business risk. \nImplement all audit recommendations in the area of accountability and resolve audit findings timeously \nEnsure compliance to all health and safety regulations by PIC staff and contractors \n \nReports on all activities and latest trends \nProduce project status and financial reports for review by the National Development Manager \n \nParticipate in training and development initiatives in line with personal development plans\nIdentify training/development needs and proactively select effective solutions to address development gaps. \nEnsure that a personal development plan is developed and implemented. \nDemonstrate the company values and habits \n \nCompetencies and skills: \nExcellent communication skills \nNegotiation Skills \nOrganisational Leadership skills \nTime management \nPerformance and result-oriented \nAbility to deal with pressure/stress \nCost-consciousness (budgeting) \nStay abreast of the latest property trends \nStay abreast of the latest property law \nProblem-solving\nCustomer service orientated \nAnalytical thinker \nInitiating action \n \n \nOur firm values diversity, and excellence and is committed to the realisation of these across all operations and investment activities. If you are dynamic, resilient, agile, disciplined and willing to be part of a team that is focused on creating meaningful change, you are welcome to submit your application for this position. \n \nClosing Date: 28 August 2024 \n \n* Grade Range: The grade range for this position is from D1 – D5, commensurate with applicable minimum requirements. \n \nThe PIC is an equal opportunities employer, aligning appointments with the PIC Employment Equity plan. \n \nPlease forward a copy of your comprehensive curriculum vitae to: Recruitment4@pic.gov.za\n \nPrivacy Notice: By submitting your application, you consent to the PIC processing your personal information as per applicable laws and the PIC Privacy Policy available on the PIC website (www.pic.gov.za). You are free to withdraw your consent at any time, after which, the PIC may cease processing your application."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p2dae1961-610a-42e8-b982-1b67e379e5ed"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sabc_orig.jpg",
            "href": "https://www.govpage.co.za/south-african-broadcasting-corporation-sabc-vacancies-blog/south-african-broadcasting-corporation-sabc-vacancies7767049",
            "title": "SOUTH AFRICAN BROADCASTING CORPORATION (SABC) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN BROADCASTING CORPORATION (SABC)\n ",
                " \n \nDIGITAL MEDIA & OTT MANAGER (JOHANNESBURG)\nDIVISION: SABC NEWS & CURRENT AFFAIRS\nPOSITION ID: 60019498\nSCALE CODE: 300\nREPORTING LINE: DIGITAL NEWS EDITOR\n \nCLOSING DATE: 25 August 2024\n \nMAIN PURPOSE OF POSITION:\nTo develop, implement and facilitate SABC News and Current Affairs’ digital media and over-the-top (OTT) operations in line with the SABC and division’s strategies.\n \nKEY ACCOUNTABILITIES:\nDevelop, facilitate, execute and implement SABC News and Current Affairs’ digital media and OTT strategy and operations, including live streaming, in accordance with the public broadcaster’s corporate plans\nDevelop and implement innovative and compelling solutions for SABC News and Current Affairs\nPrepare and manage the integration of SABC News’ radio, television, digital and other content on the OTT platform\nDevelop an OTT operational plan through coordination and liaison with various internal and external stakeholders\nManage the backend and operational development aspects of SABC News’ platforms, such as its website\nDesign and communicate concise OTT operational plans and special projects involving News and Current Affairs’ digital media\nPerform and provide oversight of SABC News’ technological and technical operations\nRepresent SABC News and Digital News at all relevant forums in the implementation of its OTT content strategy\nResearch and develop monetisation strategies for News and Current Affairs’ OTT offering, while preserving the current digital media revenue streams to safeguard and promote financial sustainability\nPerform quality control / assurance of all SABC News and Current Affairs multimedia content with the editorial team\nManage content displays and updates editorially\nProvide ease of access to key content offerings, such as public service news and information, on OTT platforms\nCompile and process relevant operational business requirement documents, Service Level Agreements, as well as those for the procurement of essential digital media services in strict compliance with business reporting cycles\nDevelop and implement Standard Operating Procedures (SOPs) for SABC News and Current Affairs’ digital media and OTT operations\nManage operational risks to protect organisational integrity, create value, prevent monetary loss and ensure compliance with applicable legislation, regulations and policies\nContribute to the compilation and management of the budget cost effectively\nAdhere to South Africa’s constitution, all broadcasting, publishing and other legislation, ICASA’s license conditions, regulations, and rulings, the Film and Publications Act, the BCCSA and Press Council codes of conduct and recommendations, the SABC Editorial Policies and SABC News and Current Affairs’ style-guide etc.\n \nREQUIREMENTS:\nBachelor’s degree in media studies, Journalism or relevant equivalent qualification (NQF6), but a post-graduate qualification (NQF7) would be advantageous\n6 years’ experience in digital media and / or information technology, of which 2 years should be at supervisory level\nPractical experience in multimedia editing, publishing processes and Content Management Systems\nUnderstanding quality control / assurance standards in broadcasting and online publishing\nPractical understanding of metadata and related processes\nExperience in preparing content for digital media platforms, including live streaming and social media\nProfessional understanding of global digital media trends\nExperience in OTT content preparation i.e. Video on Demand (VOD), podcasting and social media\nMedia content scheduling and practical understanding of Electronic Programming Guides (EPG)\nUnderstanding of digital content monetisation and ability to identify monetisation opportunities on all digital platforms\nAbility to develop and present strategies for all digital platforms\nProject management experience\nUnderstanding of the role of OTT in the digital environment nationally and internationally\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "HEAD: GOVERNANCE, RISK & COMPLIANCE\nReporting line: Executive: Legal, Governance & Regulatory\nDivision: Legal, Governance & Regulatory\nScale Code: 125\nPosition ID: 60017534\n \nCLOSING DATE:25 AUGUST 2024\n \nReporting to Group Executive: Legal, Governance & Regulatory: the incumbent provides strategic leadership to the Governance, Risk and Compliance Department to support the SABC in implementing and performing ongoing maintenance of the governance, risk management and compliance frameworks by leveraging people, processes and technology transformation opportunities.\n \nDUTIES AND RESPONSIBILITIES:\n \n1. DEVELOPMENT AND IMPLEMENTATION OF STRATEGY\nDevelop an Annual Operational plan for Governance, Risk and Compliance for the Department\nDevelop and design Business Continuity Management Strategy\n \n2. BUSINESS OPERATIONAL EFFICIENCY\nDevelop and implement an Enterprise-Wide Risk Management Policy, Framework and Strategy for the SABC\nDevelop and Implement Enterprise Wide Risk Management Maturity Framework and Risk Appetite and Tolerance Framework.\nImplement relevant programs to manage mitigation plans related to identified risks\nImplement a programme to review the risk plan of the SABC at least annually at a Strategic, Operational, Project  and Functional levels\nCommunicate and create awareness of the Enterprise Risk Management Policy, Framework and Strategy and risk management process at all levels within the Corporation.\nManage the facilitation of and the setting of risk tolerances and guide Board.\nDevelop an Internal Control Framework to ensure improvement in the SABC internal control environment.\nEnsure and facilitate BCM response during business interruption incidents\nDevelop and continuously review risk based Business Continuity Plans\nReview Delegation of Authority Framework\nEnsure effective and efficient  Policy management within the Corporation\nEnsure adherence to good corporate governance practices within the Corporation\n \n3. GOVERNANCE, RISK AND COMPLIANCE\nEstablishes and manage the Governance Framework.\nFacilitate the implementation of appropriate compliance processes and practices to ensure compliance obligations are well understood across the company, embedded into the business processes, monitored appropriately and subject to review at least annually.\nOversee the development and implement of Governance, Risk and Compliance policies and Internal Control measures.\nEnsure regulatory compliance with the policies and regulatory framework\nReport timeously to the Executive: Legal, Governance and Regulatory on all compliance and risk related incidents and perform trending analysis\nReview and implement Risk Management Plan in line with organizational  Risk Framework (COSO Model or ISO31000): \nGovernance and Strategy\nRisk Mitigation Plan\nFormulate Internal Control\nCommunications\nMonitor and Evaluations\nAddress both internal and external audit findings\n \n4. STAKEHOLDER MANAGEMENT\nChampion the business partner relationship constantly seeking out ways of adding further value to the business through collaboration, coaching, education and appreciation of the business priorities.\nCreating value in each customer interaction and focusing on the total customer experience.\nExplore and make recommendations on current  operational processes to the Audit, Risk Committee to streamline and improve it for better efficiency and effectiveness\n \n5. LEADERSHIP AND PEOPLE MANAGEMENT\nEffective implementation of Performance Management System in accordance with organizational policy and procedures.\nEnsure adequate staffing for workload, succession planning and effective leadership.\nEffective briefing and communication with department staff.\nCareer Development Plans (CDP) for all staff members.\nProvide direction on the retention and attraction of staff.\n \n \nINHERENT/MINIMUM REQUIREMENTS\n \nQUALIFICATIONS\nBachelor Degree (NQF 7) in Law, Risk Management, Auditing, Financial Management or related field\nPost-Graduate qualification in the relevant fields of study will be an added advantage\n \nEXPERIENCE\nMinimum 10 years in the legal, risk management, assurance programs within a huge organizations, of which 5 years’ experience must be at middle managerial level\n \nKNOWLEDGE\nAdvanced knowledge of corporate governance and compliance\nEnterprise wide Risk Management processes\nSound understanding of  South Africa’s legislative framework\nStrategic planning and design of Governance, Risk and Compliance Management\nInspirational Leadership\n \nPLEASE APPLY HERE",
                "SCM VALUE DELIVERY AND INTELLIGENCE SPECIALIST\nReporting line: Head: Supply Chain Management\nDivision: Group Finance\nScale Code: 300\nPosition ID: 60023075\n \nClosing Date: 22 August 2024\n \nPURPOSE\nTo deliver SCM continuous value delivery  and intelligence by driving collaboration and alignment across the entire supply value chain by establishing business intelligence , project management oversight , knowledge management , reporting and monitoring efficiencies.\n \nDUTIES AND RESPONSIBILITIES:\n \n1. OPERATIONAL PLAN\nDrive SAP optimisation , integration and efficiency models and tools\nDevelop and implement innovative SCM integration and knowledge management tools\nDrives the administration of process integration to drive team efficiency and improve productivity\nResearch and implement ongoing business and process improvements\nDrives research based contribution to the SCM demand and contract management framework\nMonitors SCM risks , opportunities, disruptions and innovations in the external environment and makes recommendations on value delivery measures.\nProvides business intelligence on procurement spend transparency and reporting\nSupport Category Management with category strategies conceptualization\nProvide effective and efficient project management tools from conceptualization to post implementation\nTrain and mentor SCM on project management\nReport and monitor detailed project plans, ensuring on time project delivery and procurement costs management against project plans\nManage and reports on the SCM digital transformation strategy Maintain and manage projects in line with the Annual Procurement Plan\nCompile accurate and comprehensive monthly performance statistics.\n \n2. FINANCIAL MANAGEMENT\nDrive the  implementation of the digital transformation project for the Supply Chain M\nStreamline processes and reduce Procurement costs\nMonitors, audits and report on SCM savings on procurement activities\nMonitor and track Procurement spend\n \n3. GOVERNANCE, RISK AND COMPLIANCE\nEnsure Compliance with all SCM Policies and Procedures, and all applicable regulations and Acts such as PPPFA, PFMA, BBBEE, and National Treasury instruction notes etc.\nAudit integrity of SCM operational performance\n \n4. TRANSFER OF SKILL\nAssist SCM Practitioners to develop project management skills\nTraining/educating and awareness around project management skills\nTraining and educating on Technology usage and optimisation\nManage innovative Business and SCM integration measures and plans in ensuring optimisation , accuracy and completeness in reporting\nAssist the SCM Category Management with industry research for improved spend management\n \n5. STAKEHOLDER MANAGEMENT\nMonitor and maintain relationship with internal and external Stake holders\n   Work closely with all SCM units  (Managers and Practitioners) to ensure and continuous integration and optimisation efforts\n \nINHERENT/MINIMUM REQUIREMENTS\nExperience in Supply Chain Management industry\nStrong in management reporting, business intelligence management and statistical analyses.\nStrong Technology skills\n \nQUALIFICATIONS\nRelevant degree in Finance / Engineering\nPost graduate degree in Finance / Engineering or equivalent\n \nEXPERIENCE\n3 years’ working experience in Supply Chain Management, Manufacturing , System Engineering \n \nKNOWLEDGE\nAdvanced knowledge and understanding of Project Management\nKnowledge of system engineering and optimization models\nProficient with different technology platforms\nKnowledge of PFMA, Treasury Regulations and other relevant SCM prescripts and Instruction Notes\nUnderstanding of SCM process and bid committee system\nGood understanding of contracts and contract administration systems\nKnowledge & understanding of  various ERP\nExposure of Stakeholder Management and interaction at a senior levels\nPresentation and strong communication skills\nStrong customer relationship\nProven knowledge in simplifying and resolving complex business challenges\nCritical thinker\nSolutions driven\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p7c528e28-71a0-48c0-bf2e-6e4cffb0c336"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/samsa_orig.png",
            "href": "https://www.govpage.co.za/south-african-maritime-safety-authority-samsa-vacancies-blog/south-african-maritime-safety-authority-samsa-vacancies7603633",
            "title": "SOUTH AFRICAN MARITIME SAFETY AUTHORITY (SAMSA) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN MARITIME SAFETY AUTHORITY (SAMSA)\n ",
                "The position reports to the Registrar of Seafarers.\n \nLOCATION: HEAD OFFICE, PRETORIA\n \nJOB PURPOSE\nTo support the Registrar in maintaining the register or registers of all certificates of competency, certificates of proficiency, certificates if equivalency and endorsements specified in STCW/F Convention, Regulations 3 and II/1 to II/6, IV/2 and Merchant Shipping (Certification, Training and Manning) Regulations 2021 and the Merchant shipping (National Small Vessel Safety) Regulations of 2007, as amended, Seafarer's identity Documents Convention (Revised) 2003 (No.185).\n \nKEY PERFORMANCE AREAS\nTo assist the Registrar with certificates of competency, proficiency, endorsements, certificates of equivalency and ensure that they are issued in accordance with the Act and reflect the competencies of the seafarers.\nEnsure that Registers are secured, backed-up and updated continually.\nAdvice and assist with Investigation of fraudulent certificates of competency, proficiency, and endorsements.\nAdvise and assists the Registrar on matters dealing with changes and improvements in operating procedures, in corrective or preventive action. Coordinate the implementation of operation changes and procedures.\nEnsure that the services provided conform to the written operation procedures.\nDevelops and recommends operating/administrative/procedural changes.\nAssist in the formulation and implementation of departmental policies, practices and programs coordination and make recommendations to increase effectiveness and efficiency within the department.\nEnsure that all findings related to any Audit is properly and timeously closed out and identify the root causes of any findings to prevent any reoccurrence.\nCoordinate the work activities of any assigned employees, prioritizes and coordinates work assignments, reviews for accuracy and recommends improvements in workflow, procedures.\nAssist in the formulation and implementation of departmental policies, practices and programs coordination and make recommendations to increase effectiveness and efficiency within the department.\nEnsure that all findings related to any Audit is properly and timeously closed out and identify the root causes of any findings to prevent any reoccurrence.\nCoordinate the work activities of any assigned employees, prioritizes and coordinates work assignments, reviews for accuracy and recommends improvements in workflow, procedures.\nManage the Registry team on day-to-day, creating succession to key roles and enhancing departmental capability.\nLead the development of internal training and development programs.\nCultivate productive working relationships through the promotion of cross functional collaboration and teamwork.\nProvide clear direction on shared and departmental goals, including key performance indicators - translating and prioritising each through performance management.\nResolve employee grievances within a specified timeframe.\nAddress poor behaviour through the Disciplinary and Grievance procedures with the guidance of Human Capital.\nCultivate positive behaviour in accordance with SAMSA Values.\n \nMINIMUM REQUIREMENTS\nQualifications\nDiploma/Degree in Maritime Studies\nSTCW Certificate of Competence an advantage at operational or management level.\n \nKnowledge and Experience\nPrevious supervisory experience preferably in a related field\nThree (3) years of experience at supervisory/management level\nThree (3) years' experience in the Maritime Industry and dealing with seafarer-related matters.\n \nCompetencies\nHigh levels of competence on the skills below is a requirement:\nSound knowledge of Maritime Legislations and IMO Conventions and Protocols as amended wrt seafarers and fishers.\nTechnical knowledge of the following acts and regulations:\nSAMSA Act, 1998 (Act No. 5 of 1998) as amended.\nMerchant Shipping Act, 1951 (Act No 57 of 1951) as amended.\nProtection of Personal Information Act.\nPromotion of administrative justice Act 3 of 2000.\nMerchant Shipping (Certification, Manning, and Training) Regulations 2021, as amended.\nMerchant Shipping (National Small Vessel Safety) Regulations 2007, as amended.\nMaritime Labour Convention 2006.\nSeafarer's identity Documents Convention (Revised) 2003 (No.185).\nPractical knowledge of quality assurance.\nSkilled at supervising a multidisciplinary team including standards & compliance, qualification & licensing, port regulatory & emergency response, enforcement & compliance, maritime security/safety, quality assurance and corporate service.\nWell-developed written and oral communication skills, interpersonal skills, and the ability to communicate effectively.\nPlanning and organisation skills.\nSound analytical and problem-solving skills.\nResearch skills.\nConflict management.\nComputer Literacy (MS Word, MS Excel, MS Power point, BI software).\nPractical knowledge in shipping.",
                "Should you meet the requirements as set out above, please e-mail your CV to Zanele Zwane at: recruitment@samsa.org.za\n \nAs we are committed to Employment Equity in our employment practices, it is our intention to appoint individuals with the aim of meeting our Equity objectives. Preference will be given to African Males, Indian Males and White Females to achieve the objectives of Employment Equity.\n \nCLOSING DATE: 26 AUGUST 2024\n \nPlease note: SAMSA reserves the right not to make an appointment to any advertised position. No late applications will be considered. Psychometric and other assessments may be used as part of the selection process and all shortlisted candidates will be required to be available for the tests. If you have not been contacted within 1 month of the closing date as mentioned above, kindly deem your application unsuccessful."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p73d37af6-8de6-4558-b559-1d81f08cca20"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sanparks-logo_orig.png",
            "href": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies1689438",
            "title": "SOUTH AFRICAN NATIONAL PARKS (SANPARKS) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN NATIONAL PARKS (SANPARKS)\n ",
                " \n \nGM: GOVERNANCE AND REPORTING\nApplications from suitably qualified persons are invited for the General Manager: Governance and Reporting position based in Skukuza at Kruger National Park (KNP). The position will report to the Managing Executive for Kruger National Park (KNP) and operate throughout the Park.\n \nMain Purpose of the Job\nTo lead in the delivery of the park’s key governance initiatives and provide strategic advice and support. Ensure that the Park meets all statutory and corporate governance requirements, including risk management, compliance, flow of information, and reporting.\nLocation Kruger National Park\n \nRequirements\nPostgraduate qualification in law/risk management/commerce or equivalent.\nAt least 8 years of risk and compliance management experience.\nProven experience monitoring adherence to all legislation, regulations, standards and business policies and procedures regarding Governance and Risk management.\nMembership with a Risk Management Professional body would be an advantage.\nSound experience in risk and compliance policy writing and reviews.\n \nJob-related knowledge & skills\nOrganisational policies and procedures\nImplementing business improvement initiatives\nUnderstanding of relevant legislation.\nProject management.\nSound knowledge of the application of information systems\nGovernance and risk management policies, strategies and frameworks\nOccupational Health and Safety\nStakeholder Management\nCommunication (verbal and written)\nNegotiation skills\nStrategic Capability and Leadership\nImpact and Influence\nGovernance\nRisk Management\nInternal Auditing\nFinancial Management & Reporting\nPlanning and organising\nProblem-solving\n \nResponsibilities\nFormulate and implement park strategies and plans, aligning them with corporate objectives, strategies, policies, norms, and standards.\nDevelop, implement, and maintain the park’s risk and governance management plans.\nReview the park’s risk management framework and implement and maintain a strategically focused and effective ERM system and processes aligned with and in compliance with the SANParks ERM Framework, Policy, and Strategy.\nManage, coordinate, and evaluate the improvement of governance management processes.\nMonitoring and oversight of the reporting function around APPs.\nResponsible for the METT (Management Effectiveness Tracking Tool) process and all other reporting requirements.\nDevelop and manage KNP-specific Corporate Governance Policies and Procedures, including committee terms of reference.\nDrive a culture of compliance throughout the organisation to embed this into day-to-day operations.\nAnalyse current and forthcoming regulations, proposals and legislation and provide meaningful, detailed analysis.\nEnsure implementation and provide updates on the corporate governance policy framework, which includes the delegation of Authority, Whistle-blowing Policy, Fraud Prevention Policy, Code of Conduct, and Legislative Compliance Matrix.\nAssist KNP in maintaining a conducive legislative environment aligned with relevant legal requirements and statutes to ensure the implementation of internal controls for compliance purposes.\nPrepare and execute the KNP annual internal audit and plan, including the audit log.\nMaintain and update the park register of committee members, attendance register, declaration of interest, and confidentiality agreement for all meetings.\nManage compliance with the Public Finance Management Act (PFMA) and Committee Charters regarding meetings and documentation.\nOversees overall park-wide legislative compliance requirements (PFMA, Kings IV, etc.) and reports on compliance /non-compliance to the committee.\nOversee all information and records management within KNP – Business information.\nDevelop inter-programme SLAs and provide oversight on the SLA management.\nResponsible for the administration function of all MANCO meetings.\nProvide employee training on compliance and risk-related topics, policies, or procedures. Advance understanding of risk and improve the maturity of risk management in the park.\nOversee the Land & commercial legal function.\nManage legal, compliance, and business risks, reducing the overall risks within the corporation.\nProvide oversight over the OHS function in the park.\nResponsible for financial administration, oversight, and evaluation of KNP’s Budget.\nCreate a high-performance culture and manage team performance effectively by translating and communicating the annual performance goals and measures into individual work plans based on agreed-upon objectives.\nEnsures employees are appropriately recruited, selected, appraised, and rewarded.\nDevelop and drive a mentorship and succession programme aligned with the organisation’s values.\n \n \nPlease Note\nAn appointment will be made using SANParks’ Eemployment Equity plan.\nSalary R936,559.67 – R1,448,589.88\nPaterson Grade E\n \nHow To Apply\nInterested candidates who meet the above requirements should forward their applications accompanied by the required documentation listed below to the following:\nSimon Marutha\nHuman Capital Management\nEmail: Jobapplications3@sanparks.org\nPostal Address: Prívate Bag X402, Skukuza, 1350\n \nDocuments Required\nInterested persons who meet the above-stated requirements should forward their application letters, detailed Curriculum Vitae and qualifications.\nApplicants possess foreign qualifications to submit evaluated results by the South African Qualification Authority.\n \nClosing Date 02 September 2024\n \n \n \n \n ",
                " \n \n \n \n \n \nOFFICER: PAYROLL\nThe Organisation requires the services of an Officer: Payroll in the Human Capital Management department. This position will be based at Groenkloof National Park, Pretoria.\nLocation Groenkloof National Park (Head Office)\n \nRequirements\nHave a Diploma in Human Resource Management / Payroll.\nHave relevant experience in HR Administration and payroll systems.\nMinimum of 2 – 5 years experience working within the payroll environment.\nProficient with payroll software specifically Sage 300 people.\nKnowledge of payroll regulations/processes.\nPay attention to detail.\nAbility to handle confidential information.\nThorough understanding of payroll-related labour and tax laws.\nTime management skills\nPlanning and organising\nConflict management\nPresentation skills\nIntermediate knowledge of Excel\nListening skills\nAbility to prioritise own workload and work to tight deadlines\nHigh level of accuracy and attention to detail\nMaking rule-based and analytical decision\n \nResponsibilities\nReview information on the payroll system to ensure all information is accurate and up to date.\nEnsure employees are linked to the correct primary positions and hierarchy structure.\nMaintain employee records and ensure that they are correctly filed.\nEnsure terminated employee files are kept in accordance with record-keeping policies and procedures.\nClose payroll off on time with 100% correct data.\nHandle all payroll queries.\nQuality assuring the work of HCM clerks.\nProcess all payroll input for earnings, deductions, company contributions, and fringe benefits exactly as per the instruction document.\nRun payroll checks and balances before administration/ supervisors check the payroll. Ensure that payroll deadlines are met on a monthly basis.\nImport\\generate reports on overtime worked and other allowances as per payroll instructions submitted.\nQuality assurance information is captured by HCM Clerks where applicable.\nAssist with the distribution of variance reports and other reports required by line management/supervisors.\nProcessing of school fees and hostel claims.\nProcess all miscellaneous input for deductions and external stakeholders such as garnishees, insurances and other stakeholders in accordance with policies and procedures including statutory requirements.\nLink new employees to ESS and correct leave setup.\nCompiling summaries of earnings, taxes, deductions, leave, disability, and non-taxable wages and reporting on this.\nTrack employee working hours.\nLink new employees to ESS and correct leave setup.\nWork closely with the benefits unit to ensure monthly changes are done correctly and each change is accompanied by an instruction document.\nAssist with processing of employee transfers/promotions within the organisation and transfer of leave policy setup and hierarchy setup to the new entity.\nRespond to queries relating to payroll activities on an ongoing basis.\nStay up to date with any labour or legislative changes.\nPart and distribute payslips and IRP5s for employees in Paterson A-C band for employees with no access to Sage 300 people.\nPrepare compensation checks, and respond to employee questions about wages and deductions.\nStay up to date with any labour or legislation changes.\nPartake in the training initiatives.\nEnsure the Bi-Annual review process is completed and signed off with the supervisor\nAssist with audit-related queries and ensure compliance at all times.\nAssist with providing support to the HCM Clerks with payroll-related functions.\nProcess payment for long services awards.\n \n \nSalary R279,174.17- R455,991.11\n \nHow To Apply\nInterested candidates who meet the above requirements should forward their applications accompanied by the required documentation listed below to the following:\nHuman Capital Management\nEmail: Nomawethu.Dudumashe@sanparks.org\nPostal Address: PO Box 787 Pretoria 0001\nDocuments Required\nInterested persons who meet the above-stated qualifications should forward their applications which should consist of a cover letter, detailed Curriculum Vitae, certified copies of qualification(s), and Identity Document (certified within the past 3 months).\nApplicants in possession of foreign qualifications are to submit evaluated results by the South Arican Qualification Authority.\n \nClosing Date 30 August 2024\n \n \n \n \n \n ",
                "MANAGER: LAND AFFAIRS\nThe organisation requires the services of a Manager: Land Affairs in the Legal Services’ Department. This position will be based in Phalaborwa for assistance with land matters within the Kruger National Park (KNP) and other National Parks\nLocation Kruger National Park\n \nRequirements\nBe in possession of an LLB (Bachelor of Law) degree with commercial and property law.\nShould have 4 – 6 years of legal advisor experience.\nHave 1 -3 years of practicing as conveyancer.\nHave commercial and property law experience.\nUnderstanding of commercial and contract law.\nKnowledge of organizational policies and procedures.\nKnowledge of the environmental law and administrative law.\nAdvanced knowledge of property law.\nInterpretation of statutes.\nKnowledge of business objectives and strategies.\nGood writing and drafting skills.\nTime management skills.\nCommunication Skills\n \nResponsibilities\nDeliver an effective and efficient legal support function in respect of land and boundary matters in the KNP and other national parks when required.\nEnsure compliance to internal policies and processes.\nEnsure compliance to all relevant legislation.\nDraft contracts relevant to the land audit.\nDraft legal opinions.\nEstablish and manage the database pertaining to land owned and managed by SANParks in respect of the KNP and other national parks.\nBuild and maintain purposeful stakeholder relationships (internal and external).\nProvide legal support regarding the KNP land inclusion, cooperative and contractual management agreement protocols as well as land/property matters in general.\nInitiate declaration and withdrawal of declaration processes, as well as attend to legal matters arising from KNP boundary determination.\nCreate and maintain a culture of good corporate governance and proactive project and financial management.\n \n \nSalary R641 921.99 – R1 052 446.50\n \nHow To Apply\nInterested candidates who meet the above requirements should forward their applications accompanied by the required documentation listed below to the following:\nNomawethu Dudumashe\nHCM\nEmail: Nomawethu.Dudumashe@sanparks.org\nPostal Address: PO Box 787 PRETORIA 0001\n \nDocuments Required\nInterested persons who meet the above -stated qualifications should forward their applications which should consist of a cover letter , detailed  Curriculum Vitae, certified copies of qualification(s),and Identity Document ( certified within the past 3 months )\n \nClosing Date 28 August 2024",
                "HUMAN CAPITAL MANAGEMENT OFFICER\nThe Organisation requires the services of a Human Capital Management Officer in the Performance Management Unit. This position will be based at Groenkloof National Park, Pretoria.\nLocation Groenkloof National Park (Head Office)\n \nRequirements\nBe in possession of a National Diploma in Human Resource Management / Equivalent qualification.\nHave 2 – 4 years’ experience in a similar role.\nHave 2 years in a clerical role.\nExperience working in the Conservation, Tourism, and hospitality industry will be an advantage.\nKnowledge of the latest legislation, i.e., BCEA, EE, LRA, Skills Development Act, etc.\nHCM policies and procedures\nFinancial principles.\nAdministration management and HR best practices.\nKnowledge of the HCM systems.\nComputer literacy.\nCommunication skills (verbal and written).\nPresentation skills.\nInterpersonal skills.\nProblem Solving skills.\nConflict resolution and dispute management\nInterviewing skills.\nAdministrative skills.\nData management.\nStakeholder management.\nRecruitment and selection.\n \nResponsibilities\nSupport the implementation of HCM policies, procedures, initiatives, and systems.\nEnsure integrity of employee data on SAGE 300, People Management Module, and ensure that information is captured correctly.\nUpdate structures, establishment table, and vacancy list in your area of responsibility.\nEnsures that HCM systems, policies and procedures are adhered to, by providing guidance and support to employees and line managers.\nAssist in fielding queries and complaints to ensure client satisfaction.\nAdminister the maintenance of HCM records, including amendments to biographical information, transfers, promotions, and salary/benefits adjustments.\nProvide employees with information on various medical aid schemes and options as well as the Pension and Provident funds.\nProcess various withdrawal claims (dismissal, retirements, resignations, UIF, and death claims).\nAssist with investigations, compiling reports, and coordinate payments of death claims.\nEnsure proper leave management.\nAssist with conducting periodic audits for the park to ensure compliance to policies and procedures.\nSupervise and ensure the development of HCM Clerks where applicable Where applicable, supervise and provide training to HR Clerks, Interns, and employees on temporary contracts. Ensure proper administration of Uniform requirements.\nAssist in processing IOD claims.\nAssist with coordination, facilitation, and implementation of Learning and Development initiatives.\nAssist with the coordination and implementation of Employee Wellness interventions and administration thereof.\nUpdate and consolidate information/data for performance management.\nAdvise employees and management where required on Labour Relations processes and procedures.\nRepresent HCM in disciplinary hearings.\nCompile & Submit Monthly, Quarterly & Annual HCM Reports.\nSupport a safe and positive work culture.\nEstablish and manage relationships with internal and external stakeholders.\nAssist with recruitment and selection processes (drafting of adverts and placement, shortlisting, Interview schedule, contacting candidates for interviews, disseminate interview packs and organise venue for interviews, verification of information for the successful candidate).\nOpen a file for new candidates and ensure that all relevant information is filed as legal and policy requirement.\nParticipate in interviews for Interns, positions in the A and C band.\nComplete onboarding of new employees on SAGE 300 Job Management Module.\nCoordinating induction sessions for new employees.\nEnsure proper administration of exits such as resignations, retirements, and dismissals.\nAssist with the coordination of information sessions.\nProcess new employees on the VIP system.\nData clean up on VIP systems.\n \n \nSalary R282 919.52 – R462 106.49\n \nHow To Apply\nInterested candidates who meet the above requirements should forward their applications accompanied by the required documentation listed below to the following:\nNomawethu Dudumashe\nHCM\nEmail: nomawethu.dudumashe@sanparks.org\nPostal Address: PO Box 787 PRETORIA 0001\n \nDocuments Required\nInterested persons who meet the above-stated qualifications should forward their applications which should consist of a cover letter, detailed Curriculum Vitae, certified copies of qualification(s), and Identity Document (certified within the past 3 months)\n \nClosing Date 28 August 2024"
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p2aa8e21e-0d14-4813-b65d-c208b44096eb"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sassa_orig.png",
            "href": "https://www.govpage.co.za/south-african-social-security-agency-sassa-vacancies-blog/south-african-social-security-agency-sassa-vacancies3023508",
            "title": "SOUTH AFRICAN SOCIAL SECURITY AGENCY (SASSA) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN SOCIAL SECURITY AGENCY (SASSA)\n \nSASSA is a dynamic organisation that provides a range of essential services to a diverse group of South Africans. With offices countrywide, our operational structures aspire to embrace all that is state-of-the-art, offices that are modern and an environment designed to stimulate the worker to achieve, enjoy, progress and prosper \n ",
                "The following positions are available in the KZN Region \n \nLOCAL OFFICE MANAGER X1 POST \nSalary : R1 003 890.00 – R1 182 534.00 p.a. inclusive of benefits \nLocation: Umzimkhulu Local Office (Ref No: G8/2024) \n \nMinimum Requirements: Candidates should hold a B degree or a 3 year tertiary qualification coupled with 1-2 years relevant management experience; Knowledge of SASSA's Constitutional mandate and relevant policies, legislation and its relationship with National and other stakeholders; Knowledge of Social Security and poverty alleviation matters including sound understanding of the demographics of the District; Computer literacy and a valid driver’s licence are essential. \n \nThe incumbent will take responsibility for the overall management of all resources attached to the Division; Manage and monitor implementation of grants administration policies and legislation; Monitor promotion of access to social security services; Manage and monitor data integrity improvement programme, pay point development; Manage performance of the unit and provide general operational support; Provide operational support and guidance to the District Senior Manager and Local Office Managers within the District; Co-ordinate both generic and functional training within the District; Manage financial, human capital and other resources assigned to the unit; Manage the performance and development of staff under his/her immediate supervision; Implement service delivery and client relations improvement models will be a further responsibility. \n \nThe applications for the above position must be sent to NNMKZNApplication@sassa.gov.za or hand delivered at No.1 Bank Street, Pietermaritzburg, 3201. Attention: Human Capital Management. \n \n \n \n \n \n \nADMINISTRATIVE OFFICER X1 POST \nSalary : R308 154.00 – R362 994.00 p.a. exclusive of benefits \nLocation: Umlazi Local Office (Ref No.G9/2024) \n \nMinimum Requirements: Candidates should hold a Senior Certificate plus an undergraduate qualification (NQF level 6) or NQF level 7 with 3 years relevant experience. Computer literacy and a valid driver’s license are essential (successful candidate will be expected to drive). \n \nThe incumbent will be responsible to monitor and ensure the maintenance of log books of pool vehicles; ensure the implementation and maintenance of appropriate registers; monitor the implementation and maintenance of database assets. Ensure the local office staff comply with HR policies and procedures; ensure that all HR forms and documents are correct and complete; ensure that HR request/ documents/ forms are forwarded to District office timeously; ensure the maintenance of appropriate registers. Ensure the implementation and maintenance of a filing system that is aligned to the master file plan of SASSA; represent the Local Office in various meetings, forums committees; assist with the arrangement of meetings and special events or awareness campaigns. Obtaining quotations if not available; write motivation and attach comparative schedule; obtain approval from delegated authority; ordering of items; receipts, check and book items in accordance with the delivery note. Supervision, appraisal, disciplinary; leave administration; training and development; planning and organization; guidance and monitoring. Ensure adherence to Section 57 of the Public Finance Management Act (PFMA, Chapter 6, Part 3). \n \n \n \n \n \n \nThe applications for the above position must be hand delivered at No.1 Bank Street, Pietermaritzburg, 3201. Attention: Human Capital Management. \n \nGRANTS ADMINISTRATOR X1 POST \nSalary : R216 417.00 – R254 928.00 p.a. exclusive of benefits \nLocation: Mooi River Local Office (Ref No: G10/2024). \n\n \nMinimum Requirements: Candidates should have a Senior Certificate (NQF Level 4), Computer Literacy is essential.\n \nAdded advantage: A Valid driver’s licence and / or administrative / clerical experience will be an added advantage. \n \nDuties: The incumbent will assist in the administration of Social Grants at Local Office Level; Effectively screen all grant applications; Capture applications on the system; Provide customer care; Process other grant documentation/perform other grants administration functions; Conduct quality control on grants applications and ensure adherence to Section 57 of the Public Finance Management Act (PMFA, Chapter 6, Part 3). \n \nThe applications for the above position must be hand delivered at No.1 Bank Street, Pietermaritzburg, 3201. Attention: Human Capital Management. \n \nThe Agency is an equal opportunity employer. Therefore, Preference will be given to candidates whose appointment will assist the Agency in achieving its Employment Equity targets in terms of the Agency’s Employment Equity Plan. Person with Disabilities are strongly encouraged to apply. ",
                "Important notes: \nThese positions are advertised with minimum requirements. Appointment will be subject to a compulsory pre-employment screening in the form of qualification, reference, ITC, criminal checks and compulsory competency assessment (where applicable). It is our intention to promote representivity in terms of race, gender and disability through the filling of these posts and candidates whose appointment will promote representivity will receive preference. It is the applicant’s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA) prior to the selection process. SASSA is under no obligation to fill a post after the advertisement thereof. Please note: All SASSA staff are subject to compulsory Security Vetting on appointment. Should candidates wish to apply for more than 1 post, separate application forms should be completed and sent through an email or hand deliver on or before the closing date: 30 August 2024. \nApplicants interested in applying for these posts should send their applications (CV and fully completed and signed new Z83) quoting the relevant reference number and position name as per the advert. The subject heading of the email should indicate the name of the position you are applying for. Applicants must ensure that they send their applications to a correct inbox/email indicated on the position. Applications sent to the incorrect inbox/email will not be considered. Applications should consist of a comprehensive CV (specifying all experience, duties, indicating the respective dates (MM/YY) per position, Identity Number, Race and Gender as well as indicating references with full contact details. Interviews may be conducted via a virtual medium which will be discussed with each shortlisted applicant. Kindly note that copies of qualifications, certificates, ID and driver’s license etc., should be submitted upon request. \n \nEnquiries: Ms M Mkhize (033) 846 3334. \n \nCorrespondence will only be conducted with the short- listed candidates, If you have not been contacted within 3 months after the closing date of the advertisement, please accept that your application has been unsuccessful."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p52d76726-b8b9-4aa3-92cc-2eb5ec10e069"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/saws_orig.jpg",
            "href": "https://www.govpage.co.za/south-african-weather-service-saws-vacancies-blog/south-african-weather-service-saws-vacancies6909185",
            "title": "SOUTH AFRICAN WEATHER SERVICE (SAWS) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN WEATHER SERVICE (SAWS)\nPrivate Bag X097, Pretoria, 0001 • Tel: + 27 (0) 12 367 6000 • www.weathersa.co.za • USSD: *120*7297#\n \nThe South African Weather Service (SAWS) is a Section 3(a) public entity under the Ministry of Environment, Forestry and Fisheries (DEFF) and is governed by a Board. The organisation is an authoritative voice for weather and climate related services in South Africa and is a member of the World Meteorological Organisation (WMO) to fulfil a range of international obligations of the government. South African Weather Service (SAWS) strives to be a Weather and Climate Centre of Excellence providing innovative solutions to ensure a weather-smart region, sustainable development and economic growth. \n ",
                "The South African Weather Service (SAWS) is therefore seeking to appoint an efficient and enthusiastic person to undertake the role of: \n \nSENIOR TECHNOLOGIST\nSalary: Negotiable \nCentre: Durban Weather Office \n(Ref: WS03/082024) \n \nJob summary: To manage the regional observation infrastructure performance through effective maintenance, upgrade, and calibration of Observing Networks to enable system availability and data integrity. \n \nKey Performance Areas: \nProducts, Service Delivery / Infrastructure maintenance: \nEnsure data availability from remote Observation Networks such as Automatic weather stations, RADAR, Lightning Detection Network, Automatic Rainfall stations, conforming to approved organizational targets. \nAccurately diagnoses and repairs faulty equipment to enable network availability. \nUndertakes continuous monitoring of Observing Networks and evaluate system performance. \nImplements the Inspection Programme for Observing Networks to maintain data integrity. \nLiaises with Commercial Clients on AWS installation and maintenance matters. \nIdentifies new sites in the expansion of network areas and prepares proposals for approval by Regional Manager. \nCompiles the infrastructure demand plan for the region, with support from Meteorological Technicians. \nCoordinates infrastructure replacement requests with Technical Services. \nEnsures calibration and testing of meteorological equipment as and when necessary. \nCoordinates the incoming and outgoing of meteorological equipment. \nEnsures that reactive and non-reactive maintenance is attended to within the stipulated timeframes as directed by Technical Services and the Line Manager. \n \nInnovation, Process Improvement & Revenue Generation: \nMonitors adherence to EQS processes to enable certification of equipment of Observing Networks. \nParticipates in the planning and directs the implementation of decommissioning and re-commissioning of the weather observation systems. \nProvides analysis and recommendations on asset life cycles. \nAnalyse current techniques and technologies used in the collection and processing of data to ensure the best practices are used and applied consistently across the board. \nDevelops maintenance processes for Observing Networks. \nDevelops business continuity plans to ensure availability of systems. \n \nAdministration, Governance, Risk & Compliance: \nPrepares infrastructure status reports for Regional Manager a daily basis. \nMonitors MOU with Site Owners to ensure fulfilment of contractual obligations. \nPrepares specification for procurement of technical equipment. \nProactively orders Weather observation infrastructure spares to prevent work disruptions. \nEnsure the availability of the relevant Standard Operating Procedures, and that the junior personnel are well inducted on these also have easy access to them and comply accordingly. \nEnsure Compliance with designated national and international standards. \nAnalyse and interpret regional infrastructure performance through monitoring and evaluation. Where applicable implement corrective actions. \nEnsures strict adherence to SHEQ policies and procedures. \nMonitor the Risk Register and ensure the implementation of identified risks mitigation actions. \nParticipate in various regional audits and ensure that all audit findings are addressed \nCompiles monthly, quarterly and annual status reports on Observing Networks for submission to Regional Manager. \nGive input on budget planning. \nAssist the region and SCM with sourcing of local suppliers.\n \nPeople, Culture and Values: \nPromote a culture and practices that reflect the SAWS values and manage the team’s performance. \nDevelop Capacity and capability required to sustain/ maintain observations infrastructure ion operation. \nTakes ownership of own development activities to ensure performance against agreed standards. \nContributes to team success by contribution and commitment to the team. \n \nStakeholder Management: \nCollaborate with the other regional Team in an effort to deliver the SAWS mandate. \nImplement public awareness programmes for the local communities. (Office outreach activities). \n \nMinimum Requirements and Attributes: \nBTech in Electrical/Electronic Engineering (Light Current) or equivalent. \nAt least 5 years’ experience within Electrical/Electronic Engineering or equivalent environment. \nCode EB or Code 08 (without endorsements). \nLeadership and management skills \n \n \n \nPlease Note: \n \nEnquiries for the above-mentioned positions must be directed to: Mr. Denny Maluleke, at Tel. (012) 367 6091. \n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above position and upload your (Comprehensive CV with certified copies of qualifications). \n \nClosing Date: 30 August 2024 \n \nNote: Recruitment Agency applicant submissions will not be considered \n\n \nPreference will be given to People living with disabilities in line with SAWS EE targets. This is an EE position and preference will be given to Coloured & Indian Males, Coloured and Indian Females. Correspondence will be limited to short listed candidates only. Candidates who have not been contacted within 3 months after the closing date of this advertisement, please accept that your application was unsuccessful. The organisation reserves the right not to fill this position. The South African Weather Service is an equal opportunity employer. \n \nRecord Reference HCM-ADVERT-ST08/2024",
                "SOUTH AFRICAN WEATHER SERVICE - WORK INTEGRATED LEARNING PROGRAMME 2024 \n \nWork Integrated Learning Programme: \nThe South African Weather Service (SAWS) invites applications for eighteen months (18) Work Integrated Learning Programme. \n \nWe are looking for TVET College Learners to join our Work Integrated Learning Programme in the following field: \nManagement Assistant N6 - 1 Position – Ref: GRC 2024 \nPublic Management N6 – 1 Position – Ref: COMMS 2024 \n \nApplicants must satisfy the following requirements: \nAn applicant must have just completed an N6 in the above-mentioned field of study.\nAn applicant has been unemployed for a period of less than one-year after completion of the N6. \nAn applicant will be required to submit their CVs on the SAWS recruitment portal (clearly outline ID, Address etc.) \nMust not have work experience. \n \nSuccessful candidates: \nWill be paid monthly stipend of R5500. \nWill be responsible for arranging their own accommodation and transport to the respective SAWS Centurion offices. \n \n \nPlease Note: SAWS is under no obligation to employ the learners on upon the completion of the programme. \n \nEnquiries for the above-mentioned positions must be directed to: \nMs. Nokubonga Mkhize at Tel. (012) 367 6059 \n \nFor further information regarding the Work Integrated Learning Programme send email to: (hrenquiries@weathersa.co.za)\n \nClosing Date: 22 August 2024 \n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above positions and upload your (Comprehensive CV with certified copies of qualifications). Use the abovementioned References to indicate your field of study. Due to the large number of applications, we envisage receiving, only short-listed candidates will be contacted. Should you not hear from us within 4 weeks of the closing date, please regard your application as unsuccessful."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "pd1e2f90f-2ebf-4cd2-ac5e-6cc7a4883859"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/centlec-small-cmyk-logo_orig.jpg",
            "href": "https://www.govpage.co.za/centlec-vacancies-blog/centlec-vacancies5997679",
            "title": "CENTLEC VACANCIES",
            "content": [],
            "postedDate": "20/8/2024",
            "iframe": "https://drive.google.com/file/d/14KSN4AZYz7w8fzJxE7cCQ7zkzSDPHCVS/preview",
            "uuid": "p2594ea2d-be20-4a98-9e6c-136976cd0097"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/joburg-market_orig.gif",
            "href": "https://www.govpage.co.za/joburg-market-vacancies-blog/joburg-market-vacancies6864916",
            "title": "JOBURG MARKET VACANCIES",
            "content": [],
            "postedDate": "20/8/2024",
            "iframe": "https://drive.google.com/file/d/1oNz37JSjlCZOuSHnkFd_y1ggeSlIaDN-/preview",
            "uuid": "pea3351a2-376b-4d46-8893-07d92325fd11"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/johannesburg-city-parks-and-zoo_orig.png",
            "href": "https://www.govpage.co.za/johannesburg-city-parks-vacancies-blog/johannesburg-city-parks-vacancies4580747",
            "title": "JOHANNESBURG CITY PARKS VACANCIES",
            "content": [
                " \nJOHANNESBURG CITY PARKS\n ",
                " \n \nJOB ADVERTISEMENT (INTERNAL ONLY) \n \nHEAD GARDENER X16 (PERMANENT) \nSALARY: (R17,314.77 - R23,373.84) \n \nJob purpose \nSupervise Arboriculture/Horticulture teams to ensure completion of scheduled maintenance tasks as directed by Senior Arboriculturist/ Horticulturalist according to Standard Operating Procedures. Ensure compliance with SHEQ standards in daily activities. Organize necessary machinery and tools for the team, transport them to the worksite, and supervise the execution and completion of required activities. \n \nJob Requirements \nGrade 12 or equivalent qualification \nBasic Knowledge of Landscaping/Horticulture/Arboriculture • Proven experience in transporting teams or individuals using heavy vehicles such as trucks or tractors. Knowledge of SHEQ requirements \n1 years’ experience in the supervisory level (Horticultural/ Arboriculture field)\nValid SA driver’s license Code 10 & Valid PDP. Code 14 drivers’ license - added advantage \n \nKey performance areas \nTo supervise the teams so that required activities are executed as per Standard Operating Procedures. \nCo-ordinate completion of job cards as per direction from the Senior Arboriculturist/ Horticulturalist, including scheduled maintenance and customer complaints. \nSupport the Senior Arboriculturist/ Horticulturalist with inspections. \nSupport Senior Arboriculturist/ Horticulturalist & check daily complaints & queries from all stakeholders. \nCheck equipment are in working order and transport it to the worksite \nWork cohesively with the team to ensure completion of required tasks \nReport any safety and environmental incidents on site and infrastructure issues \nReport to the Senior Arboriculturist/ Horticulturalist on team performance and job card status \nComply with SHE-Q requirements and JCPZ policies when conducting work \n \nKnowledge & Skills \nAdvanced/ Safe driving skills driving heavy vehicles i.e. truck/tractor/bus \nExcellent sense of navigation, Performance supervision & control skills \nExperience on Machine operations for horticultural/arboriculture machinery \nKnowledge and application of propagation of plants \nGood understanding of SHERQ requirements and the applications to horticulture/arboriculture \nExcellent Interpersonal Skills, Communication Skills and Teamwork \nAbility to work under pressure, Time Management, Problem solving skills, Customer service orientation & Leadership, Values, honesty and integrity, Responsible and Reliable \nProactiveness and pays attention to details, Ability to maintain confidentiality \n \n \nWorkplace: Region F \nClosing Date: 2 September 2024\nEnquiries: 0117126601/6749/6792 \nEmail only CV: talentmanagement@jhbcityparks.com\n Reference number: HG25072024 \n \nQuote the reference number on the subject; failure to adhere to the given instruction will result in disqualifying your application. Note: Johannesburg Parks and Zoo is an equal opportunity employer. If you do not receive a response from us within 21 days after the closing date of this advertisement, please accept that your application was unsuccessful.\n \n \n \n \n ",
                " \n \n \n \n \n JOB ADVERTISEMENT (INTERNAL ONLY) \n \nEPWP OFFICER (X1 PERMANENT) \nSALARY (R17 314,77 - R23 373,84 ) \n \nJOB PURPOSE \nProvide high level coordination and maintenance implementation of outsourced regional portfolio in line with standard operating procedures, policies and legislations that are in place. Efficient coordination of all outsourced work by administering and reporting on the EPWP Program requirements with guidance from the Regional Manager. \n \nMINIMUM REQUIREMENTS \nND in Horticulture or related field, OHVS certificate (to be obtained via training) \nDriver’s License, 3 Years in local government \nAdministrative and project management experience, Driver’s License \nHorticultural and Arboriculture knowledge \nAdvantageous: Understanding of project management, Public open spaces operational tactics, Knowledge of legislation relating to EPWP and related Regulations. Diploma/Certificate in project management or equivalent. Project management competency. \n \nKEY PERFORMANCE AREAS \nIdentify work that needs to be undertaken in the Region (Augmented / Regional services) in consultation with the regional management. \nHave input on the regional outsourced portfolio’s expenditure in line with the regional budget as directed by the regional manager. \nCreating project plans for regional and augmented portfolio. \nMonitoring of service providers undertaking augmented / regional work to ensure that they are working according to specification. \nCompleting all work commissioning requests \nCompleting of work completion certificate / Completing all work acceptance forms, checklist, quality assurance, and safety files (on field work). \nCompiling all evidence (report) work completed (before and after pictures) for submission. \nVerification of submitted invoice documents to ensure that they comply with all requirements. \nRecording the EPWP information for all services and EPWP Programme on available systems. Inform the Regional Manager on status & progress of the Augmented / regional services Programme and highlight changes needed. \nProvide technical advice to clients on approaching horticultural tasks. \nCompiling and sending client completion reports. \nDesign, develop, and implement systems for prioritizing, assigning, tracking, and reporting maintenance issues. \nCreate project plans for significant tasks and oversee their execution. \nMaintain accurate administration records for all maintenance-related tasks. \nMonitor compliance of SHEQ requirements \nVerify EPWP information received from Service Providers through all programs (contractors, cooperatives) \nEnsure that the required EPWP information submitted is compliant. \nEnsuring the required EPWP information is submitted with invoice (certified I.D.’s, attendance register, payment registers, employee contracts) with correct implementation dates. \nOnce received, it should be scanned, labelled, and populated on the T Drive under the EPWP folder. \nCapture EPWP employee information on the EPWP system monthly. \nRequest a monthly report from the EPWP Coordinator and verify if the information is captured correctly. \nPrepare and ensure the EPWP report and T drive information are in line for audit purposes, Oversee that EPWP Quarterly targets. \nEnsuring completed monitoring performance forms, checklist forms and job cards are attached to the invoice. \nRecording of submitted invoices to finance for tracing \n \nTo undertake site briefing sessions and project implementation. \nResponds to contractors/ other EPWP and Cooperative queries. \nAdminister the necessary support needed by SMME’s. \nEPWP officer will coordinate with relevant JCPZ user departments. \nAttend to complaints from regional clients/Community leaders and residents to ensure good customer service and feedback to clients and regional manager \nManagement of customer services with Augmented services \nLiaise with internal and external stakeholders. \n \nSkills and Knowledge: \nFinancial Acumen, Business Administration, Report writing, Skills management, \nData analysis and judgment, project management, planning & organising \nIntegrity & honesty, resilience, interpersonal skills, teamwork, creativity \nInnovation, results orientation, National EPWP policies and objectives \nDecisiveness, negotiation skills, Alignment with JCPZ values \nUnderstanding of the City’s IDP, Sector Plan and related imperatives \nJCPZ policy & procedure framework, JCPZ mandate, strategy and stakeholder analysis \n \nWorkplace: Regions \nEnquiries: 011 7126601 /6792/6668 \nReference: EPWP25072024 \nEmail CVs only: talentmanagement@jhbcityparks.com\nClosing Date: 2 September 2024 \n \nQuote the reference number on the subject; failure to adhere to the given instruction will result in disqualifying your application. \n \nNote: Johannesburg Parks and Zoo is an equal opportunity employer. If you do not receive a response from us within 21 days after the closing date of this advertisement, please accept that your application was unsuccessful.\n \n \n \n \n \n ",
                " \n \n \n \nINTERNAL AND EXTERNAL ADVERT\n \nSENIOR MANAGER FACILITIES MANAGEMENT\n(X1 PERMANENT) • (R1,285,083.21 - R1,610,793.50 P/A)\n \nJOB PURPOSE: Responsible for overall Departmental performance; provide direction and decision making in line with Corporate and Divisional Strategy. Provide efficient supportive services to the organisation through fleet and plant management; repairs and maintenance management; stores and inventory; and security services. Plan for the future of the Department; provide support and guidance to managers. Lead, direct and manage the facilities to ensure effective service delivery to customers; and to safeguard facilities and customers and a well managed and sustainable infrastructure, open spaces and facilities.\n \nKEY PERFORMANCE AREAS\nDrive strategy of the Department: Provide high level advice to the Executive on strategic planning and business opportunities, risk management and continuous quality improvement • Undertake the development, implementation, monitoring and reporting of the Departmental Plan to meet the strategic goals • Manage all governance arrangements to ensure adherence to the legislative requirements • Ensure that cohesive governance and risk management policies are in place and fully comply with all regulatory requirements • Contribute to improve operational systems, processes and policies to support management reporting, information flow and management, business processes and organisational planning • Lead the Department and oversees its functions, resources and outputs thereof.\nDirect, oversee and manage the various departmental functions: Ensure the development and implementation of sub-unit business plans • Oversee the preparation and review of plans, specification and cost estimates for assigned projects • Provide assistance and advice on specifications and maintenance manuals • Ensure quality control and safety inspections of facilities, fleet and equipment • Assist in the preparation of contracts with external service providers • Review, measure and manage project implementation • Close project off on completion in line with organisational guidelines and requirements • Manage and monitor contractual agreements between service providers and facilities management • Manage and monitor the procurement of equipment and related duties for JCPZ • Manage and monitor the budget of the department and various units • Ensure the implementation of the policy, procedures and plans for energy efficiency and waste management.\nOversee, ensure and conduct managerial responsibilities: Design overarching policies that govern the Department • Develop Departmental business plans aligned to Corporate Strategy; COJ Departments • Ensure Department is managed effectively through and performs managerial tasks for direct staff • Monitor programs efficiency; develop reporting procedures and other methods to measure success, and revise processes and procedures to improve program effectiveness • Ensure adherence to legislative and parent Department guidelines.\nOptimise individual and team performance: Performance Management • Actively participates  and manages own performance levels • Mentors and supports the learning and development of team members • Contributes to team effectiveness and team cohesion.\nManage expectations of internal and external stakeholders: Build and maintain relationships with stakeholders • Communicate appropriate information and status updates/reports to relevant stakeholders.\nDevelops/ reviews policies and adheres to SHEQ standards and security monitoring: Develop/ review SOPs for the Department • Implement and monitors JCPZ SHE and security  policies and procedures • Ensure activities are in line with the SHEQ policies and procedures of JCPZ.\nManages risk: Implement identified risk mitigation measures and ensure compliance to relevant policies and procedures.\n \nMINIMUM JOB REQUIREMENTS: Bachelor’s Degree in Engineering/ Built Environment /Fleet Management • Post Graduate qualification in Business Management (an added advantage) • Minimum of 5-8 years of experience in Facilities and Fleet Management experience • Building and Infrastructure related experience is essential • At least 2-3 years are at a Senior Management level in the public sector.\n \nCOMPETENCIES: Facilities Management expertise • Team and people management • Performance Management • Project Management • Planning and Organising • Data Analysis and Judgement • Leadership • Knowledge and Application of TQM methodologies, principles and tools • JCPZ policy and procedure framework • JCPZ mandate, strategy and stakeholder analysis • Alignment with JCPZ values • Integrity and honesty • Interpersonal Skills • Results orientation • Resilience • Creativity and Innovation • Reliability • Problem Solving.\n \n \nWorkplace: Springfield \n• Contact for Enquiries: 011 712 6601/ 6668\nEmail CVs to: talentmanagement@jhbcityparks.com\nReference: SMF17082024 \n• Closing Date: 31 August 2024\n \n“Quote the reference number on the subject; failure to adhere to the given instruction will result in disqualifying your application”\n \nNote: Johannesburg Parks and Zoo is an equal opportunity employer. If you do not receive a response from us within 21 days after the closing date of this advertisement, please accept that your application was unsuccessful.\n \n \n \n \n \n ",
                "INTERNAL AND EXTERNAL ADVERT\n \nREGIONAL MANAGER\n(X1 PERMANENT) \n• (R976,308.28 - R1,210,274.24 P/A)\n \nJOB PURPOSE: Responsible for the overall Region performance; provide direction and decision making of the Region in line with Corporate and Divisional Strategy. Lead, direct and manage the integrated service delivery plan for the regional portfolio of parks, open spaces, cemeteries, MOE, SOE, Government and CoJ Departments by developing and implementing strategies, policies, processes, procedures and in line with open spaces provisioning requirements of JCPZ, COJ and Regional priorities. Identify, build and strengthen strategic partnerships for improved service delivery and to advance environmental imperatives. Manage the allocation, utilization and optimization of scarce resources in order to achieve the overall strategic JCPZ and COJ objectives. Plan for the future of the Region; provide support and guidance to managers.\n \nKEY PERFORMANCE AREAS\nDrive strategy of the Department: Provide high level advice to the Executive on strategic planning and business opportunities, risk management and continuous quality improvement • Undertake the development, implementation, monitoring and reporting of the Departmental Plan to meet the strategic goals • Manage all governance arrangements to ensure adherence to the legislative requirements • Ensure that cohesive governance and risk management policies are in place and fully comply with all regulatory requirements • Contribute to improve operational systems, processes and policies to support management reporting, information flow and management, business processes and organisational planning • Lead the Department and oversees its functions, resources and outputs thereof.\nManage finances and budget within the region: Develop and administer the regional budget as per the published guidelines • Direct and coordinate with the Finance department to fund operations within the region • Monitor monthly variance reports and ensure effective planning, monitoring, and controlling of assets • Provide documentation and support for financial reporting requirements • Implement mitigation measures on Audit Findings.\n\nPlan, direct and oversee the operations of the region: Provide input to the development of the Service Delivery Strategy and Plan • Cascade Service Delivery targets down to develop annual regional business plans • Prepare and present medium and long term plans and forecasts for space, operational, maintenance and equipment requirements • Ensure the implementation of the latest regulations and ISOs • Develop and implement integrated service delivery plan in consultation with MOE, SOE, Government and CoJ Departments • Provide directions to Senior Arboriculturist and Senior Horticulturists with regard to annual and monthly activity plans • Monitor and review regional performance against business plans.\nOptimise individual and team performance: Performance Management • Actively participates and manages own performance levels • Mentors and supports the learning and development of team members • Delegate responsibilities to teams within the region and monitor their performance • Oversee the contracting of EPWP staff.\nManage expectations of internal and external stakeholders: Build and maintain relationships with stakeholders • Communicate appropriate information and status updates/reports to relevant stakeholders.\nDevelops/ reviews policies and adheres to SHEQ standards and security monitoring: Develop/ review SOPs for the Department • Implement and monitors JCPZ SHE and security policies and procedures • Ensure activities are in line with the SHEQ policies and procedures of JCPZ.\nManages risk: Implement identified risk mitigation measures and ensure compliance to relevant policies and procedures.\n \nMINIMUM JOB REQUIREMENTS: • National Diploma in Horticulture or related qualification • Bachelor’s Degree in Horticulture (an added advantage) • At least 8 years’ experience in the horticultural environment • Minimum 5 years’ experience in a management position within the public sector.\n \nCOMPETENCIES: Understanding of the National Environmental mandate • National, Provincial, and local authority operations • Business management principles and methodologies • Financial acumen • Performance Management • Project Management • Strategic and tactical planning • Data Analysis and Judgement • Leadership • Legislative frameworks and regulations governing open space planning and zoning • JCPZ policy and procedure framework • JCPZ mandate, strategy and stakeholder analysis • Alignment with JCPZ values • Report writing • Integrity and honesty • Interpersonal Skills • Results orientation • Resilience • Creativity and Innovation • Reliability • Decisiveness.\n \n \nWorkplace: Regions \n• Contact for Enquiries: 011 712 6601/ 6668\nEmail CVs to: talentmanagement@jhbcityparks.com\nReference: RM17082024 \n• Closing Date: 31 August 2024\n \n“Quote the reference number on the subject; failure to adhere to the given instruction will result in disqualifying your application”\n \nNote: Johannesburg Parks and Zoo is an equal opportunity employer. If you do not receive a response from us within 21 days after the closing date of this advertisement, please accept that your application was unsuccessful.",
                "INTERNAL AND EXTERNAL ADVERT\n \nMACHINE REPAIRMAN: MINOR PLANT (X9 PERMANENT) \n• (R14 116,71 - R19 056,66 P/M)\n \nJOB PURPOSE: To provide minor plant repair and maintenance services to JCPZ to ensure continuous availability of machines and support to enable the effective operations of JCPZ.\n \nKEY PERFORMANCE AREAS: • Order and receive spares from stores for repairs • Request spare parts as per Job card • Ensure no unnecessary use of spares • Log ad hoc repairs on offline job-card • Reduce maintenance which has wasteful cost implications • Collect faulty equipment from and identify mechanical faults • Repair machinery as per works instruction within daily requirement rate and within set standards and deadlines • Sign off complete job cards for work done and submit to Supervisor • Complete time sheets-daily and weekly • Ensure quality standards are maintained • Conduct proactive maintenance • Report any defects to the supervisor • Return equipment once repairs have been completed and signed off • Report any unsafe acts or accidents immediately • Conduct fields checks on vehicles and equipment; and provide reports to Lead Plant • Liaise with Stores and Supervisor to ensure that all repairs and maintenance is complete based on their requirements and specifications • Liaise with Foreman to ensure that all work is carried out according to plan and specification within the required targets • Assist Workshops Foreman with reports on the state of machines • Liaise with Workshop foreman and Maintenance Planner regarding scheduling of work outputs equipment and machinery • Implement and monitor JCPZ safety, health, environmental and security policies and procedures.\n \nMINIMUM JOB REQUIREMENTS: • Minimum GRADE 10 or NQF equivalent • Driver’s License code EB or higher (an advantage) • English Proficiency • 1-2 years’ experience in a repairs workshop environment • Competency Course (lawnmower, brush cutters) • Computer Courses, Fleet, Admin, Inventory.\n \nKNOWLEDGE AND SKILLS: • Knowledge of mechanics and machinery repairs (slashers, brush-cutters, ride-ons • Inventory Management • Knowledge and application of SHEQ standards and requirements • Plant and mechanical skills • JCPZ policy and procedure framework • JCPZ mandate, strategy and stakeholder analysis • Integrity & honesty, interpersonal skills and teamwork, innovation and creativity, resilience • Results Orientation, reliability, problem solving, Alignment with JCPZ values.\n \n \nWorkplace: Springfield\nContact for Enquiries: 011 712 6601/ 6668\nEmail CVs to: talentmanagement@jhbcityparks.com\nReference: MR25072024 \n• Closing Date: 30 August 2024\n \n“Quote the reference number on the subject; failure to adhere to the given instruction will result in disqualifying your application”\n \nNote: Johannesburg Parks and Zoo is an equal opportunity employer. If you do not receive a response from us within 21 days after the closing date of this advertisement, please accept that your application was unsuccessful.",
                "INTERNAL AND EXTERNAL ADVERT\n \nADMIN OFFICER\n(X1 PERMANENT) • (R17,314.77 TO R23,373.84 P/M)\n \nJOB PURPOSE: To give administrative and secretarial support to Manager. To assist with the collation and recording of reports and documentation. To provide office support to the office/ depot.\n \nKEY PERFORMANCE AREAS: • Welcomes and tends to visitors meeting with Manager • Organise and maintain Manager’s diary • Manage incoming calls, emails, enquiries and requests, faxes, post and often corresponding on behalf of the Manager • Execute the typing, distribution and filing of documents • Ensure timely booking of boardrooms/meeting venues to secure meeting facilities • Coordinate special activities such as interviews, workshops and other activities • Accompany the manager on official visits if required • Organise and attend meetings with Manager where necessary, taking minutes during meetings • Coordinate with stakeholders in terms of actions to be performed post-meetings • Update list of staff contact details • Arrange catering for all management functions where required • Liaise with Head Office regarding Finance, Human Capital, and Communications matters • Devise and maintain an office system which includes data management and filing • Maintain stationery stock for office; requesting additional stock as and when needed • Coordinate, monitor and direct the acquisition of supplies, telecommunication systems, office facilities, records storage and retrieval systems, and forms • Compile and update project lists • Communicate events on behalf of the Department/ Unit • Coordinate transport arrangements, visa, accommodation, tickets and any other requests for the purpose of ensuring efficient and effective execution of duties in liaison with the Travel Coordinator • Ensure the smooth functioning of the office and upholds a positive image for the Manager • Arrange/ Schedule departmental training, wellness events as directed by the Manager • Compile attendance registers, timesheets, leave requests and approvals for the region depot • Manage the depot office’s petty cash float • Monitor office administration operational expenditure • Initiate the procurement of office supplies according to the policies and procedures of JCPZ • Collate information from Managers/ Specialists within Department • Check grammar and formatting of reports ensuring consistency and attention to detail • Produce documents, brief papers, reports and presentations as directed • Maintain confidentiality of all reports and support provided to the Manager, this includes ensuring safe and secure record keeping.\n \nMINIMUM JOB REQUIREMENTS: • Matric/ Grade 12 • Diploma in Secretarial/Admin or equivalent NQF level 5 qualification • 2 - 3 years general administration experience.\n \nKNOWLEDGE & SKILLS: • Financial Acumen • Computer Literacy • Planning & Organising • Diary Management • Knowledge and application of MFMA • Report writing & Editing • Knowledge and application of administration best practices • Integrity & honesty • Interpersonal skills • Results orientation • Creativity • Innovation • Time management • JCPZ mandate, strategy and stakeholder analysis • Alignment with JCPZ values • Proficient in English • Good understanding of daily SHERQ requirements • JCPZ policy and procedure framework • Resilience.\n \n \nWorkplace: Regions \n• Contact for Enquiries: 011 712 6601/ 6668\nEmail CVs to: talentmanagement@jhbcityparks.com\nReference: AO27072024 \n• Closing Date: 30 August 2024\n \n“Quote the reference number on the subject; failure to adhere to the given instruction will result in disqualifying your application”\n \nNote: Johannesburg Parks and Zoo is an equal opportunity employer. If you do not receive a response from us within 21 days after the closing date of this advertisement, please accept that your application was unsuccessful."
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "pfb2a2e83-a629-446e-814d-ad370da476f9"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/pikitup-logo_orig.jpg",
            "href": "https://www.govpage.co.za/pikitup-vacancies-blog/pikitup-vacancies6700216",
            "title": "PIKITUP VACANCIES",
            "content": [
                " \nPIKITUP\n\nCity of Johannesburg\nPikitup Head Office, Jorissen Place, 66 Jorissen Street, Braamfontein, 2001\nPrivate Bag X74, Braamfontein, Johannesburg, 2017\nTel+27(0) 11 712 5200 - Fax +27(0) 11 712 5322\nwww.pikitup.co.za - www.joburg.org.za\n \n ",
                "COMPANY SECRETARY \nDepartment : Office of the Managing Director \nLocation : Head Office \nLevel : E1/ Task 19 \nDuration : Permanent \nReporting to : Managing Director \nReference : COSEC-02 \n \nThe purpose: \nThe purpose of this role is to ensure that Pikitup maintains excellent standards of corporate governance by acting as a point of communication between the board of directors and the company shareholders; by reporting in a timely and accurate manner on company procedures and developments; by recommending appropriate actions and policies for board consideration and making the board aware of any law relevant to or affecting the company. \n \nKey Responsibilities: \n• The role will be responsible to develop an annual working plan for the business unit in line with the overarching Business Strategy. \n• Develop Charters for Board and sub-committees. \n• Oversee PIKITUP Corporate Governance. \n• Develop the Governance Framework to plan, direct and coordinate PIKITUP’s governance activities to ensure that governance practices are consistent and aligned to applicable legislation and regulations. \n• Provide guidance and support to the PIKITUP Board, its committee(s), and the Executive Management on corporate governance. \n• Establish terms of reference for the Board inclusive of function requirements and levels of authority. \n• Develop an annual schedule of Board and respective sub-committee meetings and circulate to members. \n• Monitor the implementation of Board resolutions and legal compliance requirements to always ensure compliance and keep the Board informed on the status and progress. \n• Function as liaison between management, the Board and the City of Johannesburg (COJ). \n• Continuously facilitate the training of Board members and actively raising awareness around Corporate Social Responsibility and the Ethics Code. \n• Manage PIKITUP’s performance against Code of Conduct. Maintain the provision of input for all PIKITUP contractual negotiations. \n \nMinimum Qualifications: \n• Minimum requirements LLB degree (NQF 7). \n• Admission as Attorney or Advocate is preferable. \n• Post Graduate qualification would be an added advantage. \n• Membership with Institute for Chartered Secretaries of South Africa (now Chartered Governance Institute of Southern Africa would be an added advantage. \n \nMinimum Experience: \n• 8 years’ relevant experience in a legal management environment in a public sector/organisation of which at least 5 years on a senior managerial/strategic level. \n• Experience in corporate governance, risk management, environmental and waste management, legislative compliance and in-depth understanding of legislation governing local government. \n \nRequired Competencies: Knowledge: \n• Extensive knowledge of Corporate Governance, Company Law, Municipal Finance Management Act, Municipal Systems Act, Risk Management Framework, King IV report, National Treasury Regulations. \n• Understanding of government environment both at national, provincial, and local sphere. \n• Sound proven leadership qualities. \n \nSkills:\n• Intellectual and personal integrity. \n• Interpersonal skills and a strong drive. \n• Strong stakeholder management and communication skills. \n• Leadership. \n• Strong negotiation skills. \n• Conflict/ dispute resolution skills. \n• Demonstrates agility in challenging complex or ambiguous situations and is able to integrate material from a wide range of learning and thinking. \n• Decisive, ethical and ability to apply good judgement. \n• Strategy Development, Planning and Reporting. \n \n \nInterested applicants must complete an application form and submit a comprehensive CV together with certified copies of qualifications and identity document to recruit172024@pikitup.co.za by no later than the 30 August 2024. No late applications will be considered. Please ensure that the correct position reference number is inserted in the subject line of email. \nFor enquiries contact Shirley Tjiane – 087 357 1086 \n \n• Please quote the above position name and the reference number on all correspondence relating to this advert. \n• Pikitup reserves the right not to fill any vacancies. \n• Correspondence will only be entered into with shortlisted applicants. Should you not hear from us within six weeks after closing date of the advert please consider your application unsuccessful. \n• By submitting your application for a position at Pikitup, you are consenting that the personal information submitted as part of your application may be used for the purposes of Recruitment and Selection and related processes. \n \nPIKITUP IS AN EQUAL OPPORTUNITY EMPLOYER AND IS COMMITTED TO EMPLOYMENT EQUITY PRINCIPLES AND REDRESSING THE IMBALANCES OF THE PAST. APPLICATIONS ARE WELCOME FROM ALL DESIGNATED GROUPS (AFRICAN, COLOURED AND INDIAN MALES, ALL FEMALES & PERSONS WITH DISABILITIES).",
                " \nJOB PROFILE\n "
            ],
            "postedDate": "20/8/2024",
            "iframe": "",
            "uuid": "p252f4062-f916-4cbf-bcc0-baa710a7cd9f"
        }
    ],
    "departments": {
        "city of johannesburg vacancies": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies2982540",
        "city of ekurhuleni vacancies": "https://www.govpage.co.za/ekurhuleni-metropolitan-municipality-vacancies-blog/city-of-ekurhuleni-vacancies4415317",
        "national health laboratory services (nhls) vacancies": "https://www.govpage.co.za/national-health-laboratory-services-nhls-vacancies-blog/national-health-laboratory-services-nhls-vacancies2857639",
        "national home builders registration council (nhbrc) vacancies": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies7683357",
        "national student financial aid scheme (nsfas) vacancies": "https://www.govpage.co.za/national-student-financial-aid-scheme-nsfas-vacancies-blog/national-student-financial-aid-scheme-nsfas-vacancies3558260",
        "office of the pension funds adjudicator (opfa) vacancies": "https://www.govpage.co.za/office-of-the-pension-funds-adjudicator-opfa-vacancies/office-of-the-pension-funds-adjudicator-opfa-vacancies2538678",
        "private security industry regulatory authority (psira) vacancies": "https://www.govpage.co.za/private-security-industry-regulatory-authority-psira-vacancies-blog/private-security-industry-regulatory-authority-psira-vacancies7290277",
        "public investment corporation (pic) vacancies": "https://www.govpage.co.za/public-investment-corporation-pic-vacancies-blog/public-investment-corporation-pic-vacancies9425638",
        "south african broadcasting corporation (sabc) vacancies": "https://www.govpage.co.za/south-african-broadcasting-corporation-sabc-vacancies-blog/south-african-broadcasting-corporation-sabc-vacancies7767049",
        "south african maritime safety authority (samsa) vacancies": "https://www.govpage.co.za/south-african-maritime-safety-authority-samsa-vacancies-blog/south-african-maritime-safety-authority-samsa-vacancies7603633",
        "south african national parks (sanparks) vacancies": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies1689438",
        "south african social security agency (sassa) vacancies": "https://www.govpage.co.za/south-african-social-security-agency-sassa-vacancies-blog/south-african-social-security-agency-sassa-vacancies3023508",
        "south african weather service (saws) vacancies": "https://www.govpage.co.za/south-african-weather-service-saws-vacancies-blog/south-african-weather-service-saws-vacancies6909185",
        "centlec vacancies": "https://www.govpage.co.za/centlec-vacancies-blog/centlec-vacancies5997679",
        "joburg market vacancies": "https://www.govpage.co.za/joburg-market-vacancies-blog/joburg-market-vacancies6864916",
        "johannesburg city parks vacancies": "https://www.govpage.co.za/johannesburg-city-parks-vacancies-blog/johannesburg-city-parks-vacancies4580747",
        "pikitup vacancies": "https://www.govpage.co.za/pikitup-vacancies-blog/pikitup-vacancies6700216"
    }
}