{
    "title": "govpage-public-sector",
    "blogPosts": [
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/mpumalanga-health_orig.png",
            "href": "https://www.govpage.co.za/mpumalanga-department-of-health-vacancies-blog/mpumalanga-department-of-health-vacancies9250955",
            "title": "MPUMALANGA DEPARTMENT OF HEALTH VACANCIES",
            "content": [
                " \nMPUMALANGA DEPARTMENT OF HEALTH\n "
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "p93e56175-05fb-49ad-8474-4519775cfe09"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-ekurhuleni_orig.png",
            "href": "https://www.govpage.co.za/ekurhuleni-metropolitan-municipality-vacancies-blog/city-of-ekurhuleni-vacancies4234860",
            "title": "CITY OF EKURHULENI VACANCIES",
            "content": [
                " \nCITY OF EKURHULENI\n ",
                " \n \nINDIGENT CLERK: SOCIAL DEVELOPMENT - HESD19678\nClosing Date 2024-10-10\nDepartment Health & Social Development Department (2019)\nLocation City of Ekurhuleni\nRemuneration R 217,920.00 to R 298,932.00 - Basic salary per annum (plus benefits)\nAssignment Type Permanent\n \nMinimum Requirements:\nGrade 12 (NQF Level 5)\nCertificate in Administration/ Computer Literacy\n1 -2 years' experience in a similar environment (will be an added advantage)\n \nCore Responsibilities:\nEffectively apply data management and administrative duties.\nPerform administrative and clerical duties.\nMake sure that own work is in line with work control and safety requirements.\nDo own work well to prevent financial losses by adhering to all financial procedures in the division to promote quality service delivery.\nBe part of culture that treats people well, builds relationships and keep customers happy.\nPromoting Batho Pele principles during service delivery, one on one communication.\n \nEnquiries: Tel: 0860 54 3000\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nLIFE GUARD: SEASONAL SWIMMING POOLS - SRAC19639\nClosing Date 2024-10-14\nDepartment Sport, Recreation, Arts & Culture Department\nLocation City of Ekurhuleni\nRemuneration R 349,956.00 to R - Total cost to company\nAssignment Type Fixed Term Contract\n\nPosition: Seasonal Lifeguard (Various Areas) (Appointments will be made on a contract basis for the 2024/2025 season)\nSalary: R349 956 per Annum\n \nMinimum Requirements:\nGrade 10\nValid First Aid Level 1 Certificate\nValid Lifeguard Award\nProof of completed/passed Lifeguard Award examination, certified by Life Saving South Africa recognised Examiner\n0-1 year experience in a similar environment\n \nCore Responsibilities:\nExecute Lifesaving duties\nDaily testing and treatment of water\nOperation of filtration, chlorine gas plant, heating system and timing system\nInspection of facilities and control by visual assessment, completion of inspection control sheets.\n \nInterested candidates whose background and experience match these challenging and exciting positions are invited to apply using an online application system attached to the advertisement on the website of the City of Ekurhuleni (www.ekurhuleni.gov.za).\n \nEnquiries: Tel: 0860 54 3000; E-mail: call.centre@ekurhuleni.gov.za\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nPROJECT MANAGER - XEPRJM001\nClosing Date 2024-10-04\nDepartment Finance Department (2019)\nLocation City of Ekurhuleni\nRemuneration R 926 132.00 to R 926 132 .00 - Total cost to company\nAssignment Type Fixed Term Contract\n3-year Fixed Term Contract\n \nMinimum Requirements:\nB Degree in the Built Environment, Project Management or relevant equivalent NQF Level 7 qualification\nMinimum of 3 years' experience in an engineering consulting, construction, project management or similar environment\nPossession of a valid driver's license\nMFMA certification will be an added advantage\nMembership registration with a built environment regulatory or professional body will be an added advantage\n \nCore Responsibilities:\nProvide project management support to the Department, monitoring and reporting on implementation and progress on decisions made\nAssess the Departmental Demand Management Plans and advise on more efficient and effective approaches to ensure successful capital expenditure performance\nIdentify internal and external resources, human, financial, or otherwise required for successful completion of projects\nEnsure that SOPs, processes, procedural guides and quality service standards are developed, maintained, understood and implemented\nManage and take accountability for delivery of contracted work output within prescribed parameters of SOPs, quality standards and service targets to ensure all work is undertaken within the agreed specifications, and projects are carried out according to professional project management practices\nEffectively asses, intervene and mobilize support interventions for allocated projects where necessary\n \nEnquiries: Tel: 0860 54 3000\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nBOARD/COMMITTEE MEMBERS - IND00167\nClosing Date 2024-10-14\nDepartment Corporate Legal Services Department (2019)\nLocation City of Ekurhuleni\nRemuneration R 0 to R 0 -\nAssignment Type Temporary\n \nMinimum Requirements:\nB Degree; NQF Level 7\nRegistered as CA, CIA or CISA will be an added advantage\nCandidates must be suited to serve on the Committee/Board by virtue of their qualifications, expertise and experience in the fields of Financial Management, Accountancy, Audit, Legal, Actuarial, Information Technology, Investment Management, Finance, Internal Auditing, Risk Management, Infrastructure Development and Project Management, Development Finance, Socio-economic Development, Strategic Planning and Performance Management, Business, Pension Fund Management, Compliance, Transport Economics, Engineering Sciences, Built Environment, Community Activism and Participation, and Governance and Public Sector and or Local Government Administration.\nApplicants must possess no less than 8 years’ management experience in any of the specialist areas enlisted above. Preference will also be given to applicants who have previously served in such roles.\nA Cover Letter, Curriculum Vitae and certified copies of qualifications together with 3 references must be submitted with applications.\n \nFurther considerations: Applications will be subject to vetting and probity checks and the selected candidates obtaining necessary security clearance. Preference will be given to candidates whose appointments will enhance representation of Communities of the City of Ekurhuleni. Correspondence will be limited to short-listed applicants only.\n\n \nDisclaimer: The City of Ekurhuleni reserves the right to amend, modify or withdraw this advert or to amend, modify or terminate any of the requirements set out herein at any time and from time to time, without prior notice and without liability to compensate or reimburse any party. Applications don’t mean acceptance, as candidates will be subject to the City’s’ recruitment and selection process. The City of Ekurhuleni reserves the right not to select any applicant.\n\nRemuneration: Council determines the remuneration allowances and other benefits of the Chairperson, Directors and other Committee members. \n\nEnquiries: Natasja Havenga (011) 999 6356.\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "NON-EXECUTIVE BOARD MEMBER - IND00166\nClosing Date 2024-10-14\nDepartment Corporate Legal Services Department (2019)\nLocation City of Ekurhuleni\nRemuneration R 0 to R 0 -\nAssignment Type Temporary\n \nMinimum Requirements:\nB Degree; NQF Level 7.\nPost graduate NQF 8/9 qualification will be an advantage.\nCandidates must be suited to serve on the Board and its Committees by virtue of their qualifications, expertise and experience in the fields of Financial Management, Legal, Actuarial, Information Technology, Investment Management, Finance, Auditing, Risk Management, Infrastructure Development, Development Finance, Socio-economic Development, Strategic Planning, Business, Pension Fund Management, Compliance, Transport Economics, Engineering Sciences, Built Environment, Community Activism and Participation, and Governance and Public Sector Administration.\nApplicants must possess at least 8 years’ management experience in any of the specialist areas enlisted above. Preference will also be given to applicants who have previously served in such roles.\nA Cover Letter, Curriculum Vitae and certified copies of qualifications together with 3 references must be submitted with applications\n \nFurther considerations: Applications will be subject to vetting and probity checks and the selected candidates obtaining necessary security clearance. Preference will be given to candidates whose appointments will enhance representation of Communities of the City of Ekurhuleni. Correspondence will be limited to short-listed applicants only.\nDisclaimer: The City of Ekurhuleni reserves the right to amend, modify or withdraw this advert or to amend, modify or terminate any of the requirements set out herein at any time and from time to time, without prior notice and without liability to compensate or reimburse any party. Applications don’t mean acceptance, as candidates will be subject to the City’s’ recruitment and selection process. The City of Ekurhuleni reserves the right not to select any applicant.\nRemuneration: Council determines the remuneration allowances and other benefits of the Chairperson and Non-Executive Directors (NEDs).\n \nEnquiries: Tel: Natasja Havenga (011) 999 6356\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE",
                "PROFESSIONAL NURSE - XHESD0003\nClosing Date 2024-10-02\nDepartment Health & Social Development Department (2019)\nLocation City of Ekurhuleni\nRemuneration R 443508 to R 443508 -\nAssignment Type Temporary\n \nMinimum Requirements:\nNursing Diploma in General Nursing, Midwifery, Psychiatric Nursing (optional) and Community Nursing Science\nRegistration with the South African Nursing Council\nValid Driver's license\nRelevant experience in a similar environment\n \nCore Responsibilities:\nTo provide facility based on community and primary health care services including the ward based primary health care, outreach health services and implement primary health programmes\nEnsure sufficient planning, organising and implement work\nTo implement good governance and risk control process to ensure compliance to legislation, policies and guidelines\nTo implement effective stock and financial control process\nTo provide quality primary health care services which is responsive to the needs of the clients/patients within the ambit of the values and guiding principles of the organization as well as the nursing profession and specialized scope of practice\nTo ensure collaboration within a multi -disciplinary team and collaborate intersectorally for effective people management\nCommunicating with relevant stakeholders to ensure effective rendering of ward based and primary health care services\n \n \nEnquiries: Tel: 0860 54 3000\n \nCandidates may be requested to submit proof of the NQF level applicable to the qualifications they have obtained.\n \nShould candidates not be informed of the outcome of the application within six weeks of the closing date, it should be regarded as having been unsuccessful. The City of Ekurhuleni subscribes to the principles of the Employment Equity Act and reserves the right to appoint, not appoint or to appoint laterally.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "pc69b7bae-daa2-4434-a0f9-6b59e93ee493"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/cidb_orig.gif",
            "href": "https://www.govpage.co.za/construction-industry-development-board-cidb-vacancies-blog/construction-industry-development-board-cidb-vacancies1624920",
            "title": "CONSTRUCTION INDUSTRY DEVELOPMENT BOARD (CIDB) VACANCIES",
            "content": [
                " \nCONSTRUCTION INDUSTRY DEVELOPMENT BOARD (CIDB)\n ",
                " \nMANAGER: SKILLS DEVELOPMENT PROJECTS\nCenturion\nJob Ref #: SDM/BUILD/001\nIndustry: Government\nJob Type: Contract\nSalary: R993 593,00 - R1 313 630,00\n \nDescription:\n5 Years Contract\nFacilitate and monitor the implementation of the skills development standard on the cidb BUILD Programme and provide advice and assistance on skills development initiatives, including legislative matters and requirements.\nManage the implementation, delivery, and execution of strategic projects and learning programs. Compile implementation plans and supporting documents and ensure these are adhered to for the duration of the programmes. Conduct skills development training needs analysis to address identified skills gaps and oversee training interventions and maintain records to ensure that the training programmes are properly administered, recorded and reported as required. Evaluate the effectiveness of training programmes and recommend improvements to Management. Collaborate closely with key stakeholders to ensure the successful delivery of learning programs and projects. Communicate all aspects of the rollout, including risks and mitigation plans, to relevant stakeholders. Ensure that goals and objectives are achieved within the defined scope, time frame, and budget.\nRequirements:\nA bachelor’s degree (NQF 7) or an Advanced Diploma in Human Resources Management/Training & Development/ Skills Development & Management / Development Studies/ Public Administration. A postgraduate qualification will be an added advantage. Valid driver's license.\n\nMinimum of six (6) years' experience of which two (2) are at middle management level and four (4) functional experience in Human Resource Development/ Training and Development services, focusing on the execution and delivery of comprehensive learning and development functions within the Built Environment.\n \nClosing Date: 7 October 2024\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation\n \nAPPLY\n \n \n                            \n \n ",
                "APPLICATION DEVELOPER\nCenturion\nJob Ref #: ISM02\nIndustry: Government\nJob Type: Permanent\nSalary: R359 717,85 - R526 175,18\n \nDescription:\nKey Performance Areas\n1.1 Plan and Design IT Application Solutions\nCollaborate with the procurement and development team and other ICT staff to develop specifications and configurations for new applications.\nEstablish a detailed technical specification through discussion with co-workers and clients.\nClarifying actions the system is intended to perform.\nCommunicate ideas to the Information Systems Overseer and ICT team.\nDesign creative prototypes according to specifications.\nCoordinate application development plans with the supply chain management.\nDevelop application release schedule and introduce new functionality using SDLC methodologies.\nProvide application health reports, such as performance, availability, utilisation and capacity.\nDevise possible solutions to anticipated problems.\nEnsure application staging is correctly scheduled, such as development, testing and training platforms. Ensure correct resources for production environment.\n1.2 Development, Testing & Deployment\nDevelop release, test, training, and stabilisation plans.\nActively participate in training, testing and UAT sign-off activities.\nManage post go-live stabilisation using advanced troubleshooting and debugging.\nAggressively influence project delivery timelines.\nEnsure new systems are part of the existing backup plans.\nDevelop a disaster recovery testing plans for systems and participate in business continuity simulation.\nConduct user-acceptance testing to ensure the application meet the user requirements.\nDevelop end-user reports.\n1.3 Application Maintenance and Support\nManage the application lifecycle, and people involved in the process, to ensure smooth deployment and post-deployment modifications.\nEvaluate existing applications to propose enhancements and new functionalities.\nEstablish processes and procedures to resolve applications errors in the production platform.\nManage the application security.\nDevelop adaptation of the program to new requirements, as necessary.\nDevelop technical documents and manuals to accurately represent application “As-build”.\nParticipate in monthly service level review and operational meetings.\n \nRequirements:\nEDUCATION AND EXPERIENCE\nNQF 6 qualification in IT or related field.\nCertifications in Microsoft Dynamics and Azure cloud will be an added advantage.\nAt least three (3) years’ experience in software development involving releases, versioning, change control and source code control within technologies such as SharePoint, .Net, C#, CSS, REST API, JSON, Angular, Power Automate, etc.\nExperience in cloud-based application development within Azure, Dynamics 365, Microsoft PowerApps, Azure database and SharePoint platforms is an added advantage.\n \nCOMPUTER SKILLS\nThe applicant must have advanced computer skills in engaging agile system development methodologies and techniques.\nS/He must have a good grasp of emerging software development culture, processes, and tools within application development and operational environment.\nFurther be skilled fairly in .NET, ERP, ITIL, SQL, Azure technologies.\n \nAPPLY",
                "MANAGER: ENTERPRISE DEVELOPMENT PROJECTS\nCenturion\nJob Ref #: EDM/BUILD/001\nIndustry: Government\nJob Type: Contract\nSalary: R993 593,00 - R1 313 630,00\n \nDescription:\n5 Years Contract\nFacilitate and monitor the implementation of the enterprise development/indirect targeting standard on the cidb BUILD Programme and provide advice and assistance on the contractor development initiatives, including legislative matters and requirements. Manage the implementation, delivery, and execution of strategic projects for enterprise/contractor development. Compile implementation plans and supporting documents and ensure these are adhered to for the duration of the programmes. Conduct contractor development training needs analysis to address identified skills gaps and oversee training interventions and maintain records to ensure that the training programmes are properly administered, recorded and reported as required. Evaluate the effectiveness of training programmes and recommend improvements to Management. Collaborate closely with key stakeholders to ensure the successful delivery of contractor development programs and projects. Communicate all aspects of the rollout, including risks and mitigation plans, to relevant stakeholders. Ensure that goals and objectives are achieved within the defined scope, time frame, and budget.\n \nRequirements:\nA bachelor’s degree (NQF 7) or an Advanced Diploma in the Built Environment. A postgraduate qualification in the Built Environment will be an added advantage.\nMinimum of six (6) years' experience in infrastructure delivery management of which two (2) are at middle management level and four (4) years’ experience in project or programme management within the Built Environment, focusing on the execution and delivery of infrastructure projects.\n \nClosing Date: 7 October 2024\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation.\n \nAPPLY"
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "pad6f6949-0281-42ee-a933-c14e21a5564a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/eskom_orig.png",
            "href": "https://www.govpage.co.za/eskom-vacancies-blog/eskom-vacancies7191545",
            "title": "ESKOM VACANCIES",
            "content": [
                " \nESKOM\n ",
                " \n \nLEANER INTERN X1 (GENERATION GROUP CAPITAL) MEGAWATT PARK\nVacancy type: External/Internal\nTask Grade : L06\nArea of Specialization : N/A\nDepartment : Human Resources\nBusiness Unit : Group Capital\nLocation : South Africa (Gauteng)\nReference Number : Learners UOT GC\nClosing Date : 10/14/2024\nMinimum Requirements\n\n\nQualification(s):\n• Fully Completed National Diploma in HR at NQF Level 6 with 240 Credits\n\nMinimum Requirements\n• Must be a South African Citizen\n\nRelated Minimum Experience:\n• No Experience\nSkills and Competencies\n\n\nLeadership\n• Teamplayer\n\nBehavioural\n• Integrity\n• Professionalism\n• Customer focused\n\nKnowledge\n• Knowledge of Eskom’s Policies and procedures\n\nSkill\n• Communication Skills\n• Sound interpersonal Skills\n• Negotiation Skills\n• Liaising Skills\n\nAttributes\n• Politeness\n• Promptness\n• Energetic\n• Self-starter\n• Assertive\n \nKey Responsibilities\n• The incumbent will be afforded institutionalised and on job training\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL**\nrecruitmentgcd@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nSNR ADVISOR ETD NON – TECH\nVacancy type: External/Internal\nTask Grade : G14\nArea of Specialization : To be responsible for the delivery of learning interventions, conducting competency assessments, moderations and designing course content.\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081511NM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n\nQualification(s):\nB Degree/B Tech/National Higher Diploma/Advanced Diploma in Human Resources/ Social Sciences/ Educational Sciences at NQF7 with 360 credits.\nLearning facilitation, accreditation, moderation, content design and development\n\n• Related Minimum Experience:\n  4 Years.\n \nSkills and Competencies\n\n\nBehavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n\n\nLeadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\nSkills\n• Learning content design and development\n• Learning evaluation\n• Competency analysis\n• Assessment tools and techniques\n• Communication\n• Training facilitation\n•  Managing conflict\n \nKey Responsibilities\n• Adult learning fundamentals\n• Learner assessment\n•  On-the-job training\n• Structured learning\n• The South African Quality Authority (SAQA) and National Qualification Framework (NQF) assessment, moderation requirements\n• Faculty specific knowledge and skills\n• Relevant Eskom policies and procedures\n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \nSNR ADVISOR ETD ENGINEERING\nVacancy type: External/Internal\nTask Grade : G14\nArea of Specialization : To be responsible for the delivery of learning interventions, conducting competency assessments, moderations and designing course content.\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081511NM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n\nQualification(s):\nB Degree/B Tech/National Higher Diploma/Advanced Diploma in Human Resources/ Social Sciences/ Educational Sciences at NQF7 with 360 credits.\nLearning facilitation, accreditation, moderation, content design and development\n\n• Related Minimum Experience:\n 4 Years.\nSkills and Competencies\n\nBehavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n\nLeadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\nSkills\n• Learning content design and development\n• Learning evaluation\n• Competency analysis\n• Assessment tools and techniques\n• Communication\n• Training facilitation\n• Managing conflict\n \nKey Responsibilities\n• Adult learning fundamentals\n• Learner assessment\n• On-the-job training\n• Structured learning\n• The South African Quality Authority (SAQA) and National Qualification Framework (NQF) assessment, moderation requirements\n• Faculty specific knowledge and skills\n• Relevant Eskom policies and procedures\n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nSNR ADVISOR ETD MAINTENANCE\nVacancy type: External/Internal\nTask Grade : G14\nArea of Specialization :  To be responsible for the delivery of learning interventions, conducting competency assessments, moderations and designing course content.\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081510NM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n\n\nQualification(s):\nB Degree/B Tech/National Higher Diploma/Advanced Diploma in Human Resources/ Social Sciences/ Educational Sciences at NQF7 with 360 credits.\n\nLearning facilitation, accreditation, moderation, content design and development.\n\n• Related Minimum Experience:\n  4 Years.\n \nSkills and Competencies\n\nBehavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n\n Leadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\n Skills\n• Learning content design and development\n• Learning evaluation\n• Competency analysis\n• Assessment tools and techniques\n• Communication\n• Training facilitation\n• Managing conflict\n \nKey Responsibilities\n• Adult learning fundamentals\n• Learner assessment\n• On-the-job training\n• Structured learning\n• The South African Quality Authority (SAQA) and National Qualification Framework (NQF) assessment, moderation requirements\n• Faculty specific knowledge and skills\n• Relevant Eskom policies and procedures\n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \nSNR CLERK GENERAL ADMIN\nVacancy type: External/Internal\nTask Grade : T06\nArea of Specialization : To provide general administrative services to the section\nDepartment : Human Resources\nBusiness Unit : Duvha Power station and Kendal Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081514LM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n\n• Qualification(s):\n  NCV4/NSC3/ Grade 12 at NQF 4 with 120 Credits.\n  Administrative Experience.\n\n• Related Minimum Experience:\n  2 years.\n \nSkills and Competencies\n\nLeadership\n• Team Player\n\n Behavioral\n• Politeness\n• Promptness\n• Energetic\n• Self-starter\n• Assertive\n• Telephone Etiquette\n\n Knowledge\n• Knowledge of Eskom’s policies and procedures .\n\n\nSkill\n• Administrative skills\n• Communication skills\n• Sound interpersonal skills\n• Negotiation skills\n• Liaising skills\n \nKey Responsibilities\n• Section Administration\n• Office control\n• Basic Advisory Service and Reporting\n \n “If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nGRADUATE IN TRAINING (GIT) X77 (GENERATION GROUP CAPITAL) GAUTENG, FREE STATE, LIMPOPO, MPUMALANGA\nVacancy type: External/Internal\nTask Grade : L07\nArea of Specialization : N/A\nDepartment : Human Resources\nBusiness Unit : Group Capital\nLocation : Various\nReference Number : Learners GIT GC\nClosing Date : 10/14/2024\n \nMinimum Requirements\n\nQualification(s):\n• Fully Completed B Degree/B Tech/Advanced Diploma eg BCom, BA, etc in Built Environment/Commerce/Business Management/ Business Administration/Marketing/Stakeholder Management/Public Relations/Communication/Human Resources Management/ Behavioral Sciences/Safety Management/Environmental Science/Quality Management Logistics/Supply Chain Management/Business Analysis/Information System/Computer Science\n\nMinimum Requirements\n• Must be a South African Citizen\n\nRelated Minimum Experience:\n• No Experience\nSkills and Competencies\nLeadership\n• Teamplayer\n\nBehavioural\n• Integrity\n• Professionalism\n• Customer focused\n\nKnowledge\n• Knowledge of Eskom’s Policies and procedures\n\nSkill\n• Communication Skills\n• Sound interpersonal Skills\n• Negotiation Skills\n• Liaising Skills\n\nAttributes\n• Politeness\n• Promptness\n• Energetic\n• Self-starter\n• Assertive\n \nKey Responsibilities\n• The incumbent will be afforded institutionalised and on job training.\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL** recruitmentgcd@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \nOFFICER DATA CENTER X3\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : Ensure the availability, reliability, control and effectiveness of the Data Centre in relation to business requirements, service providers and suppliers to monitor that the level of Data Centre services\nDepartment : Infrastructure\nBusiness Unit : Infrastructure Provisioning and Hosting (Data Centre)\nLocation : South Africa (Gauteng)\nReference Number : 50810858GS\nClosing Date : 10/7/2024\n \nMinimum Requirements\n\nQualification(s):\n•National Diploma in Information Management / Information\nSystems/Information Sciences at NQF 6 with 240 Credits\n\nRelated Minimum Experience:\n•3 years’ experience on Data Centre environments and critical infrastructure systems\n \nSkills and Competencies\n\nBehavioral\n•Analytical thinker\n•Professionalism\n•Emotional maturity\n•Flexible & able to work within undefined & continuously changing environment.\n•Resilient and able to operate effectively in a matrix environment.\n\nLeadership:\n•Teamwork – working in a team towards a common goal as well as the ability to lead and empower a team.\n•Ability to coordinate resources within the environment to drive quality.\n•Good communicator.\n•Influence and persuasion.\n•Results orientation.\n\nKnowledge\n•In depth knowledge of an IT environment\n•In-depth working knowledge of ITIL processes & functions\n\nSkill\n•Good problem solving and analytical\n•Ability to assess both IT and business risks\n•Ability to communicate at all levels\n•Ability to cope with stress and work under pressure\n•Ability to research, analyse and prepare information\n•Advanced Microsoft Office skills\n \nKey Responsibilities\n•Monitor and report on overall Data Centre availability and capacity optimization\n•Advise on the design, build, and oversee hosting of all ICT equipment in a physical secure environment by performing installations, decommissioning of equipment\n•Support the sustainability of engagements with all Group IT functions\n•Perform Data Centre implementation strategies related to all towers of service and\n•successful hosting of all types of different hardware (servers, network, storage,\netc.)\n•Assist the Data Centre Manager with planning and researching new Data Centre Technology Solutions\n\n \n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL to recruitmentssf@eskom.co.za **\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nOFFICER SECURITY INVESTIGATIONS X1 (GENERATION) KOEBERG NPS\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To conduct investigations of irregularities, criminal activities, security incidents and breaches at business unit level in Eskom Holdings environment and to report on the results of such investigations.\nDepartment : Nuclear Services\nBusiness Unit : Koeberg Nuclear Power Station\nLocation : South Africa (Western Cape)\nReference Number : 50867748XS/Gx-Koeberg\nClosing Date : 10/14/2024\n \nMinimum Requirements\n• National Diploma Security Risk Management/Policing/Forensic\nInvestigations at NQF6 with 240\n\nRelated Minimum Experience:\n• 3 years related experience in a security environment and crime\nInvestigations\n\nProfessional Registration Body: \n• Private Security Industry Regulatory Authority (PSIRA) Grade A\n \nSkills and Competencies\n\n1) Behavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism\n\n2) Leadership\n• Live the Eskom vision and values\n• Grow people\n• Ignite passion\n• Promote teamwork\n• Encourage the right behaviour\n• Must be accountable for decisions made\n\n3) Knowledge\n• Relevant legislation\n• Apply theoretical and business knowledge on the job\n• Think on the feet and make quality decisions\n• Eskom’s security policies, systems, directives, and standards\n• National key point training program\n• PSIRA skills program – first line security supervisor\n• PSIRA skills program – private investigator\n\n4) Skill\n• Report writing\n• Communication\n• Work under pressure in the dynamic and fast paced environment of investigations\n• Analysing and interpreting data\n• Promote open and transparent communication\n• Work as a team or an individual where required    \n \nKey Responsibilities\n• Conduct baseline investigations into incidents, irregularities, criminal activities\n• Apply sound investigative practices\n• Provide post investigative support to the business\n• Provide an advisory and consultative role\n\n\n\nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmentgx@eskom.co.za **\n \nKindly apply for the position online by clicking on the link below:\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n\n\n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nSUPERVISOR (X4) CAMDEN POWER STATION-ERI\nVacancy type: External/Internal\nTask Grade : T10\nArea of Specialization : Responsible to supervise Project planned and breakdown outages on Turbo Gen Plant and auxiliaries.\nDepartment : Projects\nBusiness Unit : Turbo Gen Services\nLocation : South Africa (Mpumalanga)\nReference Number : ERI 0012691\nClosing Date : 10/14/2024\n \nMinimum Requirements\nQualification(s):\n• Mechanical Fitting Trade Certificate and NTC4 or equivalent.\n\nRelated Minimum Experience:\n• At least 3 years’ experience on Turbine Generator plant and its auxiliaries\n• At least 2 years supervision experience with strong organizational, interpersonal, communication & supervision skills with the ability to manage subordinates to achieve the required objective.\n \nSkills and Competencies\n• Strong technical background with at least 5 years related experience on steam Turbines, Generators and related Auxiliaries-ranging from 150MW to 1000MW, including ABB, MAN, KWU, Alstom, Siemens, AEG, AEI and parsons and Alstom nuclear.\n• Sound basic fitting skills with the ability to utilize and read measuring instruments within the tolerance requirements.\n• Must be fully literate in English, in reading, writing and speaking, with technical report writing skills and required to communicate in English at all times\n• Conversant with quality system, Safety system and Disciplinary Code.\n• Must have a valid advanced Rigging certificate.\n\nKnowledge\n• Planning, leading and controlling of activities in accordance with process quality plans, Work instructions and OEM specification within the company procedure TTQ-D-6.\n• Ensure the effective management, utilization and control of resources, tools and equipment.\n• Provide technical support on repairs and refurbishment.\n• Ensure a clean working environment is maintained.\n• Ensure adherence to quality procedures and quality plans check sheets to be completed and signed as per requirements.\n• Ensure compliance with the access control of turbines and generators as per company Procedures.\n• Meet predefined milestone deadlines, ensure compliance with plant Safety Regulations, with safety and environmental rules, regulations and PPE requirements and with quality standards.\n• Responsible for subordinates’ performance management, on job training, and HR/IR Management.\n• Perform rigging and lifting of components within the certified limits of the qualification.\n\nAttributes\n• The ability to function effectively.\n\nSHEQ Responsibilities\n• Continuous improvement: Ensure that your administration Document is current and includes and SHEQ objectives.\n• Ensure that all legal appointments are valid and in place for your area of control.\n• SHE Compliance: As a section 8 (2)I appointee, you are to ensure that the duties of the employer as contemplated in the Occupational Health and Safety act 85 of 1993 are properly discharged and all legal appointments are valid and in place for your area of control.\n• Reduce rework: Measure and report on rework vs revenue for your department on a monthly basis and ensure you reduce rework to less than 0.5 of your turnover.\n• Audit Rating: Maintain an audit score of less than 2 and/or receive no major findings.\n \nKey Responsibilities\nProject planned and unplanned outages supervision.\n \n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL ** recruitmenteri@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nNON - TECH FUNCTIONAL TRAINING ETD OFFICER\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide and deliver technical or non-technical training to ensure sufficiently competent employees to undergo on job coaching and training for authorisation in order to satisfy the business needs for current and future Human Resources sustainability\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081508LM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n• Qualification(s):\nRelevant National Diploma in Human Resources.\n HR or Learning related experience.\n\n• Related Minimum Experience:\n  1 Year.\n \nSkills and Competencies\n\n Behavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n• Interpersonal relations skills\n• Detailed oriented.\n• Proactive\n• Structured\n\n Leadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\n Skills\n• Computer Literacy\n• Analytical Skills\n• Communication skills\n• Coordinating skills\n• Collating and interpreting data\n• Making presentations\n \nKey Responsibilities\n• Document records control processes and system\n• Eskom business understanding\n• Computer applications\n• Eskom application (SAP /LSO)\n• ISO 9001:2008 requirements and application\n• Configuration management principles\n• Computer literate.\n\n ATTRIBUTES :\n• Physical ability\n• Ability to work at Heights\n• Ability to distinguish colours\n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nENGINEERING ETD OFFICER\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide and deliver technical or non-technical training to ensure sufficiently competent employees to undergo on job coaching and training for authorisation in order to satisfy the business needs for current and future Human Resources sustainability\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081507LM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n\n•  Qualification(s):\n  Relevant National Diploma in Human Resources.\n  HR or Learning related experience.\n\n• Related Minimum Experience:\n  1 Year.\n \nSkills and Competencies\n\n Behavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n• Interpersonal relations skills\n• Detailed oriented.\n• Proactive\n• Structured\n\n Leadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\nSkills\n• Computer Literacy\n• Analytical Skills\n• Communication skills\n• Coordinating skills\n• Collating and interpreting data\n• Making presentations\n \nKey Responsibilities\n• Document records control processes and system\n• Eskom business understanding\n• Computer applications\n• Eskom application (SAP /LSO)\n• ISO 9001:2008 requirements and application\n• Configuration management principles\n• Computer literate.\n\n ATTRIBUTES :\n• Physical ability\n• Ability to work at Heights\n• Ability to distinguish colours\n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nWELDING AND FABRICATION ETD OFFICER\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide and deliver technical or non-technical training to ensure sufficiently competent employees to undergo on job coaching and training for authorisation in order to satisfy the business needs for current and future Human Resources sustainability\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081506LM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements Relevant National Diploma in Human Resources.\n HR or Learning related experience.\n\n• Related Minimum Experience:\n  1 Year.\n \nSkills and Competencies\n\nBehavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n• Interpersonal relations skills\n• Detailed oriented.\n• Proactive\n• Structured\n\n Leadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\n Skills\n• Computer Literacy\n• Analytical Skills\n• Communication skills\n• Coordinating skills\n• Collating and interpreting data\n• Making presentations\n \nKey Responsibilities\n• Document records control processes and system\n• Eskom business understanding\n• Computer applications\n• Eskom application (SAP /LSO)\n• ISO 9001:2008 requirements and application\n• Configuration management principles\n• Computer literate\n\nATTRIBUTES :\n• Physical ability\n• Ability to work at Heights\n• Ability to distinguish colours\n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nWATER TREATMENT PLANT ETD OFFICER\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide and deliver technical or non-technical training to ensure sufficiently competent employees to undergo on job coaching and training for authorisation in order to satisfy the business needs for current and future Human Resources sustainability\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081505LM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n•  Qualification(s):\n    Relevant National Diploma in Human Resources.\n    HR or Learning related experience.\n\n•  Related Minimum Experience:\n   1 Year.\nSkills and Competencies\n\n\nBehavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n• Interpersonal relations skills\n• Detailed oriented.\n• Proactive\n• Structured\n\n  Leadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\n Skills\n• Computer Literacy\n• Analytical Skills\n• Communication skills\n• Coordinating skills\n• Collating and interpreting data\n• Making presentations\n \nKey Responsibilities\n• Document records control processes and system\n• Eskom business understanding\n• Computer applications\n• Eskom application (SAP /LSO)\n• ISO 9001:2008 requirements and application\n• Configuration management principles\n• Computer literate.\n\n  ATTRIBUTES :\n• Physical ability\n• Ability to work at Heights\n• Ability to distinguish colours\n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \n \nLEGISLATIVE - EOD ETD OFFICER\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide and deliver technical or non-technical training to ensure sufficiently competent employees to undergo on job coaching and training for authorisation in order to satisfy the business needs for current and future Human Resources sustainability.\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081503LM/DVP\nClosing Date : 10/11/2024\n \nMinimum Requirements\n\n• Qualification(s):\n       Relevant National Diploma in Human Resources.\n       HR or Learning related experience.\n\n• Related Minimum Experience:\n       1 Year.\n \nSkills and Competencies\n\n Behavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n• Interpersonal relations skills\n• Detailed oriented.\n• Proactive\n• Structured\n\n Leadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n\n Skills\n• Computer Literacy\n• Analytical Skills\n• Communication skills\n• Coordinating skills\n• Collating and interpreting data\n• Making presentations\n \nKey Responsibilities\n• Document records control processes and system\n• Eskom business understanding\n• Computer applications\n• Eskom application (SAP /LSO)\n• ISO 9001:2008 requirements and application\n• Configuration management principles\n• Computer literate\n \n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \nARTISAN FITTER (X6) CAMDEN POWER STATION-ERI\nVacancy type: External/Internal\nTask Grade : T09\nArea of Specialization : Perform Fitting tasks as required.\nDepartment : Projects\nBusiness Unit : Turbo Gen Services\nLocation : South Africa (Mpumalanga)\nReference Number : ERI 0012690\nClosing Date : 10/14/2024\n \nMinimum Requirements\nQualification(s):\n• Fitter & Turner Trade Qualification\n• Equivalent fitter Qualification registered and recognised by the Government of RSA\n\nRelated Minimum Experience:\n• 2 years’ relevant Post Qualification experience\n \nSkills and Competencies\n• Good fitting skills\n• Good communication skills\n• Good interpersonal skills\n• Proficient in the use of basic hand tools\n• Basic planning skills\n• Knowledge in use of different tools and equipment\n• Computer literacy\n\nKnowledge\n• Ability to use Mechanical measuring equipment.\n• Ability to read and interpret component drawing and tolerances.\n• Ability to maintain a high-quality standard of work.\n• Familiar with the OSHACT 85 of 1993\n• Basic knowledge of quality systems\n\nAttributes\n• Attention to detail.\n• Good customer relations.\n• Innovative\n• Able to work under pressure.\n• Honest and reliable\n• Adaptability to change.\n• Able to work in a team\n• Problem solving\n• Ability to work independently and to communicate at all levels.\n• Meet set deadlines.\n \nKey Responsibilities\nProduction\n Safety\n Training\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmenteri@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \n \nSUPERVISOR (X4) MAJUBA POWER STATION-ERI\nVacancy type: External/Internal\nTask Grade : T10\nArea of Specialization : Responsible to supervise Project planned and breakdown outages on Turbo Gen Plant and auxiliaries.\nDepartment : Projects\nBusiness Unit : Turbo Gen Services\nLocation : South Africa (Mpumalanga)\nReference Number : ERI 0012689\nClosing Date : 10/14/2024\n \nMinimum Requirements\nQualification(s):\n• Mechanical Fitting Trade Certificate and NTC4 or equivalent.\n\nRelated Minimum Experience:\n• At least 3 years’ experience on Turbine Generator plant and its auxiliaries\n• At least 2 years supervision experience with strong organizational, interpersonal, communication & supervision skills with the ability to manage subordinates to achieve the required objective.\nSkills and Competencies\n• Strong technical background with at least 5 years related experience on steam Turbines, Generators and related Auxiliaries-ranging from 150MW to 1000MW, including ABB, MAN, KWU, Alstom, Siemens, AEG, AEI and parsons and Alstom nuclear.\n• Sound basic fitting skills with the ability to utilize and read measuring instruments within the tolerance requirements.\n• Must be fully literate in English, in reading, writing and speaking, with technical report writing skills and required to communicate in English at all times\n• Conversant with quality system, Safety system and Disciplinary Code.\n• Must have a valid advanced Rigging certificate.\n\nKnowledge\n• Planning, leading and controlling of activities in accordance with process quality plans, Work instructions and OEM specification within the company procedure TTQ-D-6.\n• Ensure the effective management, utilization and control of resources, tools and equipment.\n• Provide technical support on repairs and refurbishment.\n• Ensure a clean working environment is maintained.\n• Ensure adherence to quality procedures and quality plans check sheets to be completed and signed as per requirements.\n• Ensure compliance with the access control of turbines and generators as per company Procedures.\n• Meet predefined milestone deadlines, ensure compliance with plant Safety Regulations, with safety and environmental rules, regulations and PPE requirements and with quality standards.\n• Responsible for subordinates’ performance management, on job training, and HR/IR Management.\n• Perform rigging and lifting of components within the certified limits of the qualification.\n\nAttributes\n• The ability to function effectively.\n\nSHEQ Responsibilities\n• Continuous improvement: Ensure that your administration Document is current and includes and SHEQ objectives.\n• Ensure that all legal appointments are valid and in place for your area of control.\n• SHE Compliance: As a section 8 (2)I appointee, you are to ensure that the duties of the employer as contemplated in the Occupational Health and Safety act 85 of 1993 are properly discharged and all legal appointments are valid and in place for your area of control.\n• Reduce rework: Measure and report on rework vs revenue for your department on a monthly basis and ensure you reduce rework to less than 0.5 of your turnover.\n• Audit Rating: Maintain an audit score of less than 2 and/or receive no major findings.\n \nKey Responsibilities\nProject planned and unplanned outages supervision.\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL ** recruitmenteri@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nArtisan Fitter (X6) Majuba Power Station-ERI\nVacancy type: External/Internal\nTask Grade : T09\nArea of Specialization : Perform Fitting tasks as required.\nDepartment : Projects\nBusiness Unit : Turbo Gen Services\nLocation : South Africa (Mpumalanga)\nReference Number : ERI 0012688\nClosing Date : 10/14/2024\n \nMinimum Requirements\nQualification(s):\n• Fitter & Turner Trade Qualification\n• Equivalent fitter Qualification registered and recognised by the Government of RSA.\n\nRelated Minimum Experience:\n• 2 years’ relevant Post Qualification experience.\n \nSkills and Competencies\n• Good fitting skills\n• Good communication skills\n• Good interpersonal skills\n• Proficient in the use of basic hand tools\n• Basic planning skills\n• Knowledge in use of different tools and equipment\n• Computer literacy\n\nKnowledge\n• Ability to use Mechanical measuring equipment.\n• Ability to read and interpret component drawing and tolerances.\n• Ability to maintain a high-quality standard of work.\n• Familiar with the OSHACT 85 of 1993\n• Basic knowledge of quality systems\n\nAttributes\n• Attention to detail.\n• Good customer relations.\n• Innovative\n• Able to work under pressure.\n• Honest and reliable\n• Adaptability to change.\n• Able to work in a team\n• Problem solving\n• Ability to work independently and to communicate at all levels.\n• Meet set deadlines.\n \nKey Responsibilities\nProduction\n Safety\n Training\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmenteri@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nRE ADVERT SENIOR ADVISOR PROF PROJECT DEVELOPMENT X3 (NATIONAL TRA\nVacancy type: External/Internal\nTask Grade : P16\nArea of Specialization : To provide technical and business inputs to the conceptualization, pre–feasibility studies and business planning of new capacity projects and existing plant capacity upgrades.\nDepartment : Project Development\nBusiness Unit : Grid Planning and Development\nLocation : South Africa (Gauteng)\nReference Number : 49968976PM02\nClosing Date : 10/4/2024\n \nMinimum Requirements\n\nQualification(s):\n• B Degree/B Tech/Advanced Diploma in Built Environment/Commerce/Human   Science at NQF7 with 360 credits\n\nProfessional Registration:\n• Engineering Council of South Africa (ECSA) as Professional Engineer or Professional Engineering Technologist/ The South African Council for the Project and Construction Management Professions (SACPCMP) as a Professional Project Manager or Professional Construction Project Manager\n\nExperience:\n• Four years related experience in project management and/or project development environment\nSkills and Competencies\n\n• Behavioural\no Passion\no Patience\no Perseverance\no Explorative nature\no Integrity\no Honesty\no Trustworthiness\no Professionalism\no Self-driven\n\n• Leadership:\no Team player\no Motivating teams\no Coaching, mentoring and development of young professionals.\n\n• Knowledge:\no Areas of project management body of knowledge (PMBOK)\no Project lifecycle models\no Environmental requirements for infrastructure projects\no Occupational, health and safety (OHS) Act\no Technical or commercial project development\no Relevant processes, procedures, policies, guidelines and legislation\no Cost analysis and economic evaluation\no Project management\no Contract compilation and management\n\n• Skills:\no Analytical\no Technical problem-solving\no Communication and presentation\no Negotiation\no Budgeting\no Financial decision making\no Technical report writing\no Computer literate and proficiency in Microsoft applications\no Learn and adapt to change\n \nKey Responsibilities\n• Research new capacity concepts\n• Conduct pre-feasibility level analysis of potential capacity projects\n• Compile feasibility studies and business cases\n• Interaction with other disciplines and departments and management of interfaces, business requirements and queries, problems, etc.\n• Coordinate and prepare documentation related to project development deliverables\n• Provide training and development\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL (recruitmen@ntcsa.co.za) **\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n\n“NTCSA is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of NTCSA and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  NTCSA reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nNTCSA is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nSUPERVISOR (X4) GROOTVLEI POWER STATION-ERI\nVacancy type: External/Internal\nTask Grade : T10\nArea of Specialization : Responsible to supervise Project planned and breakdown outages on Turbo Gen Plant and auxiliaries.\nDepartment : Projects\nBusiness Unit : Turbo Gen Services\nLocation : South Africa (Mpumalanga)\nReference Number : ERI 0012687\nClosing Date : 10/14/2024\n \nMinimum Requirements\nQualification(s):\n• Mechanical Fitting Trade Certificate and NTC4 or equivalent.\n\nRelated Minimum Experience:\n• At least 3 years’ experience on Turbine Generator plant and its auxiliaries\n• At least 2 years supervision experience with strong organizational, interpersonal, communication & supervision skills with the ability to manage subordinates to achieve the required objective.\n \nSkills and Competencies\n• Strong technical background with at least 5 years related experience on steam Turbines, Generators and related Auxiliaries-ranging from 150MW to 1000MW, including ABB, MAN, KWU, Alstom, Siemens, AEG, AEI and parsons and Alstom nuclear.\n• Sound basic fitting skills with the ability to utilize and read measuring instruments within the tolerance requirements.\n• Must be fully literate in English, in reading, writing and speaking, with technical report writing skills and required to communicate in English at all times\n• Conversant with quality system, Safety system and Disciplinary Code.\n• Must have a valid advanced Rigging certificate.\n\nKnowledge\n• Planning, leading and controlling of activities in accordance with process quality plans, Work instructions and OEM specification within the company procedure TTQ-D-6.\n• Ensure the effective management, utilization and control of resources, tools and equipment.\n• Provide technical support on repairs and refurbishment.\n• Ensure a clean working environment is maintained.\n• Ensure adherence to quality procedures and quality plans check sheets to be completed and signed as per requirements.\n• Ensure compliance with the access control of turbines and generators as per company Procedures.\n• Meet predefined milestone deadlines, ensure compliance with plant Safety Regulations, with safety and environmental rules, regulations and PPE requirements and with quality standards.\n• Responsible for subordinates’ performance management, on job training, and HR/IR Management.\n• Perform rigging and lifting of components within the certified limits of the qualification.\n\nAttributes\n• The ability to function effectively.\n\nSHEQ Responsibilities\n• Continuous improvement: Ensure that your administration Document is current and includes and SHEQ objectives.\n• Ensure that all legal appointments are valid and in place for your area of control.\n• SHE Compliance: As a section 8 (2)I appointee, you are to ensure that the duties of the employer as contemplated in the Occupational Health and Safety act 85 of 1993 are properly discharged and all legal appointments are valid and in place for your area of control.\n• Reduce rework: Measure and report on rework vs revenue for your department on a monthly basis and ensure you reduce rework to less than 0.5 of your turnover.\n• Audit Rating: Maintain an audit score of less than 2 and/or receive no major findings.\n \nKey Responsibilities\nKey Responsibilities\n Project planned and unplanned outages supervision.\n\n \n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL ** recruitmenteri@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nARTISAN FITTER (X6) GROOTVLEI POWER STATION-ERI\nVacancy type: External/Internal\nTask Grade : T09\nArea of Specialization : Perform Fitting tasks as required.\nDepartment : Projects\nBusiness Unit : Turbo Gen Services\nLocation : South Africa (Mpumalanga)\nReference Number : ERI 0012686\nClosing Date : 10/14/2024\n \nMinimum Requirements\nQualification(s):\n• Fitter & Turner Trade Qualification\n• Equivalent fitter Qualification registered and recognised by the Government of RSA\n\nRelated Minimum Experience:\n• 2 years’ relevant Post Qualification experience.\n \nSkills and Competencies\n• Good fitting skills\n• Good communication skills\n• Good interpersonal skills\n• Proficient in the use of basic hand tools\n• Basic planning skills\n• Knowledge in use of different tools and equipment\n• Computer literacy\n\nKnowledge\n• Ability to use Mechanical measuring equipment.\n• Ability to read and interpret component drawing and tolerances.\n• Ability to maintain a high-quality standard of work.\n• Familiar with the OSHACT 85 of 1993\n• Basic knowledge of quality systems\n\nAttributes\n• Attention to detail.\n• Good customer relations.\n• Innovative\n• Able to work under pressure.\n• Honest and reliable\n• Adaptability to change.\n• Able to work in a team\n• Problem solving\n• Ability to work independently and to communicate at all levels.\n•Meet set deadlines.\n \nKey Responsibilities\nProduction\n Safety\n Training\n \n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmenteri@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are  encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nETD OFFICER BOILER AND TURBINE\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide and deliver technical or non-technical training to ensure sufficiently competent employees to undergo on job coaching and training for authorisation in order to satisfy the business needs for current and future Human Resources sustainability.\nDepartment : Human Resources\nBusiness Unit : Duvha Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 2024081502LM/DVP\nClosing Date : 10/11/2024\nMinimum Requirements\n\n• Qualification(s):\n   Relevant National Diploma in Human Resources.\n   HR or Learning related experience.\n\n• Related Minimum Experience:\n  1 Year.\n \nSkills and Competencies\n• Computer Literacy\n• Analytical Skills\n• Communication skills\n• Coordinating skills\n• Collating and interpreting data\n• Making presentations\n\nBehavioural\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism Integrity\n• Interpersonal relations skills\n• Detailed oriented.\n• Proactive\n• Structured\n\n Leadership.\n• Team Player\n• Motivating Teams\n• Coaching\n• Mentoring\n• Developing.\n \nKey Responsibilities\n\n Knowledge\n• Document records control processes and system\n• Eskom business understanding\n• Computer applications\n• Eskom application (SAP /LSO)\n• ISO 9001:2008 requirements and application\n• Configuration management principles\n• Computer literate\n \n \nFor assistant with this advert, please contact: recruitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.” \n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nRE-ADVERT OFFICER SECURITY INVESTIGATIONS (NATIONAL TRANSMISSION COMPANY SOUTH AFRICA) POLOKWANE\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To conduct investigations of irregularities, criminal activities, security incidents and breaches at business unit level in Eskom Holdings environment and to report on the results of such investigations.\nDepartment : Security\nBusiness Unit : Northern Grid\nLocation : South Africa (Limpopo)\nReference Number : 50519334SBR/01\nClosing Date : 10/4/2024\n \nMinimum Requirements\n\nQualification(s):\n• National Diploma Security Risk Management/Policing/Forensic Investigations at NQF6 with 240 credits\n•Professional Registration Body: Private Security Industry Regulatory Authority (PSIRA) Grade A\n\nExperience:\n•3 years’ Experience in a security environment and crime investigations\n \nSkills and Competencies\n\nBehavioural\nProfessionalism\nIntegrity\nTrustworthiness\nHonesty\n\nLeadership\nLive the Eskom vision and values\nGrow people\nIgnite passion\nPromote teamwork\nEncourage the right behaviour\nMust be accountable for decisions made\n\nKnowledge\nRelevant legislation\nApply theoretical and business knowledge on the job\nThink on the feet and make quality decisions\nEskom’s security policies, systems, directives, and standards\nNational key point training program\nPSIRA skills program – first line security supervisor\nPSIRA skills program – private investigator\n\nSkills\nCritical thinking:\nAttention to detail\nAnalytical skills\nProblem-solving abilities\nCommunication skills\nInterviewing and interrogation skills\nKnowledge of forensic techniques\nLegal knowledge\nTechnology proficiency\nEmotional intelligence\nPhysical fitness\nReport writing\nCommunication and interpersonal\nWork under pressure in the dynamic and fast paced environment of investigations\nAnalysing and interpreting data\nPromote open and transparent communication\nWork as a team or an individual where required\n \nKey Responsibilities\nConduct baseline investigations into incidents, irregularities, criminal activities.\nApply sound investigative practices.\nProvide post investigative support to the business.\nProvide an advisory and consultative service.\n\n\n\nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmenttx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“NTCSA is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  NTCSA reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nNTCSA is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nOFFICER PROJECT SERVICES SUPPORT (DISTRIBUTION) NEW GERMANY\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To coordinate information requirements between project services and project management functions for all categories of assets under construction and non-capital projects.\nDepartment : Asset Creation – Project Management\nBusiness Unit : Central East Cluster\nLocation : South Africa (Kwa-Zulu Natal)\nReference Number : 49012212IN\nClosing Date : 10/4/2024\n \nMinimum Requirements\n\n• Qualification(s):\nNational Diploma/ in Built Environment/Commerce/Human Sciences at NQF6        with 240 credits\n\n• Related Minimum Experience:\n3 years’ Project support services/project controls/project management\n \nSkills and Competencies\n\n• Behavioral\n• Dealing with complexity\n• Resilience and flexibility\n• Integrity and values\n• Professionalism\n\n• Leadership\n• Team player\n• Business acumen\n• Achievement orientated\n• Customer orientation\n\n• Knowledge\n• Capital management\n• Planning and scheduling\n• Project management\n• Contracts management\n• Cost management and estimating\n• Documentation management\n\n\n• Skill\n• Analytical\n• Judgement\n• Problem solving\n• Planning and organising\n \nKey Responsibilities\n• Provide support to project accounting.\n• Provide support to investment management.\n• Provide support to project administration.\n• Provide support to capital related resources.\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL **\nrecruitmentdx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "ASSISTANT OFFICER DEBT MANAGEMENT (DISTRIBUTION) NEW GERMANY\nVacancy type: External/Internal\nTask Grade : T10\nArea of Specialization : To perform and effective and efficient debt management service in the cluster according to organizational policies and procedures.\nDepartment : Revenue Management\nBusiness Unit : Central East Cluster\nLocation : South Africa (Kwa-Zulu Natal)\nReference Number : AR Fin 09\nClosing Date : 10/4/2024\n \nMinimum Requirements\n\n• Qualification(s):\nNational Diploma in Commerce / Finance / Accounting at NQF 6 with 240 credits\n\n• Related Minimum Experience:\n2 years’ experience in credit and debit management\nSkills and Competencies\n\n• Leadership\nTeam player\nMotivating teams\nCoaching\nMentoring\nDeveloping\n\n• Behavioral\nIntegrity\nHonesty\nTrustworthiness\nProfessionalism\n\n• Knowledge\n• Financial systems\n• Financial statutory requirements\n• Policies, processes and procedures\n• Eskom tariffs\n• International financial reporting standards (IRFS) and PFMA\n• Tax legislation\n\n• Skill\n• Communication\n• Financial administration\n• Accounting processing\n• Financial reporting\n• Interpersonal\n• Analytical and problem solving\n• Customer service\n• Computer literacy\n \nKey Responsibilities\nØ Perform debt control and administration\nØ Prepare, review and analyse operational reports\nØ Provide customer service and stakeholder management\nØ Administer and control securities\nØ Administer debt collection process\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL **\nrecruitmentdx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE",
                "SENIOR ADVISOR CONTRACTS MANAGEMENT (GENERATION) ARNOT POWER STATION\nVacancy type: External/Internal\nTask Grade : G15\nArea of Specialization : To be accountable to monitor and ensure acceptable cost, performance and quality of services provided by internal and external service providers by establishing and implementing service level agreements (SLAs), contracts, relevant tools and processes alig\nDepartment : Procurement\nBusiness Unit : Arnot Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : Gx Arn NN 29/09/2024\nClosing Date : 10/4/2024\n \nMinimum Requirements\n\nQualification(s):\nB Degree/B Tech/Advanced Diploma/ National Higher Diploma in Finance/Business Management/ Economics/Law at NQF7 with 360 credits\n\nRelated Minimum Experience:\n5 Years’ General business, SLA negotiation, implementation and\nmanagement\n \nSkills and Competencies\n\nBehavioural:\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism\n\nLeadership:\n• Team player\n• Motivating teams\n• Coaching\n• Mentoring\n• Developing others\n• Strong sense of accountability and allocating accountabilities and responsibilities\n• Strong ability to integrate requirements from various parts of the business as well as from the\ncustomer’s side to reach the best solution\n\nKnowledge:\n• In-dept technical knowledge of Eskom business and service required to meet customers’ needs\n• Meaningful integration and broad industry\n• SLA processes, tools and development methodologies\n\nSkill:\n• Analytical\n• Problem solving,\n• Consulting abilities\n• Computer literate\n• Report-writing\n• Good networking and interpersonal\n• Systems, Applications and Products (SAP)\n• Good working relationship with other divisions in Eskom.\n \nKey Responsibilities\n1. Provide guidance in defining and implementing service level agreements.\n2. Negotiate and implement SLAs with service providers.\n3. Manage risks, review and control performance associated with SLAs.\n4. Ensure and report on continuous improvement.\n\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL (recuitmentgx@eskom.co.za) **\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "pc3806454-2c13-4246-b559-462f3dc68209"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/fsca_orig.png",
            "href": "https://www.govpage.co.za/financial-sector-conduct-authority-fsca-vacancies-blog/financial-sector-conduct-authority-fsca-vacancies1850634",
            "title": "FINANCIAL SECTOR CONDUCT AUTHORITY (FSCA) VACANCIES",
            "content": [
                " \nFINANCIAL SECTOR CONDUCT AUTHORITY (FSCA)\n ",
                " \n \nANALYST - POLICY SUPPORT DEPARTMENT (Pretoria)\nReference Number FSCA 976\n \nDescription\nPurpose of the Job: \nTo provide support and undertake research and analysis on trends in financial consumer behaviour, financial products and services, and financial sector policy matters such as financial inclusion. To disseminate information to relevant departments within the FSCA and participate in developing the regulatory and supervisory frameworks to support the achievement of the FSCA’s mandate, including ensuring better customer outcomes in the financial sector. The person appointed to this position will report to the Senior Specialist: Policy Support. \n\n\nKey Performance Areas:\n• Support the development and implementation of policy for the FSCA \n• Support the implementation of research for the FSCA \n• Support the conducting of research on trends in the financial sector industry, consumer behaviour, financial products and services, and other issues   related to the regulatory responsibilities of the FSCA;\n• Disseminate research findings to support evidence and risk-based regulation and supervision; and\n• Stay abreast of best practises and relevant domestic and international developments in the field of market conduct regulatory approaches to drive pro-  active research; \n\n\nOther Key Competencies:\nThe candidate must demonstrate the following skills and attributes: Problem analysis; good interpersonal skills and emotional intelligence; stakeholder relation skills; research skills; ability to execute research projects; ability to communicate clearly both verbally and in writing; ability to author documents; ability to prioritise projects and tasks; analytical skills and ability to think and operate strategically; ability to work under pressure; ability to work independently and in a team.\n\n\nFSCA is committed towards increasing the representation of marginalised groups in line with its Employment Equity Plan. Persons with disabilities are encouraged to apply.\n\nPlease note that correspondence and communication will only be conducted with short listed candidates and that the FSCA reserves the right not to appoint if a suitable candidate is not identified.\n \nRequirements\nA degree in Economics, Development Economics, Social Sciences or Law with 3 – 5 years’ experience in a research or policy environment. Knowledge and understanding of research methodologies, the financial services industry and financial services products and services. \n \nClosing Date: 11 October 2024\n \nWork Level Skilled\nJob Type Permanent\nSalary Market Related\nEE Position Yes\nLocation Pretoria\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                "CONTRACT MANAGEMENT SPECIALIST - ICT GOVERNANCE, RISK AND COMPLIANCE DEPARTMENT (Pretoria)\nReference Number FSCA – 298\n \nDescription\nPurpose of the Job:\nThe ICT Contract Management Specialist will manage the contract lifecycle within the ICT services and cybersecurity domains. This role will focus on contract drafting, negotiation, formulation, and Service Provider Contract management, ensuring compliance with legal requirements, corporate governance, and risk mitigation. Central record keeping and updating of all ICT contracts.  Align to the South African contract laws, Public Finance Management Act (PFMA) regulations, and supply chain management processes, for ICT and cybersecurity-related contracts. The person appointed to this position will report to the Departmental Head: ICT Governance, Risk and Compliance. \n\nKey Performance Areas:\n• Draft, review, and amend ICT contracts where required, (e.g. licensing agreements, procurement contracts).\n• Act as the key contact and subject matter expert for all contract-related and tender activities. This includes negotiating contract terms, conditions,   modifications, penalties and incentives, while working with key stakeholders to ensure that their requirements are met. \n• Manage the contract execution process, resolving problems, mitigating delays, mediating disputes and escalating issues.\n• Assist with the development and Service Level Agreements (SLAs), and be responsible for the final versions of requests for information.\n• Establish ICT contract management objectives, procedures, templates and workflow processes for Service Provider contracts and deliverable schedules and   manage a contract register containing a database of all executed contracts.\n• Ensure that the Service Provider(s) are compliant with FSCA’s internal rules and regulatory obligations.\n• Evaluate Service Provider performance based on contract terms (e.g., quality of services, adherence to deadlines).\n• Manage contract performance review meetings with key Service Providers to ensure delivery against objectives and contract budgets, develop regular reports   on contract milestones and performance, and inform internal customers, vendors and management of activities and progress through regular written and   verbal communication.\n• Provide recommendations for improvements to processes, procedures, workflow and organizational structures for procurement plans and ICT contract   management.\n• Establish clear processes for the involvement of supply chain and legal resources in the contracting life cycle.\n• Resolve and/or recommend any Service Provider performance issues in a timely manner.\n• Oversee the full lifecycle of contracts, from initiation and negotiation through execution, monitoring, and renewal/termination.\n• Ensure timely renewal or termination of contracts to avoid service interruptions or unfavourable conditions.\n• Coordinate with relevant departments to ensure smooth execution of contract lifecycle processes.\n• Identify and assess risks associated with ICT contracts, including Service Provider reliability and contract obligations.\n• Develop and implement risk mitigation strategies aligned to the ICT Risk portfolio.\n• Prepare contingency plans for potential contract or Service Provider-related risks.\n\n• Conduct periodic audits of Service Provider performance and compliance.\n• Maintain accurate and organised records of all ICT contract-related documentation.\n• Prepare regular reports on contract status, performance, and compliance for stakeholders.\n• Document changes or amendments to contracts in a timely manner.\n\nOther Key Competencies:\n\nThe candidate must demonstrate the following skills and attributes: \nGood planning and organisation skills. Good communication skills including writing and verbal, interpersonal skills, good computer skills (MS Word, Excel, PowerPoint, MS Teams).  Ability to work individually and in a team, ability to work under pressure, extensive hours, multi-tasking and self-supervision. The candidates should have a sense of responsibility, loyalty and honesty.\n\nFSCA is committed towards increasing the representation of marginalised groups in line with its Employment Equity Plan. Persons with disabilities are encouraged to apply.\n\nPlease note that correspondence and communication will only be conducted with short listed candidates and that the FSCA reserves the right not to appoint if a suitable candidate is not identified. \n \nRequirements\nBachelor’s degree in law with a specialisation in contract or commercial law, with a strong foundation in South African legal standards or a related discipline with at least 5 years’ working experience within an Information Technology (IT) environment. A 5 year’s minimum experience in IT contract management, particularly in cybersecurity and ICT services. Strong knowledge of the Public Finance Management Act (PFMA) and supply chain management practices in a government or corporate environment.  Proven ability to draft, negotiate, and manage IT and cybersecurity contracts with a focus on legal compliance and risk management. Familiarity with regulatory frameworks such as POPIA, ECTA, and IT governance standards (e.g., ISO 27001, ITIL.\n \nClosing Date : 04 October 2024\n \nWork Level Mid-Level\nJob Type Permanent\nSalary Market Related\nEE Position Yes\nLocation Pretoria\n \nPLEASE APPLY HERE",
                "DESKTOP TECHNICIAN - ICT APPLICATIONS, INFRASTRUCTURES AND OPERATIONS DEPARTMENT (Pretoria)\nReference Number FSCA: 950\n \nDescription\nPurpose of the Job:\nTo provide first point of contact for IT services and assist clients with hardware and software related technical issues and to provide on-site or remote IT technical assistance including troubleshooting of IT issues. The person appointed to this position will report to the Infrastructure Manager.\n\n\nKey Performance Areas:\n• Manage the FSCA ICT service desk function as an entry point or single point of contact (SPOC) for business users.\n• Respond to calls on ICT Call Centre telephone system.\n• Log, categorise, prioritise and route service tickets on the ICT incident management platform.\n• Respond to incidents and service requests and ensure that they are successfully finalised and update stakeholders accordingly. \n• Identify, analyse, troubleshoot and resolve computer problem affecting user’s ability to perform business functions. \n• Install, configure, modify and delete user settings according to the FSCA operating standards on new and existing user computers.\n• Setup and configure application clients on new and existing user computers.\n• Monitor application processes and availability.\n• Create new user and computer profiles and retire old users and computer profiles from the user computers.\n• Escalate application related queries to other ICT departments whilst adhering to approved governance frameworks.\n• Manage, maintain and support of the audio-visual equipment in the boardroom and all collaboration solutions.\n• Provide management of the FSCA printer services in the FSCA environment.\n• Install and configure security end point protection and mail encryption solution and ensure that they are always set up as per the FSCA’s policies and     principles.\n• Liaise with external vendors to resolve incidences and problems whilst observing governance.\n• Participating in team meetings, team discussions and workshops.\n• Undertake research to investigate improvement of service support to the FSCA\n\nOther Key Competencies:\nThe candidate must demonstrate the following skills and attributes: Proven work experience as a Desktop Support Engineer, Technical Support Engineer, or similar role. Hands-on experience with Windows or Linux or Mac OS environments. Working knowledge of office automation products and computer peripherals, like printers and scanners. Knowledge of network security practices and anti-virus programs. Ability to perform remote troubleshooting and provide clear instructions. Excellent problem-solving and multitasking skills. Customer-oriented attitude.\n\nFSCA is committed towards increasing the representation of marginalised groups in line with its Employment Equity Plan. Persons with disabilities are encouraged to apply.\n\nPlease note that correspondence and communication will only be conducted with short listed candidates and that the FSCA reserves the right not to appoint if a suitable candidate is not identified. \n\n\nRequirements\nA National Diploma in IT or Computer Systems or equivalent. A+ or N+ITIL Foundation certification. Minimum 1-2 years of Desktop Support Experience. \n \nClosing Date: 4 October 2024\n \nWork Level Junior\nJob Type Permanent\nSalary Market Related\nEE Position Yes\nLocation Pretoria\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "p30fb8c72-eb01-4fa8-8705-8bc1b8f68056"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/idc-logo_orig.jpg",
            "href": "https://www.govpage.co.za/industrial-development-corporation-idc-vacancies-blog/industrial-development-corporation-idc-vacancies9667406",
            "title": "INDUSTRIAL DEVELOPMENT CORPORATION (IDC) VACANCIES",
            "content": [
                " \nINDUSTRIAL DEVELOPMENT CORPORATION (IDC)\n ",
                " \n \nPROJECT FINANCE SPECIALIST\nJob number IDC00377\nJob Grade P-Band\nClosing date 10-Oct-2024\n \nSynopsis\nInfrastructure South Africa (ISA) has the mandate to act as an Aggregator: Single Window of Entry & Custodian of the Country’s Infrastructure Project Pipeline. These compromises of national, provincial, municipal, public and or private sector role players.\n \nJob Description\nJOB PURPOSE:\nProject Finance Specialist will be responsible to identify, develop, and advocate for the implementation of innovative project finance instruments and structuring, inclusive of public-private partnerships (PPP) frameworks that leverage resources from the private sector to expand the delivery of infrastructure within South Africa through coordinating and supporting public sector entities.\nThe Specialist will be someone with solid project finance experience on a number of projects and in a number of sectors from a private sector financing perspective as well as experience in understanding the project risks to both public and private sector participants.\n \nQualification and Experience\nQUALIFICATION: \n• Degree or Honours degree (NQF Level 8) in Finance, Accounting, Actuarial Science, Economics (Related to Project Finance).\n• Registered professionally with the relevant bodies, recognised in South Africa will be an added advantage.\n• A PPP Recognised Certification programme will be an added advantage.\n \nEXPERIENCE AND KNOWLEDGE:\n• 5 – 8 years industry/sector(s) specific experience in project finance or structured finance (Above 8 years’ experience will be an added advantage).\n• Experience in monitoring and evaluating infrastructure projects.\n•Experience in working on PPP/ESG/Green Bonds projects will be an added advantage.\n• Infrastructure project development and/or project appraisal.\n• Monitoring major infrastructure projects in implementation.\n• Knowledge of applicable legislation, which includes (but not limited to) the Infrastructure Development Act, the Public Finance Management Act, the Municipal Finance Management Act, GIAMA, PPP Framework, Standards for Infrastructure Procurement and Delivery.\n• Solid understanding of both South Africa and further international experience and understanding with respect to Project Finance, project preparation, structuring, and transaction management, legal, policy, and institutional frameworks for innovative financing (inclusive of PPPs) and other forms of private participation in infrastructure, broader public investment and fiscal risk management.\n \nRoles and Responsibilities\nMAIN RESPONSIBILITIES:\n• Keep abreast with the developments in the Project Finance and PPP framework and the regulatory environment, and position ISAs value-add in this context.\n• Research into relevant innovative project financing instruments.\n• Draw on South African project experience and best international practice in providing guidance to government departments, provinces and municipalities seeking to develop and implement Project Finance instruments on their projects.\n• Advocating for the expansion of Project Finance options (inclusive of Blended finance options, PPP structuring, Green Bonds, ESG, and Impact Finance, etc.) in South Africa through actively matching projects to the most suitable Finance options in the infrastructure space.\n• Provide assistance to line departments in the preparation of initial project investment proposals for potential Innovative Financing & PPP projects, while cognisant of requirements to demonstrate affordability, value for money and optimised risk allocation.\n• Advise on the appropriate financial structure for projects based on a knowledge of the market’s ability to provide finance and bear risk, on a per project/ programme basis.\n• Advise government departments and other government entities on feasibility studies required in order to demonstrate project/programme viability (financial).\n• Evaluate the feasibility of investment opportunities/project transactions with a view to ensuring that they are sound prospects for financing.\n• Ensure that government’s explicit and implicit fiscal obligations and risks are determined in the feasibility study stage and that these are communicated from a risk and debt management unit and managed appropriately. This includes guarantees and other security instruments.\n• Analyse all financial models, both in the feasibility studies and in proposals submitted as part of the competitive bidding process to ensure that the projects are affordable, financially sound and sustainable with appropriate risk allocation.\n• Support the procurement and briefing of external financial advisors or subject matter experts, as and when necessary, for identified projects or research.\n• Collaborate with the ISA Technical Services Office to ensure that the financing structure of projects are sound and the involvement of state financial institutions is appropriate.\n• Provide assistance in the appointment of transaction advisors to assist in the project preparation feasibility study, ensuring that the study is of adequate quality for review.\n• Where relevant, provide assistance to the line departments with bidding processes as well as the negotiation and award of the PPP contracts and contract management.\n• Compile progress reports on innovative Project Finance (inclusive of PPP) projects receiving support from ISA and identify unblocking challenges experienced.\n• Conducting financial and economic analysis which needs to include the public sector’s fiscal capacity assessment, PPP risk analysis with PPP risk allocation matrix.\n• Providing recommendations for the final innovative financing implementation model based on evaluation of the results analysed.\n• Record and continuously monitor industry/client performance as it relates to the project.\n• Performing related tasks as required by the Programme Manager.\n \nJob Requirements\nBEHAVIOURAL COMPETENCY:\nStrong interpersonal ability.\nAttention to technical detail.\nTask orientated.\nReliability.\nPositive work ethic.\nProblem solving orientation.\nGood stakeholder engagement & networking ability.\nTechnical interpretation ability.\n \nTECHNICAL COMPETENCY:\nProblem identification & resolution skills.\nProcess analysis and improvement skills.\nProject Finance and modelling software skills.\nRisk analysis and mitigation skills.\nProject planning skills.\nMicrosoft office suite skills.\nTechnical report writing skills.\nTechnical information analysis skills.\n \nAPPLY NOW\n \n \n \n \n \n ",
                " \n \n \n \n \nSENIOR ENVIRONMENTAL, HEALTH AND SAFETY SPECIALIST\nJob number IDC00379\nJob Grade M Band\nClosing date 10-Oct-2024\n \nJob Description\nAnalyze, monitor and advise IDC on appropriate environmental and social risk appetite, climate change, and the Just Energy Transition; partner with SBUs and IDC investee companies to ensure good environmental and social performance; advance innovation and increasing maturity in environmental and social monitoring and reporting; and partner with Government and other stakeholders in dialogue on critical environmental and social aspects relevant for the South African context.\n \nQualification and Experience\nQUALIFICATIONS:\nMinimum qualification: relevant commercial or technical Bachelor's Degree or equivalent qualification.\nMasters degree in a relevant discipline, which may include environmental sciences, general or industrial chemistry or chemical engineering, civil engineering with specialization in an environmental area such as water management, geology, geography, biodiversity, ecology and others will be advantageous.\n \nEXPERIENCE:\n8-10 years relevant experience in the Environmental, Health and Safety field, or related field.\nUnderstanding of the legislative requirement relating to Occupational Health and Safety and Environment. \nKnowledge and exposure to a variety of industry sectors. \nExperience in engaging, managing and negotiating with relevant specialist bodies, governmental bodies, environmental groupings, etc.\nExperience in interacting and presenting to Senior and Executive leaders and various committees.\nA good understanding of the IDC’s operations.\nExperience working in a high-level collaborative environment\nAbility to manage multiple competing priorities while building effective relationships\nExtremely organized and persistent, with drive and determination to achieve goals.\nExtensive experience in reporting frameworks such as the International Integrated Report Framework, the various Global Reporting Initiative Reporting Frameworks (GRI), the various Carbon Disclosure Project (CDP) frameworks and others.\n• Extensive experience in environmental and social risk assessment and due diligence\n Extensive experience in environmental licensing requirements and processes\nExtensive experience in measuring and reporting on SDG-impact\nExperience in analyzing climate resilience at sector and project level\nExperience in analyzing climate-related financial risks and opportunities\nGood understanding in formulation and implementation of EHS Strategies and related concept\nKnowledge of international and local Sustainable Finance Taxonomies\n \nRoles and Responsibilities\nMAIN DUTIES AND RESPONSIBILITIES: \nInternal / Operational Processes\nProvide guidance on Environmental and Social issues to the Business Units and the organisation\nEnsure that the IDC leads through responsible environmental friendly and Sustainable investments, which reduce climate change impacts of industries.\nDevelop and maintain a good working knowledge of relevant legislation in South Africa and other countries where IDC operates.\nIncorporate key international and national frameworks into strategic advisory capacity for the Unit and the organization, including among others the Task Force for Climate-related Financial Disclosures (TCFD) and the Sustainable Development Goals (SDGs).  \nContribute towards the organization’s strategies on Environmental and Social issues which feed into sustainable development.\nEnsure that IDC’s Environmental and Social policies, standards and procedures remain aligned with current legislation and best practices locally and internationally.\nReview and update the IDC’s environmental policy to ensure alignment to changing circumstances and best practice on a regular basis.\nMonitor compliance with the IDC `s environmental policy by subsidiaries and existing clients, and advise on mitigation measures where necessary.\nMonitor environmental impact assessments conducted by the IDC, its subsidiaries and its clients for compliance to environmental legislation, efficiency, and compliance with procurement requirements.\nProvide assistance in the development and implementation of environmental management plans (EMPs) and environmental management systems (EMSs) at subsidiaries of the IDC.\nAsses and advise on Environmental, Health and Safety aspects of existing business partners and new projects under consideration for financing by the IDC, including defining the scope of work for environmental consultants and Lender Technical Advisors.\nMaintain contact with the regulatory authorities in areas of IDC operation aimed at elevating IDCs contribution to national and provincial dialogue on key aspects relevant to IDC’s investment portfolios.\nCoordinate and contribute toward relevant capacity building interventions on environmental and social aspects within IDC and with relevant stakeholders.\nCustomer Focus & Stakeholder Management\nTo effectively interact with different SBUs and departments in order to fulfil the process requirements\nManage and enhance the levels of service and communication to ensure the provision of client service excellence\n \nJob Requirements\nLEADERSHIP COMPETENCIES:\nResilience\nDecisiveness in Execution\nPeople Engagement\nCommunication and Engagement\nDiverse Stakeholder Management\nTeamwork\nInnovation\nChange leadership\nStrategic Thinking\nBusiness Mind Set\n \nTECHNICAL/FUNCTIONAL COMPETENCIES:\nRisk identification and mitigation\nEnvironmental Awareness & Insights\nProcess Improvement & Efficiency\nAnalytical and problem solving \nCustomer insights and focus\nPlanning and organising\nBusiness acumen\nResults and solution orientated\n \nBEHAVIOUR COMPETENCIES:\nPresentation and communication skills\nRelationship building and networking\nNegotiation skills\nInfluencing skills\nCritical thinking\n \nAPPLY NOW\n \n \n \n \n \n ",
                " \n \n \n \n \nSENIOR FINANCIAL ACCOUNTANT\nJob number IDC00372\nJob Grade P-Band\nClosing date 05-Oct-2024\n \nJob Description\nTo assist with Financial Reporting activities and be responsible for managing financial transactions, preparing financial reports, and ensuring compliance with regulatory requirements.\n\n\nQualification and Experience\nQualification\nBachelor's/post-graduate degree in Financial/Management accounting\nCA(SA) would be advantageous\nExperience\n5-8 years’ experience in financial services, the public sector, DFI space: PFMA Experience.\nExperience in IFRS 10, IAS 28, IFRS 9 and accounting for Expected Credit Losses\nExperience dealing with internal and external auditors.\nRelationship building skills – stakeholder management skills.\nExperience in preparing financial statements on Caseware\nKnowledge and experience in SAP\n \nRoles and Responsibilities\nKEY RESPONSIBILITIES\nAssist in preparation of separate Annual Financial Statements and Consolidated Group Annual Financial Statements.\nEnsure that all internal subsidiaries financial statements are timeously prepared and comply with IFRS.\nLiaising with both internal and external auditors.\nQuarterly reports to EXCO and the Board (movement commentary, variance analysis, graphs).\nQuarterly reports submitted to National Treasury and Reserve Bank.\nDaily and Monthly duties:\nActing as transactions poster into the SAP system.\nActing as checker, releaser for IDC payments (AP process).\nUpdating monthly listed share portfolio share prices and computing listed portfolio fair values in (ZIMP) SAP.\nUpdating the monthly fair value of shares workbook (listed and unlisted shares and non-SPPI preference shares) with the objective of parking the journals in SAP.\nPerforming share reconciliations between the share movement schedule, ZIMP and the general ledger.\nCustodian of share documents and tracking of share movements.\nAccounting for share and loans write-offs and disposals and ensuring the ECL releases relating to SPPI instruments are recorded in appropriate general ledger accounts (capital profits and losses workbook).\nPerform loans reconciliations between the loans trial balance, ZPR, and loan-book movement.\nPerform fixed asset register reconciliation review for IDC and internal subsidiaries.\nPerform VAT reviews for IDC and internal subsidiaries.\nPerform ad-hoc tasks for Manager: Financial Management and other departments.\nAttend various meetings on behalf of the manager and provide feedback.\nQuarterly duties:\nAssist in the quarterly mini-group management reporting. Provide inputs such as analytical review commentary on the statement of profit and loss and statement of financial position; assist in performing analysis of borrowings, loan book, shares, dividends, interest income, borrowings, impairments and write-offs.\nPerform National Treasury financial reporting (PE48, N01, N02, MTEF), Reserve Bank reporting (F02 and F04).\nInvestment Monitoring Committee minute reconciliation with SAP.\nECL uploading into SAP and journal parking.\nInterim and Year end duties:\nPerform IFRS 10 assessments for the investment type classifications of the share portfolio (to determine if our business partners are subsidiaries, associates, or simple investments).\nUpdating the group structure (subsidiary/associate/investment).\nDrafting and sending out letters to all associates and subsidiaries, as well as following up on outstanding letters at interim and year end consolidation process.\nAssist with the preparation of IFRS 9 notes, specifically Loans and advances to ensure that it is in compliance with IFRS 7: Disclosure of financial instruments.\nAssist with the preparation of IFRS 13: Fair value measurement notes.\nAssist with the review of IFRS 16: Leases.\nAssist with the preparation of IAS 28 investments in associates and joint ventures.\nAccounting for accruals, including dividends.\nBe a 1st – level reviewer in other notes to the interim and annual financial statement.\nAssist in financial results presentations and analysis (abridged financial statements, CFO reports, commentary, analysis, going concern assessments, share portfolio reporting etc.)\n \nJob Requirements\nTECHNICAL COMPETENCIES\nFinancial Modelling and data analysis\nDetail orientation and ability to analyse numerical data and to interpret financial statements.\nBusiness acumen\nPerformance Focus\nAnalytical Skills\n \nBEHAVIOURAL COMPETENCIES\nPersuading and Influencing\nDelivering results and meeting customer expectations\nSupporting and co-operating\nRelating and networking\nPlanning and organising\nWriting and reporting\nGood time management skills and the ability to perform under pressure.\nAbility to work independently and in teams\nKeen for new challenges and open to different ways of performing tasks\nAnalytical and attention to detail\n \nAPPLY NOW\n \n \n \n \n ",
                "SENIOR LEGAL ADVISOR\nJob number IDC00363\nJob Grade M Band\nClosing date 05-Oct-2024\n \nJob Description\nTo provide sound, clear and accurate legal advice to mitigate the legal risks that the IDC is exposed to in its daily activities.\nQualification and Experience\nQualification\nLaw degree and Admission as an Attorney essential\nMaster’s degree such as LLM desirable\nKnowledge & Skills \nA minimum of five years’ post-article experience in a banking and finance/corporate finance/project finance environment.\n8-10 years working experience in the banking and finance/SoE/DFI (restructuring, turnaround & business rescue) space is essential \nExperience in the drafting, review, negotiation and re-negotiation of cross-border, project finance, corporate, commercial, structured and re-structured finance transactions\n \nRoles and Responsibilities\nProvide general legal advice, including legal research\nStructure, restructure, negotiate and re-negotiate corporate and commercial transactions including project finance and cross-border financing transactions\nIdentify, evaluate and structure import and export finance transactions\nEnsure compliance with internal legal and other IDC procedures and policies\nIdentify and minimize potential legal risks\nDraft, review, negotiate and re-negotiate financing agreements and other legal documentation\nMake presentations and opine on legal and regulatory developments\nConducting legal due diligence investigations\nEnsure efficiencies aimed at improving client satisfaction by providing efficient legal services \nDeveloping and maintaining relationships with providers of legal services (including, external legal counsels, business rescue practitioners and other key stakeholders)\nDevelop and maintain client and institutional relationships, internally, locally and internationally\n \nJob Requirements\nTECHNICAL/FUCNTIONAL COMPETENCIES\nSound corporate and commercial legal knowledge\nAbility to work independently and within a team\nDraft and negotiate loan agreements and other legal documentation\nTransactional negotiations at senior level\nExcellent analytical and problem-solving skills\nExcellent communication and interpersonal skills\nIndependent judgement and good analytical skills\nCapable of working in a high-pressured environment and can exercise independent judgement\nAbility to prioritize and plan\nAbility to independently provide guidance and timeous delivery on highly complex projects\nAbility to coach and mentor juniors on areas of specialization\n\nGood knowledge and understanding of international and local financing instruments\n\nBEHAVIOURAL COMPETENCIES\nCollaboration and Influence: The successful candidate is a senior person who will be highly visible and credible with key internal and external stakeholders and proactive in aligning risk strategies to address the business.\nLeadership: This individual will possess excellent personal communication skills that engender credibility and confidence both inside and outside the IDC and a team-first mentality. Resourceful and a self-starter, the candidate will know how to make things happen through his or her people, while also being hands-on. The ideal candidate must have natural leadership abilities and be capable of crafting the vision and creating support from within.\nTeamwork: A true team player. Supportive of his or her team, peers and others across the organisation. Contributes to an atmosphere in which people work together, enthusiastically and effectively, in producing outstanding results.\nResults Oriented: Energetic, resourceful, sophisticated and savvy, with strong service orientation and positive “can-do” attitude. Fully committed to the job and to delivering outstanding work. Never satisfied with status-quo, continually striving for excellence. Enjoys working “hands-on”. Strong attention to detail.\nJudgment: Makes timely decisions while including necessary people in the decision-making process. Exhibits sound and rational judgment.\nCommunication: Possesses excellent written/oral communication skills as well as excellent persuasive and presentation skills. Able to deal effectively with a broad range of personalities and cultures.\nChange agent and strategic thinker: An innovative thinker who is comfortable designing for the future, while managing day-to-day matters.\n \nAPPLY NOW",
                "EXECUTIVE SECRETARY (3 MONTHS FTC)\nJob number IDC00382\nJob Grade A Band\nClosing date 04-Oct-2024\n \nJob Description\nThe overall purpose of this role is to provide:\n• A professional, confidential, efficient, effective and proactive office support function to manage the operational and administrative needs of the office of the Divisional Executive and the Division.\n• To enable a timeous and responsive service to key internal and external stakeholders on business matters requiring focus and attention.\n \nQualification and Experience\nQualification: \nMatric\nFurther Relevant Qualification (Eg Business Administration) \n \nExperience: \nAt least have a minimum 5 years’ experience as an Office Manager/Executive Secretary in a fast paced and complex environment.\n \nJob Related Knowledge (knowledge of systems, processes, regulations or law)\nIDC policies, processes, systems procedures and business understanding\nKnowledge of data and administrative management practices and procedures, business and management principles\nRelevant HR Legislation (e.g. LRA, BCEA etc.)\nSAPHR\nFinance for Human Capital\n \nRoles and Responsibilities\n \nSecretarial and Administrative Divisional Executive Support\n \n1. Office Co-Ordination and Support\n• Ensure that key operational matters and requests are handled expeditiously\n• Assist to draft key memos/documents/letters of response both internally and externally\n• Ensure relevant documentation is readily available as may be required to support the Divisional Executive for engagements\n• Management and control of highly confidential information requiring extreme discretion and privacy of such material and/or situation\n \n2. Customer Focus and Stakeholder Management\n• Engage both internal and external stakeholders professionally, sensitively and tactfully to understand and respond to the request/business need and/or obtain additional information\n• Ensure accurate record keeping and documentation trail on matters attended and responded to\n• Ensure regular updates and feedback are provided to stakeholders as may be required\n• Provide an efficient customer-centric service to the IDC Board, Board Human Capital and Nominations Committee (BHCNC) Chair and external stakeholders\n• Ensure a professional and customer centric ‘meet and greet’ function that welcomes visitors to the IDC and leaves a positive impression and positive moment of truth on each and every individual\nDevelop, maintain and build effective networks and relationships with other Executives, colleagues and clients that drive trust and facilitate engagement and mutual commitment to support deliverables and outcomes as and when required\n \n3. Learning & Growth\n• Proactively drive own development and understanding of the Division and the Corporation\n• Participate in knowledge sharing and other forums to enhance knowledge, understanding and operations\n• Regularly participate in team meetings, including highlighting issues and owning actions through to resolution.\n \n4. Financial Prudence and Due Diligence\nTo ensure correctness, accuracy and timeous processing of all financial related transactions (invoices, travel claims, stationary requisitions etc.)\n \n5.  Administrative & Ad-Hoc outcomes\n• Proactively assist to manage the information flow/correspondence (email, letters, memos etc.) of the office of the Executive and based on the urgency and importance of matters to alert the Divisional Executive accordingly\n• To professionally and timeously respond to and manage correspondence that is routine and non-critical so as to alleviate the volume of communication proactively\n• Assist in the preparation of reports, presentation slides and other documentation as may be required\n• Managing the scheduling of Divisional Executives commitments and their availability in a manner that is efficient, balanced and allows for time to attend to matters outside of meetings and committee commitments\n• Drafting, vetting, approval and circulation of minutes as required, ensuring accuracy and timorousness distribution\n• Manage and co-ordinate events/functions/engagements in a manner that such run smoothly and seamlessly and build the brand and reputation of the Division\n• Prepare/co-ordinate/edit internal newsletters, reports, documents and executive summaries and ensure conclusion and distribution of such\n• Maintain a confidential, accurate, easily accessible and logical electronic and/or hard copy filing system that facilitates ease of access\n• Co-ordinate travel itineraries and arrangements that ensure the Divisional Executives travel plans are practical, efficient and hassle free\n• Ensure all documentation that emanates from the Divisional Executives Office are professional, accurate, consistent and presentable to be achieved\n \n6.  Execution and Follow Through\n• To optimize service delivery in a manner that address clients’ needs and is in line with the Customer Service Charter of the Corporation\n• In all interaction and responses ensure the values of the Corporation\n• To share ideas for improvement in the management of the operational and administrative demands of the Divisional Executive\n\nAPPLY NOW"
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "pc1bc30a1-85c2-4610-b4c5-df687b2bce3d"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/national-gambling-board-ngb.jpg?1727713257",
            "href": "https://www.govpage.co.za/national-gambling-board-of-south-africa-ngb-vacancies-blog/national-gambling-board-of-south-africa-ngb-vacancies5033794",
            "title": "NATIONAL GAMBLING BOARD OF SOUTH AFRICA (NGB) VACANCIES",
            "content": [
                " \nNATIONAL GAMBLING BOARD OF SOUTH AFRICA (NGB)\n ",
                "MANAGER: CORPORATE GOVERNANCE \nReference Number: NGB/004-2024 \nNature of Employment – Twelve (12) Months Fixed Term Contract position \nRemuneration Scale: R931,613 – R1,126,237 per annum \n(all-inclusive package) \nPreference will be given to Coloured Male and Female, White Male and Female, Indian Male and people with disabilities \n \nBRIEF SUMMARY OF THE ACT \nThe National Gambling Board (NGB) is established in terms of the National Gambling Act, (NGA) 2004 (Act 7 of 2004). It is a schedule 3A Public Entity in terms of the Public Finance Management Act, 1999 (Act 1 of 1999). The NGB makes provision for the coordination of concurrent national and provincial legislative competence over matters relating to the continued regulation of gambling activities and also makes provision for the establishment of uniform norms and standards applicable throughout the Republic in certain gambling activities. \n \nSTRATEGIC OUTCOMES \nThe strategic outcomes stated below straddle and apply across all positions within the NGB. Successful incumbents will be required to execute their functions in consideration of the following strategic outcomes: \nAccount for and identify all legal gambling machines, devices and owners, licensed juristic and natural persons and excluded persons; \nEconomic transformation and increased participation of Historically Disadvantaged Individuals in the mainstream gambling industry; \nEffectively monitored PLA compliance with gambling legislation; \nFacilitated S16 confiscation of proceeds from illegal gambling activities; \nEffectively monitored socio-economic patterns of gambling activity within the Republic; \nUniformity of legislation in the gambling industry; and \nBroad-based public education \n \nPURPOSE\nTo provide support, develop and implement the corporate governance and risk management framework thereby enabling prudent management of the National Gambling Board’s performance in compliance with relevant legislation to guarantee delivery on the shareholders compact in line with National Priorities. \nKEY PERFORMANCE AREAS \nManagement of Corporate Governance \nAdvises on strategic corporate risks and proposes mitigating strategies during development of the Annual Performance Plan (APP). \nDevelops the Corporate Governance Framework within the National Gambling Board to ensure compliance with corporate governance - King VI and other legislative provisions. \nAssists departments to overcome challenges preventing compliance with the Corporate Governance Framework. \nMonitors complaints from stakeholders and ensures that all complaints are investigated and proper feedback is provided to complainants. \nMonitors and reports on the timeous implementation of audit recommendations. \nAssesses the National Gambling Board’s compliance with the Public Finance Management Act (PFMA). \nParticipates in the Audit, Risk and Management Committees to provide expert contributions. \nAssists with ad-hoc coordination of all aspects of corporate governance administration.\n \nOrganisational Performance Planning and Reporting \nMonitors performance within the National Gambling Board by preparing monthly and quarterly performance reports to ensure alignment with the APP and Shareholder’s Compact. \nConsolidate inputs on monthly and quarterly organisational performance reports. \nCoordinates the preparation of the Annual Report and Strategic Plan, Annual Performance Plan, Organisational Plan and submits to Chief Strategic Adviser (CSA) for review. \nConsolidate inputs on annual report. \nManages compliance audits and reports findings to CSA. \nUpdate reporting templates (MANCO, quarterly reports, and business plan) periodically as needed. \nDevelop and monitor the implementation of Operational Compliance Calendar. \n \nRisk Management \nImplements measures to identify, assess, mitigate and report on operational and strategic risks within the National Gambling Board throughout the year. \nAssist with the identification, assessment, monitoring of strategic and operational risks for the NGB during the risk management process. \nMonitor risk management and provide reports on a monthly and quarterly basis. \nProvide administrative support during workshops and preparing draft registers for engagement with clients. \nProvide Secretariat support to the Risk Management Committee (RMC). \n \nFraud Prevention \nDevelops the Fraud Prevention Plan (FPP) and implementation matrix that is communicated to all stakeholders. \nDevelops the Fraud Prevention Plan and implementation matrix that is communicated to all stakeholders. \nConduct fraud awareness sessions through various platforms, internal and external. \nProviding logistical and administrative support to the CSA to ensure that both internal and external activities are undertaken. \nPrevent fraud and misappropriation in the organisation. \nEnsure that agreed quality controls in place are fully understood and implemented. \nEnsure and improve the efficiency and quality services in order to reduce exposure to fraud, abuse and wastage of resources. \nMonitor the implementation of the Fraud Prevention Plan through monthly and quarterly reporting. \nUpdate FPP and facilitate the annual review of the FPP. \nCoordinating cases and enquiries reported through ethics help desk and coordinate the ethics workshops/training/events. \nCoordinate and facilitate organisational processes relating to ethics awareness and management. \n \nFinancial Disclosures \nCoordinating the submission of financial disclosures annually. \nScanning every application and sending confirmation mails to all officials. \nAnalysing the data disclosed in the disclosure forms and drafting a report of the results. \nDevelop and manage the financial disclosure database. \n \nRemunerative work \nCo-ordination of the remunerative work applications. \nProvide guidance and advice on all issues pertaining to the remunerative work process. \nUpdate the remunerative work database on a continuous basis and assist with drafting reports. \n \nFinancial Management \nProvide inputs into strategic annual report and ensure that expenditure is in line with approved budget. \n \nRecords Management \nEnsure that records management is performed in accordance with NGB approved file plan and electronic document management system. \n \nMINIMUM JOB REQUIREMENTS \nQualifications\nNational Diploma or Bachelor’s Degree in Internal Audit / Commerce (General)/ Business Management/ Administration or in Law. \n \nExperience\nEight (8) years’ relevant experience in corporate governance. \nFive (5) years’ relevant experience in a management position. \n \nCompetence and skills \nThe appointee must have the following skills: \nProcess Management \nRelationship Management \nMonitoring and Evaluation \nCorporate communication \nRisk Management \n \nThe appointee must have the following knowledge in terms of legislations: \nKnowledge of National Gambling Act. \nPublic Finance Management Act. \nKnowledge of National Treasury guidelines & regulations. \n \n \nThe successful applicants’ remuneration package will be in terms of the NGB Remuneration Policy. The National Gambling Board subscribes to the principles of Employment Equity. \n \nThe appointee will be required to sign a performance agreement within one (1) month of joining the organisation and this position is subject to a twelve (12) months’ probation period. \n \nTo apply for this position, interested applicants are required to complete the NGB employment application form to be obtained from NGB’s website www.ngb.org.za, attach and complete the following mandatory documents i.e. comprehensive CV, copies of qualifications and identity document. Failure to submit all requested documents will disqualify your application. \n \nThe completed application with all supporting documents must be submitted by e-mail to hr@basadzi.co.za, hand delivered to the NGB offices at 1085 Francis Baard Street, Hatfield, 0028 or posted to the Human Capital Optimisation, Private Bag x 27, Hatfield 0028. \n \nCLOSING DATE for all applications: 07 OCTOBER 2024 \n \nBackground verifications, criminal record checks, citizenship check and competency assessment will form part of the selection process. It is the responsibility of candidates or applicants with foreign qualifications to have them verified by the South African Qualifications Authority (SAQA). If you have not been contacted within three months after the closing date, please regard your application as unsuccessful. \n \nIMPORTANT NOTICE \nBy applying for this position, you hereby acknowledge that you have read and accept the following Protection of Personal Information Act (POPIA) disclaimer: \nI hereby consent for NGB to process my personal information as part of the recruitment process. NGB shall take all reasonable measures to protect the personal information of applicants and for the purpose of this disclaimer “personal information” shall be defined as detailed in the Protection of Personal Information Act, Act 4 of 2013 (POPIA”).\n\nThe NGB reserves the right not to fill the position.",
                "PERSONAL ASSISTANT TO THE CHIEF STRATEGIC ADVISER \nReference Number: NGB/005-2024 \nNature of Employment – Permanent position \nRemuneration Scale: R503,364 – R654,617 per annum (all-inclusive package) \n\nPreference will be given to Coloured Male and Female, White Male and Female, Indian Male and people with disabilities \n \nBRIEF SUMMARY OF THE ACT \nThe National Gambling Board (NGB) is established in terms of the National Gambling Act, (NGA) 2004 (Act 7 of 2004). It is a schedule 3A Public Entity in terms of the Public Finance Management Act, 1999 (Act 1 of 1999). The NGB makes provision for the coordination of concurrent national and provincial legislative competence over matters relating to the continued regulation of gambling activities and also makes provision for the establishment of uniform norms and standards applicable throughout the Republic in certain gambling activities. \n \nSTRATEGIC OUTCOMES \nThe strategic outcomes stated below straddle and apply across all positions within the NGB. Successful incumbents will be required to execute their functions in consideration of the following strategic outcomes: \nAccount for and identify all legal gambling machines, devices and owners, licensed juristic and natural persons and excluded persons; \nEconomic transformation and increased participation of Historically Disadvantaged Individuals in the mainstream gambling industry; \nEffectively monitored PLA compliance with gambling legislation; \nFacilitated S16 confiscation of proceeds from illegal gambling activities; \nEffectively monitored socio-economic patterns of gambling activity within the Republic; \nUniformity of legislation in the gambling industry; and \nBroad-based public education \n \nPURPOSE\nTo provide secretarial support to the Chief Strategic Adviser (CSA) and an administrative support function on all matters within the office. \n \nKEY PERFORMANCE AREAS \nDiary Management and Meeting Coordination \nManages the diary with guidance from the CSA by diarising and scheduling meetings promptly and correctly. \nRecords meetings on electronic calendar to allow for viewing by the CSA. \nSecures boardrooms and arranges refreshments for the CSA’s visitors. \nMeets and greets CSA’s visitors on arrival at the National Gambling Board to escort them through to the Office / Boardroom. \nFollows up on action items from meetings to ensure completion within stipulated deadlines. \nPrepares itinerary that includes details regarding dates, travelling times, maps / directions, addresses, phone numbers, e-mail addresses, parking and contact persons. \nChecks travel plans a few days prior to departure to ensure all is in order. \nSubmits approved travelling claims for payment upon the CSA’s return for purposes of re-imbursement. \n \nSecretarial support \nTypes business letters, memorandums and general correspondence for internal and external purposes. \nAssists with preparing of meeting packs. \nAssists with collating information for preparation of meetings. \nCoordinates responses to routine correspondence for the Office of CSA. \nTranscribes minutes of meetings distributes to relevant role players. \n \nOffice support \nScreens telephone calls to prevent unnecessary interruptions. \nCorrectly records and relay’s messages promptly to the CSA. \nAddresses queries from stakeholders and / or channels queries to correct role players. \nActs as the Point of contact for within the CSA’s office to ensure smooth operations. \nMaintains an effective filing system for ease of tracking and retrieval of documents. \nDevelops a database of contacts and updates regularly to ensure current information. \nDevelops good working relations with relevant personnel for ease of execution of duties.\nProvides ad-hoc administrative assistance as and when required. \n \nAdministration of performance information \nEnsures that all direct reports of the CSA have scorecards in place. \nCoordinates the performance management process between the CSA and direct reports. \nEnsures performance agreement of direct reports are signed, submitted on time and filed for easy reference. \nEnsures quarterly reviews take place and assessment sheets are signed and filed. \nFollows up on action items in relation to performance improvement for direct reports. \nTracks performance progress of direct reports in relation to the overall goals on the performance agreement of the CSA. \n \nRecords Management \nEnsure that records management is performed in accordance with NGB approved file plan and electronic document management system. \n \nMINIMUM JOB REQUIREMENTS \nQualifications\nThree years National Diploma or Degree in Administration or Management. \n \nExperience\nFive (5) years relevant experience as a Personal Assistant of which three (3) years relevant secretarial experience to an Executive Manager. \n \nCompetence and skills \nThe appointee must have the following skills: \nTyping\nBusiness English \nCommunication\nKeeping Minutes \nCoordination\nThe appointee must have the following knowledge in terms of legislations: \nPublic Finance Management Act. \nKnowledge of National Treasury guidelines & regulations. \n \n \nThe successful applicants’ remuneration package will be in terms of the NGB Remuneration Policy. The National Gambling Board subscribes to the principles of Employment Equity. \n \nThe appointee will be required to sign a performance agreement within one (1) month of joining the organisation and this position is subject to a twelve (12) months’ probation period. \n \nTo apply for this position, interested applicants are required to complete the NGB employment application form to be obtained from NGB’s website www.ngb.org.za, attach and complete the following mandatory documents i.e. comprehensive CV, copies of qualifications and identity document. Failure to submit all requested documents will disqualify your application. \n \nThe completed application with all supporting documents must be submitted by e-mail to hr@basadzi.co.za, hand delivered to the NGB offices at 1085 Francis Baard Street, Hatfield, 0028 or posted to the Human Capital Optimisation, Private Bag x 27, Hatfield 0028. \n \nCLOSING DATE for all applications: 14 OCTOBER 2024 \n \nBackground verifications, criminal record checks, citizenship check and competency assessment will form part of the selection process. It is the responsibility of candidates or applicants with foreign qualifications to have them verified by the South African Qualifications Authority (SAQA). If you have not been contacted within three months after the closing date, please regard your application as unsuccessful. \n \nIMPORTANT NOTICE \nBy applying for this position, you hereby acknowledge that you have read and accept the following Protection of Personal Information Act (POPIA) disclaimer:\nI hereby consent for NGB to process my personal information as part of the recruitment process. NGB shall take all reasonable measures to protect the personal information of applicants and for the purpose of this disclaimer “personal information” shall be defined as detailed in the Protection of Personal Information Act, Act 4 of 2013 (POPIA”). \n \nThe NGB reserves the right not to fill the position."
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "pce75e079-d49c-4ffb-942b-7858385f11f2"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/national-home-builders-registration-council-nhbrc.png?1727739185",
            "href": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies9452390",
            "title": "NATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC) VACANCIES",
            "content": [
                " \nNATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC)\n ",
                " \n \n \nTEMPORARY SENIOR BUSINESS ANALYST\nCONTRACT TYPE: TEMPORARY (12 MONTHS)\nJOB GRADE: COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\nREPORTING TO: CHIEF INFORMATION OFFICER\nDEPARTMENT/SECTION: BUSINESS MANAGEMENT SOLUTIONS\nLOCATION: HEAD OFFICE, SUNNINGHILL JHB                                        \n \nKEY DELIVERABLES\nWe are seeking a highly skilled and experienced Senior Business Analyst, the ideal candidate will have a strong background in business analysis, excellent problem-solving skills, and the ability to translate business requirements into technical solutions. This role involves working closely with stakeholders to understand their needs, analyzing business processes, and providing strategic recommendations to drive business improvements.\nThe Individual will primarily be responsible for, but not limited to the following:\nRequirement Gathering: Engage with stakeholders to gather, analyse, and document business requirements.\nBusiness Process Analysis: Analyse and evaluate existing business processes, identifying areas for improvement and optimization.\nSolution Design: Collaborate with technical teams to design and implement solutions that meet business needs and align with organizational goals.\nDocumentation: Prepare detailed documentation including business requirements, functional specifications, process flows, and use cases.\nStakeholder Management: Act as a liaison between business stakeholders and technical teams, ensuring clear communication and understanding.\nProject Management: Assist in project planning, coordination, and management to ensure timely delivery of solutions.\nData Analysis: Conduct data analysis to support business decision-making, identify trends, and provide actionable insights.\nTesting and Validation: Develop and execute test plans to ensure the functionality and performance of implemented solutions.\nTraining and Support: Provide training and support to end-users to ensure successful adoption of new systems and processes.\nContinuous Improvement: Stay updated with industry trends and best practices, continuously seeking opportunities to enhance business processes and solutions.\n \nMINIMUM REQUIREMENTS:\nBachelor’s degree in business administration, Information Technology, or related fields.\nMinimum of 5 years of experience in business analysis or a related field.\nProven experience in managing and delivering complex projects.\nProficiency in business analysis tools and methodologies\nStrong understanding of software development lifecycle (SDLC).\nExperience with data analysis and visualization tools (e.g., Excel, Power BI, Tableau).\nFamiliarity with project management tools (e.g., JIRA, Trello, MS Project).\nCertified Business Analysis Professional (CBAP) or equivalent certification is a plus.\nExperience with Agile development methodologies.\nKnowledge of business process modeling (BPM) and improvement techniques.\nExperience in the specific industry or domain relevant to the company’s business.\n \nAPPOINTMENT\nThe above-mentioned position will be offered on a temporary basis with a basic salary.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMr. Jabulani Ntshani\nTel: (011) 317 0496\n \nCLOSING DATE: 05 October 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Temporary Senior Business Analyst” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates shall be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups.\n \n \n \n \n \n ",
                " \n \n \n \n \n \nTEMPORARY SENIOR SOFTWARE ENGINEER\nCONTRACT TYPE: TEMPORARY (12 MONTHS)\nJOB GRADE: COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\nREPORTING TO: CHIEF INFORMATION OFFICER\nDEPARTMENT/SECTION: BUSINESS MANAGEMENT SOLUTIONS\nLOCATION: HEAD OFFICE, SUNNINGHILL JHB                                        \n \nKEY DELIVERABLES\nWe are looking for a highly skilled and experienced Senior Software Engineer proficient in Microsoft Visual Studio (C#), Database Administration, and Microsoft DevOps. The ideal candidate will have a strong background in software development, database management, and continuous integration/continuous deployment (CI/CD) practices. This role involves designing, developing, and maintaining applications, managing databases, and implementing DevOps practices to streamline the development lifecycle.\nThe Individual will primarily be responsible for, but not limited to the following:\nSoftware Development:\nDesign, develop, and maintain applications using Microsoft Visual Studio and C#.\nCollaborate with cross-functional teams to define, design, and ship new features.\nWrite clean, scalable, and efficient code.\nConduct code reviews and provide feedback to ensure best practices are followed.\nDatabase Administration:\nDesign, implement, and maintain robust database systems.\nPerform database tuning, optimization, and query analysis.\nEnsure data integrity and security.\nPerform regular database backups and recovery operations.\nTroubleshoot and resolve database-related issues.\nDevOps Practices:\nImplement and manage CI/CD pipelines using Azure DevOps.\nAutomate deployment processes to various environments.\nMonitor and manage application performance and infrastructure.\nCollaborate with development and operations teams to ensure smooth deployments and operations.\nImplement infrastructure as code using tools like Terraform or ARM templates.\n \nMINIMUM REQUIREMENTS:\nBachelor’s Degree in Computer Science, Information Technology, or related fields.\nMinimum of 5 years of experience in software development using Microsoft Visual Studio and C#.\nExtensive experience in database administration (preferably SQL Server).\nProven experience in implementing and managing DevOps practices.\nCertifications in relevant technologies (e.g., Microsoft Certified: Azure Developer Associate, Microsoft Certified: Azure Database Administrator Associate).\nExperience with Agile development methodologies.\nKnowledge of infrastructure as code tools (Terraform, ARM templates).\n \nAPPOINTMENT\nThe above-mentioned position will be offered on a temporary basis with a basic salary.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMr. Jabulani Ntshani\nTel: (011) 317 0496\n \nCLOSING DATE: 05 October 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Temporary Senior Software Engineer” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates shall be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups.\n \n \n \n \n \n ",
                "TEMPORARY ICT INFRASTRUCTURE MANAGER\nCONTRACT TYPE: TEMPORARY (12 MONTHS)\nJOB GRADE: COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\nREPORTING TO: CHIEF INFORMATION OFFICER\nDEPARTMENT/SECTION: BUSINESS MANAGEMENT SOLUTIONS\nLOCATION: HEAD OFFICE, SUNNINGHILL JHB                                             \n \nKEY DELIVERABLES\nThe ICT Infrastructure Manager is responsible to execute on the NHBRC ICT vision and for developing and implementing Information Technology initiatives that align with the mission of NHBRC. Execute the planning and implementation of enterprise Information Technology systems in support of NHBRC operations in order to improve cost effectiveness, service quality and mission development.\n\nThe Individual will primarily be responsible for, but not limited to the following:\nManage the functional budget and execute on the financial management of the function.\nManage Service Level Agreements with service providers.\nEnsure cost optimisation measures are in place within division.\nImplement and effectively manage the approved budgets, report variances and monitor the implementation of remedial actions to minimise impact.\nContribute to the development and implementation of the ICT strategy aligned to business strategy and in line with Government Planning framework.\nExecute on the implementation plan the of ICT Strategy.\nProvide effective IT service delivery by implementing ICT Infrastructure in the organisation.\nImplement business applications that match business requirements.\nEnsure optimal functioning and maintenance of the NHBRC Infrastructure systems.\nResponsible to provide adequate technical infrastructure capabilities.\nSupport the CIO as the Custodian of the NHBRC IT governance and infrastructure framework.\nManage the IT risk management in the infrastructure implementation and maintenance.\nManage the team in realising the organisation’s strategic objectives.\nManage performance measures to evaluate the success of architecture implementation.\nManage specified performance measures aligned with strategic objectives.\nManage risks in collaboration with Risk Management.\nExecute on the strategic plans in the organisation.\nApply operational planning and execution methods and tools.\nEstablish broad stakeholder involvement and communicates the project status and key milestones.\nDefines roles and responsibilities for project team members and clearly communicates expectations.\nBalances quality of work with deadlines and budget.\nIdentifies and manages risks to the project by assessing potential risks and building contingencies into project plan.\nSets and manages service level agreements with service providers.\nImplements appropriate ICT reporting processes to the Council, ARMCO, CEO, Executive Committee, and Senior Management and facilitate ICT Infrastructure team to apply reporting protocols, including quantitative and qualitative thresholds, and monitor the reporting process.\nImplement policies and procedures to direct the ICT Infrastructure function.\nEnsure compliance to Public Finance Management Act, Corporate Governance and other relevant Treasury regulations requirements.\nEnsure that audit requests are promptly adhered too within the stipulated timelines.\nMaintain and update Risk Register and implement remedial plans for the BMS division.\nBuild client relationships by demonstrating professionalism, appropriate self-confidence, a facilitative communication style and\nconstructive responses to client needs.\nMaintain positive interpersonal relationships with team members and others by demonstrating productivity, initiative and flexibility.\nEducate management and users on Infrastructure Technology installations.\nEstablish and maintain lines of communication and systems of reporting within the organisation.\nInform on Infrastructure performance to CIO and at MANCO meetings.\nRepresent the organization at stakeholder forums as directed by the CIO or COO.\n \nMINIMUM REQUIREMENTS:\nBachelor’s Degree in Computer Sciences/Engineering/Business Management or related fields\nIT Service Management Certification (ITIL)\nRelevant Project Management qualification will serve as an added advantage\nRelevant Post Graduate qualification will serve as an added advantage\nInformation Security Certification will serve as an added advantage\nMinimum ten years operational experience in ICT Management\nMinimum 3-5 years’ operational experience in Financial Management\nMinimum 3-5 relevant Leadership/ Staff Management experience at managerial level.\n \nAPPOINTMENT\nThe above-mentioned position will be offered on temporary basis with a basic salary.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMs. Jabulani Ntshani\nTel: (011) 317 0496\n \nCLOSING DATE:  05 October 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Temporary ICT Infrastructure Manager” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates will be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups.",
                "TEMPORARY SENIOR SAP ABAP K4/K5\nCONTRACT TYPE: TEMPORARY (12 MONTHS)\nREPORTING TO : CHIEF INFORMATION OFFICER\nDEPARTMENT/SECTION: BUSINESS MANAGEMENT SOLUTIONS\nLOCATION: HEAD OFFICE, SUNNINGHILL.\n \nKEY DELIVERABLES:\nWe seek a highly skilled and experienced Senior SAP ABAP K4/K5 Developer, the ideal candidate will possess deep technical expertise in SAP ABAP and a comprehensive understanding of SAP modules. This role involves designing, coding, testing, and implementing complex SAP applications and customizations to meet advanced business requirements and mentoring junior developers.\nThe Individual will primarily be responsible for, but not limited to the following:\nDevelopment and Customization: Design, develop, test, and implement advanced SAP ABAP applications and customizations.\nTechnical Leadership: Lead technical design sessions, provide guidance and mentorship to junior developers, and ensure best practices in coding standards.\nComplex Reports and Interfaces: Develop complex SAP reports, interfaces, conversions, enhancements, forms, and workflows.\nData Dictionary Management: Create, manage, and optimize SAP Data Dictionary objects including tables, views, data elements, and domains.\nPerformance Optimization: Analyze and optimize performance of SAP applications, ensuring efficient and scalable solutions.\nProject Management: Lead or participate in SAP project implementations, ensuring alignment with business requirements and project timelines.\nIntegration: Work on integrations with other SAP modules and third-party systems using SAP integration technologies such as IDocs, ALE, and RFC.\nCode Review and Quality Assurance: Conduct thorough code reviews and enforce quality assurance standards to maintain high-quality codebase.\nDocumentation and Training: Maintain comprehensive documentation of all development work and provide training to team members and end-users as necessary.\nSupport and Troubleshooting: Provide expert-level support and troubleshooting for existing SAP applications and customizations.\n \nMINIMUM REQUIREMENTS:\nBachelor’s degree in Computer Science, Information Technology, or related fields.\nMinimum of 7 years of experience in SAP ABAP development.\nProven experience with multiple SAP modules such as CRM, MM, SD, FI, CO, HR, PI, SAP NetWeaver Gateway, etc.\nSAP certification in ABAP or related SAP technologies.\nSAP certified development specialist.\nExperience with Agile development methodologies.\nKnowledge of DevOps practices and tools.\nFamiliarity with cloud-based SAP solutions and integration\n \nAPPOINTMENT\nThe above-mentioned position will be offered on temporary basis with a basic salary.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMr. Jabulani Ntshani\nTel: (011) 317 0496\n \nCLOSING DATE: 05 October 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Temporary Senior SAP ABAP K4/K5” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates will be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups."
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "pdb204308-22a2-4e95-9ba3-6970dbdaab6a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/nlc_orig.jpg",
            "href": "https://www.govpage.co.za/national-lotteries-commission-nlc-vacancies-blog/national-lotteries-commission-nlc-vacancies8567283",
            "title": "NATIONAL LOTTERIES COMMISSION (NLC) VACANCIES",
            "content": [
                " \nNATIONAL LOTTERIES COMMISSION (NLC)\n \nThe National Lotteries Commission (NLC), a Scheduled 3A entity in terms of the Public Finance Management Act (PFMA), is a statutory body established in terms of the Lotteries Act (Act 57 of 1997), as amended with the purpose of regulating South African Lotteries and administering the National Lottery Distribution Trust Fund (NLDTF). Suitably qualified prospective candidates who are South Africans citizens are invited to submit their applications to fill the position listed below. The National Lotteries Commission is committed to the achievement and maintenance of diversity and equity in employment, especially in respect of race, gender, and disability. \n ",
                "KWAZULU-NATAL PROVINCIAL OFFICE \nPROVINCIAL MANAGER – KWAZULU-NATAL \n \nPURPOSE OF THE JOB \nTo manage the provincial programme activities and staff working in close collaboration with the respective head office divisions and other provincial managers. This includes overall planning and coordination of resources, and execution or activities relating to application for grant funding, monitoring, and compliance enforcement in line with the strategies and policies of NLC. The Provincial Manager will also take responsibility for office administration, staff supervision, stakeholder management as well as improvement of the provincial office profile. \nSALARY:\n•                Commensurate with qualifications and experience \n \nREQUIRED QUALIFICATIONS \nAppropriate Post Graduate degree or equivalent \nProject Management, Monitoring & Evaluation, Development Studies and Financial Management will be an added advantage \n \nREQUIRED WORK EXPERIENCE \n5 years in related experience \n3 years relevant functional experience in a management position \nValid driver’s license \nBe prepared to travel and work under pressure to meet deadlines \nKnowledge of the geographic area to be served by the provincial office is recommended \nProficiency in two or more of the official/main provincial languages is recommended \n \nKEY DELIVERABLES \nDevelop Provincial Strategy Development and Implementation \nEstablish strategies, goals and objectives of the region in line with the NLC strategy and vision and ensuring there in delivery according to the business plan. \nEnsure that NLC activities are consistent with the direction set in the approved grant application process, to the grant recipient \nSupervise and plan effective programme implementation across the province in collaboration with relevant NLC divisions. \nEnsure Application Processing \nResponsible for the Provincial Coordination of the grant application process \nPresent project updates at the Board meetings as requested \nMonitor all phases of award and closing, including assessment of technical progress and performance \nContribute to the Improved Capacity of Applicants to Access NLDTF Grants \nContribute to improved capacity of grantees to utilize funds for intended purposes and to report on NLC funded projects \nMonitoring and Evaluation of grants \nCoordination of the Monitoring and compliance enforcement at the regional level \nCommunication and Stakeholder Liaison \nBe the contact person for NLC in the Province \nImprove awareness of the NLDTF through good communication and strengthening stakeholder relationships in the region. \nPrimary responsibility is the administration of the Provincial office and the supervision of all regional staff \nManage and oversee the regional team performance through performance planning, coaching and performance appraisals \nPrepare budgets for the provincial office. \nUndertake provincial special projects as assigned. \n \nCOMPETENCIES AND SKILLS \nKnowledge of the Lotteries Act and related regulations. \nKnowledge of PFMA and treasury regulations related to public entities. \nKnowledge and application of best practices in grant making. \nAbility to design and implement effective workflow processes and procedures. \nSound knowledge and experience in working with civil society. \nAbility to work independently, plan and prioritise. \nExcellent networking skills. \nPublic speaking ability. \nFinancial and project management skills. \nReport writing skills. \nPresentation skills. \nExcellent verbal and written communication skills. \nExcellent organisational skills and ability to multi-task. \nLeadership skills. \nPeople management skills. \n \n \nNote: Recommended candidates will be subjected to attend a generic managerial competency-based assessment. Background verification, social media checks and security vetting will form part of the selection process and successful candidates will be subjected to security vetting. Correspondence will be limited to shortlisted candidates only. If you have not been contacted within three (3) months of the closing date of this advertisement, please accept that your application was unsuccessful. The NLC reserves the right not to fill any advertised position(s).\n \nIMPORTANT NOTICE: APPLICATION INSTRUCTIONS: \nPlease clearly indicate the title of the position you are applying for in the subject line \nOnly candidates who meet the requirements should apply; \nCorrespondence will be entered into with shortlisted candidates only; \nCV`s from Recruitment Agencies will not be considered. \nApplications received after the closing date will not be considered. \nSubmit your comprehensive C.V with qualifications attached to the following email address: Recruitment@nlcsa.org.za\n \nCLOSING DATE: 9th of October 2024 \n \nNLC WELCOMES APPLICANTS WITH DISABILITIES \n \nDISCLAIMER- POPIA \nBy applying for NLC’s vacancy, you expressly give NLC consent to process your personal information stored in our history of all who have applied will be processed in accordance with the Protection of Personal Information Act 4 of 2013 (“POPIA”), the NLC Human Capital Policy/Procedures, the NLC’s POPIA Policy and the NLC’s Privacy Policy. These documents set out why the NLC needs the personal information, what NLC will do with it, and with whom the NLC will share it. Note that we will not further process the personal information stored automatically in this portal.",
                "INFORMATION COMMUNICATION TECHNOLOGY DIVISION \nICT SECURITY SPECIALIST – FULL TIME 24 MONTHS FIXED TERM CONTRACT \n \nPURPOSE OF THE JOB \nThe ICT Security Specialist is responsible for developing, implementing, and maintaining the organisation's information security strategy, ensuring alignment with ISO 27002/1 standards and COBIT 19 security domains. This role focuses on safeguarding sensitive data, systems, and infrastructure by overseeing security policies, conducting risk management activities, and leading efforts to prevent and respond to security breaches. The ICT Security Specialist will also review and implement controls to address audit findings, ensure compliance with technical cybersecurity standards, and maintain security policies and SOPs. \nSALARY:\nCommensurate with qualifications and experience \n \nREQUIRED QUALIFICATIONS \nDegree or diploma in Information Technology. \nCertifications (Preferred over a formal degree): \nTechnical Cybersecurity Certifications: CISSP, CEH (Certified Ethical Hacker), CompTIA Security+, or ECIH (Certified Incident Handler). \nFramework Knowledge: Certifications in ISO 27001, NIST, or other relevant cybersecurity standards. \nHands-on Experience: Practical experience in implementing security measures, incident response, and technical security controls. \n \nREQUIRED WORK EXPERIENCE \nMinimum 5 years of experience in a hands-on cybersecurity role, including: \nSecurity operations and incident handling. \nVulnerability assessments and penetration testing. \nTechnical leadership in cybersecurity implementations. \n \nKEY DELIVERABLES \nTechnical Security Implementation: \nLead the implementation of cybersecurity measures across the organisation, focusing on network, server, and application security. \nProactively identify and remediate vulnerabilities through vulnerability assessments and penetration testing. \nConfigure and maintain security technologies, including firewalls, intrusion detection/prevention systems (IDS/IPS), and antivirus solutions. \nDevelop and implement security controls to protect against unauthorised access, data breaches, and other cyber threats. \n \nIncident Handling & Technical Support: \nAct as the primary responder for security incidents, conducting in-depth investigations and technical analysis to identify root causes and mitigate impacts. \nProvide expert technical support to the broader ICT team in resolving complex security issues. \nDocument and report on security incidents, providing recommendations to prevent recurrence. \n \nCybersecurity Measures & Controls: \nWork closely with the ICT team to implement and optimize security controls within existing systems. \nEstablish and document security protocols and guidelines to enhance the overall security framework. \nMonitor and analyse logs, traffic, and other data sources to detect and respond to potential security threats. \n \nThreat Intelligence & Vulnerability Management: \nCollect, analyse, and utilize threat intelligence to inform security strategies and responses. \nConduct ongoing vulnerability assessments to identify security gaps and recommend technical solutions. \nEngage in hands-on configuration and tuning of security technologies to bolster defences. \n \nCollaboration & Technical Leadership: \nCollaborate with technical teams to ensure that cybersecurity measures are effectively integrated into ICT operations. \nProvide guidance and technical expertise to ICT staff on security best practices. \nLead the development of technical solutions to enhance security, including deploying security patches and updates. \n \nAudit Findings Review & Control Implementation: \nRegularly review internal and external audit reports related to cybersecurity to identify gaps, vulnerabilities, and areas of non-compliance. \nDevelop corrective action plans to address audit findings, prioritising critical issues that could impact the organisation’s security posture. \nWork with technical teams to implement security controls and corrective measures to mitigate identified risks, ensuring audit recommendations are fully addressed. \nEstablish processes to continuously monitor the effectiveness of implemented controls, ensuring they meet the intended security objectives and comply with relevant standards. \nDocument all implemented measures and prepare reports detailing actions taken, compliance status, and any residual risks. \nCollaborate with auditors, risk management teams, and other stakeholders to validate that the implemented controls effectively mitigate the identified risks. \nRecommend and implement preventive measures based on audit findings to strengthen security controls and reduce the likelihood of future issues. \n \nPolicy and SOP Review & Maintenance: \nRegularly review and update ICT security policies and Standard Operating Procedures (SOPs) to ensure they align with current security standards and best practices.\nDevelop new policies and SOPs as required to address emerging security threats and operational needs. \nEnsure all security policies and procedures are effectively communicated to and understood by the relevant stakeholders. \nMonitor compliance with established security policies and SOPs, making adjustments as necessary to enhance security measures. \n \nCompliance & Best Practices: \nEnsure that implemented and managed of IT Governance aligned with COBIT 2019 domains, ITIL Domain services, \nImplement and ensure compliance with regulatory requirements aligned with standards such as ISO/IEC 38500, ISO/IEC 27001, ISO/IEC 27002, ISO 9001, ISO 14589, ISO/IEC 20000, ISO Domains: ISO 31000, ISO/IEC 27005, ISO/IEC 27005, ISO 27035, ISO 27031, ISO 27003 \nLegislation: Compliance with: \nNIST, and other specific cybersecurity frameworks. \nEnsure compliance with information security legal and regulatory obligations including the Protection of Personal Information Act, 2013, \nCybercrimes Act 19 of 2020 \nNational Archives and Record Service of South Africa Act 43 of 1996. \n \nCOMPETENCIES AND SKILLS \nProficiency in technical cybersecurity operations, including hands-on experience with security tools and systems. \nStrong understanding of networking, server infrastructure, and security technologies. \nAbility to respond effectively to cyberattacks and security incidents with practical, hands-on solutions. \nExcellent problem-solving skills and the ability to work independently within a fast-paced environment. \nStrong communication skills with the ability to collaborate effectively with technical teams. \n \nNote: Recommended candidates will be subjected to attend a generic managerial competency-based assessment. Background verification, social media checks and security vetting will form part of the selection process and successful candidates will be subjected to security vetting. Correspondence will be limited to shortlisted candidates only. If you have not been contacted within three (3) months of the closing date of this advertisement, please accept that your application was unsuccessful. The NLC reserves the right not to fill any advertised position(s). \n \nIMPORTANT NOTICE: APPLICATION INSTRUCTIONS: \nPlease clearly indicate the title of the position you are applying for in the subject line \nOnly candidates who meet the requirements should apply; \nCorrespondence will be entered into with shortlisted candidates only; \nCV`s from Recruitment Agencies will not be considered. \nApplications received after the closing date will not be considered. \nSubmit your comprehensive C.V with qualifications attached to the following email address:Recruitment@nlcsa.org.za\n \nCLOSING DATE: 9th of October 2024 \n \nNLC WELCOMES APPLICANTS WITH DISABILITIES \n \nDISCLAIMER- POPIA \nBy applying for NLC’s vacancy, you expressly give NLC consent to process your personal information stored in our history of all who have applied will be processed in accordance with the Protection of Personal Information Act 4 of 2013 (“POPIA”), the NLC Human Capital Policy/Procedures, the NLC’s POPIA Policy and the NLC’s Privacy Policy. These documents set out why the NLC needs the personal information, what NLC will do with it, and with whom the NLC will share it. Note that we will not further process the personal information stored automatically in this portal.",
                "INFORMATION COMMUNICATION TECHNOLOGY DIVISION \nICT GOVERNANCE SPECIALIST – FULL TIME 24 MONTHS FIXED TERM CONTRACT \n \nPURPOSE OF THE JOB \nTo manage and continuously enhance ICT governance frameworks and processes in alignment with COBIT, ITIL best practices, and the South African DPSA Governance Framework. This role ensures effective ICT governance, risk management, and compliance across the organization, complementing the work of the ICT Security Specialist. It ensures adherence to key South African legislative and regulatory requirements. \nSALARY:\nCommensurate with qualifications and experience \n \nREQUIRED QUALIFICATIONS \nDegree or diploma in Information Technology. \nRelevant CISSP (Certified Information Systems Security Professional) or CISM (Certified Information Security Manager) certification or equivalent. \nCertified COBIT and ITIL practitioner. \nTOGAF certification (recommended). \n \nREQUIRED WORK EXPERIENCE \nMinimum 5 years of IT Governance specialist role experience in at least three of the following areas: \nInformation Security Governance \nInformation Security Program Management \nIncident Response Management \nOperational Information Security \nRisk assessment experience \nRisk Management \nGap analysis. Policy Development and Compliance: Develop, maintain, and enforce ICT governance frameworks aligned with COBIT, ITIL, ISO 27001/2, DPSA Governance Framework, and South African legislation etc. \nEnsure compliance with PFMA, ECTA, and other applicable legislation, incorporating these into ICT governance processes. \nAlign ICT governance processes with ISO 9000 standards for quality management, ensuring adherence to NARSA requirements for information governance. \n \nKEY DELIVERABLES \nICT Governance Framework Development and Compliance: \nRisk Management and ICT Governance Support: \nSupport the ICT Security Manager/Specialist in developing risk management frameworks aligned with the POPI Act and PAIA, ensuring protection and privacy of personal information. \nMaintain and update the ICT and cybersecurity risk register, ensuring alignment with organizational risk management strategies and compliance with South African regulations. \nGenerate risk management reports, perform gap analyses, and recommend risk treatment plans. \n \nICT Service Management and Operational Support: \nImplement and manage ITIL-based service management processes, including change, problem, and configuration management, ensuring compliance with ECTA. \nOversee the continuous improvement of ICT service delivery, to measure and enhance service quality. \n \nPerformance Monitoring and Reporting: \nAccumulate and analyse metrics related to ICT governance, risk management, and compliance,\nReport on compliance, performance constraints, and risks, ensuring alignment with PFMA and PAJA requirements. \n \nStakeholder Engagement and Leadership: \nProvide guidance to management on risk identification, control implementation, and ICT governance while coordinating closely with the ICT Security Manager/Specialist.\nEnsure that stakeholder engagement processes comply with PAIA and the POPI Act, protecting information privacy and ensuring transparency. Ensure that implemented and managed of IT Governance aligned with COBIT 2019 domain, ITIL Domain services, \n \nCompliance and Best Practices \nImplement and ensure compliance with regulatory requirements of IT Governance aligned with standards such as ISO/IEC 38500, ISO/IEC 27001, ISO/IEC 27002, ISO 9001, ISO 14589, ISO/IEC 20000, ISO 14589, ISO Domains: ISO 31000, ISO/IEC 27005, ISO 9001, ISO Domains: ISO 31000, ISO/IEC 27005. \nLegislation: Compliance with PAIA (Act No. 2 of 2000), POPI Act \nLegislation: Compliance with PFMA (Act No. 1 of 1999), PAJA (Act No. 3 of 2000) \nLegislation: Compliance with ECTA (Act No. 25 of 2002) \nLegislation: Compliance with POPI Act, PAIA (Act No. 2 of 2000) \nNARSA (Act No. 43 of 1996), \nECTA (Act No. 25 of 2002) \n \nCOMPETENCIES AND SKILLS \nTechnical Competencies \nStrong knowledge of current ICT technologies and operations architecture, policies, processes, systems, and tools. \nAbility to translate business needs into ICT and operational policies and solutions. \nKnowledge of ICT project planning, application development, and ICT governance best practices. \nExperience in implementing and managing, quality management standards. \nEffective communication and people skills, including conflict-management, working across multiple teams and with diverse stakeholders. \n \nBehavioural Competencies: \nCustomer Focus: Crafting and implementing service practices that meet customers' needs, \nAchievement Orientation: Setting and achieving high goals, continuously improving. \nInitiative: Identifying and implementing process improvements that enhance quality management and governance. \nDecision-Making: Allocating responsibilities to maximize effectiveness and quality outcomes. \nStrategic Thinking: Committing to long-range goals and plans, incorporating quality management principles. \nContinuous Learning: Actively pursuing learning opportunities and applying new knowledge to improve quality management and governance. \nRelationship Building: Establishing strategic relationships across the organization, ensuring alignment with quality management practices. \n \n \nNote: Recommended candidates will be subjected to attend a generic managerial competency-based assessment. Background verification, social media checks and security vetting will form part of the selection process and successful candidates will be subjected to security vetting. Correspondence will be limited to shortlisted candidates only. If you have not been contacted within three (3) months of the closing date of this advertisement, please accept that your application was unsuccessful. The NLC reserves the right not to fill any advertised position(s). \n \nIMPORTANT NOTICE: APPLICATION INSTRUCTIONS: \nPlease clearly indicate the title of the position you are applying for in the subject line \nOnly candidates who meet the requirements should apply. \nCorrespondence will be entered into with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered. \nApplications received after the closing date will not be considered. \nSubmit your comprehensive C.V with qualifications attached to the following email address:Recruitment@nlcsa.org.za\n \nCLOSING DATE: 9th of October 2024 \n \nNLC WELCOMES APPLICANTS WITH DISABILITIES \n \nDISCLAIMER- POPIA \nBy applying for NLC’s vacancy, you expressly give NLC consent to process your personal information stored in our history of all who have applied will be processed in accordance with the Protection of Personal Information Act 4 of 2013 (“POPIA”), the NLC Human Capital Policy/Procedures, the NLC’s POPIA Policy and the NLC’s Privacy Policy. These documents set out why the NLC needs the personal information, what NLC will do with it, and with whom the NLC will share it. Note that we will not further process the personal information stored automatically in this portal."
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "p80cc17ed-84a1-4fcb-9f07-fda19370d284"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/proudlysa_orig.png",
            "href": "https://www.govpage.co.za/proudly-south-african-vacancies-blog/proudly-south-african-vacancies7700687",
            "title": "PROUDLY SOUTH AFRICAN VACANCIES",
            "content": [
                " \nPROUDLY SOUTH AFRICAN\n ",
                "EVENTS AND EXHIBITIONS COORDINATOR\n The Proudly South African Campaign invites applications from suitably qualified candidates for the position of an Events & Exhibitions Coordinator on a fixed term contract for 3 years. \nREMUNERATION PACKAGE: R20 000.00 to R25 000.00 per month plus benefits.\n \nMINUMUM REQUIREMENTS:\nMatric\nAn appropriate recognised degree/diploma or equivalent qualification.\nA minimum of three year’s relevant experience with organising corporate events, exhibitions & projects.\nDrivers Licence, own vehicle and willingness to travel as and when required.\n \nKEY ROLES AND RESPONSIBILITIES: \nCoordinate Proudly South African events, exhibitions and promotions.\nInitiate planning and coordination prior to, during and after events, activations, exhibitions and promotional projects (both physical and virtual).\nManage and liaise with service providers.\nPreparation of event budgets and project plans.\nPrepare communiques or circulars for upcoming events, exhibitions and promotions.\nIdentify delegates and coordinate involvement of members for events and exhibitions.\nCollate reports from feedback and distribute customer satisfaction surveys after every event, exhibition and/or activation.\nImplement marketing plans that aim to promote Proudly South African’s internal and external activities, brands, products and services.\nCompile and submit reports (weekly, monthly, annually, projects, close out, pre/post and ad hoc).\nThe ability to perform miscellaneous/adhoc and other appropriate duties as assigned.\nComply and adhere to key deliverables as informed by annual performance plan(s).\nAbility to formulate creative ideas and be innovative.\nResilient, hard-working individual with project/time management skills and ability to work within the stipulated levels and delegations of authority in the organisation.",
                "Interested applicants that meet the minimum requirements should forward their CV quoting the reference number in their subject line. \n \nCVs may be sent via email to cvs@proudlysa.co.za.\n\nCLOSING DATE: 12h00 on the 11 October 2024.\n\nIf you have not been contacted within two weeks after the closing date, please consider your application as unsuccessful. \n\n \nCorrespondence will be limited to short-listed candidates.\nProudly South African reserves the rights not to fill this position."
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "p0b7e2132-18ee-4c6f-ada9-029bde987466"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/raf_orig.jpg",
            "href": "https://www.govpage.co.za/road-accident-fund-raf-vacancies-blog/road-accident-fund-raf-vacancies1855440",
            "title": "ROAD ACCIDENT FUND (RAF) VACANCIES",
            "content": [
                " \nROAD ACCIDENT FUND (RAF)\n ",
                " \n \nMANAGER: FACILITIES MANAGEMENT\nDivision:  Corporate Support\nReference No:  4763\nLocation:  Durban, KwaZulu-Natal, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  15\nJob Posting Salary:  R891,176.00\nJob Posting End Date:  8 Oct 2024\nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nPurpose of the Job: The Manager: Facilities Management is responsible to to managing the RAF Facilities related activities and processes to ensure a safe and functional working space.\n \nKey Performance Areas\n \nPolicy review and implementation\nContribute to the development and implementation of departmental policy, procedures and processes.\nKeep up to date with effective policy and practice execution strategies.\nEnsure national space strategy is adhered to.\n \nManage effective workspace and parking space management\nCreate functional effective and flexible working areas\nMaintain a database of accurate drawings of offices and submit any amendments to project office.\nManage the allocation of parking bays and ensure compliance.\nHandle parking and workspace queries and ensure resolution\n \nAdministration of audit and risk findings identified in the department.\nRespond to the operational risks identified.\nContinuously monitor opportunities and incidents.\nReview audit findings, develop plans and submit comments to Senior Manager.\nPro-actively rectify and control weaknesses identified.\nEnsure the proper administration, governance and risk management.\n \nManage Facilities services sectional budget and other financial resources management.\nMonitor the budget spending, manage the divisional cash flow and minimise budget variance.\nForecast facilities management budget each FY starting with zero based and submit to manager.\nEnsure that expenses fall and are covered under the budget set.\nEnsure regular and consistent reporting on budget expenditure.\nTo make input into the strategic and business planning and ensure budgeting for facilities services.\n \nManage 30-day payment of all FM invoices.\nManage payment of accounts rent and other Facilities Management related services.\nManage landlords, agents on outstanding invoices before month end.\nSubmit a report to manager on all invoice related information.\n \nManage all Facilities related Contracts.\nDraft memorandums and advise procurement of required Facilities Management contracts to ensure no irregular contracts.\nManage service level agreements with service providers for office cleaning. Fumigation, office plant and special server room clearing etc.\nEnsure up to date contract data base.\n \nReporting\nDevelop reports/ policies/ procedures and guide the process through the alignment of the documents to the overall RAF’s strategy.\nDevelop functional reporting systems, for management, projects or performance reporting.\nPrepare proposals, briefings, presentations, reports, and other documentation and provide management information both verbally and in report format.\n \nStakeholder management\nFacilitate and manage communication with relevant internal and external stakeholders proactively and progressively manage the relationships.\nManage relationships with vendors, service providers or procurement teams and ensure that all relevant procured items are invoiced and paid on time.\nCommunicate with all levels of stakeholder contact.\nRepresent the Fund in relevant external activities and events.\n \nPeople Management\nEnsure the sourcing, development and retention of a high-performance team.\nManage the recruitment of the operational workforce in line with employment equity targets.\nManage staff in the department to ensure that they achieve their objectives in line with the strategic objectives of the RAF.\nManage the implementation of people management processes and procedures to control/regulate workplace conflict and/or institute corrective measures and consultation processes to address deviations from standards.\nAllocate, direct, motivate and evaluate subordinates to help them achieve their individual goals.\n \nQualifications and Experience  \nBachelor’s Degree/Advanced Diploma in Facilities Management related qualification\nPostgraduate in Facilities Management related qualification will be advantageous.\nDrivers Licence\nRelevant 6-8 years’ experience in Facilities management environment of which 2 years must have been on supervisory level/area of expertise/management level\n \nBehavioral competencies\nResilience\nCommunication\nWorking with People\nNetwork and Alliances\nPlanning, Organising and Coordinating\nEmployee Engagement\nPersonal Mastery\nJudgement and Decision Making\nEthics and Values\nClient Service Orientation\n \nManagerial:\nChange management\nCoaching and mentoring\nConflict management\nCritical and innovative thinking\nDirection setting\nFacilitation and Presentation Skills\nPeople Management\nPolicy conceptualisation and formulation\nRisk Management\nProgramme/project management\nService Delivery Innovation\nStakeholder development and relations\nReporting\n \nTechnical:\nKnowledge of associated building maintenance processes.\nProject management skills\nTroubleshooting skills\nInnovative ideas on office set ups.\nSolution focused.\nImpact and innovation/creativity.\nKnowledge of Basic Financial Management.\n \n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »\n \n \n \n \n ",
                " \n \n \n \n \nSPECIALIST: IT RISK MANAGEMENT\nDivision:  Strategy and Transformation\nReference No:  4916\nLocation: Centurion, Gauteng, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  15\nJob Posting Salary:  R891,176.00\nJob Posting End Date:  8 Oct 2024\nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nPurpose of the Job: Reporting to the Manager: IT Risk and Governance, the successful incumbent is responsible for implementing procedures and controls to efficiently identify, assess, mitigate and monitor IT risks, ensuring the protection of the organisation’s assets. Reputation and operational continuity.\n \nKey Performance Areas\n \nRisk Management\nContribute to the development an IT Risk management framework for key ICT areas:\nRisks associated with products and services.\nSensitive or confidential information\nInformation security\nIT operations\nIT projects\nSystem recovery and business resumption\nIT outsourcing\nIT Talent\nConduct comprehensive risk assessments to identify and analyse potential risks associated with IT systems, processes, and projects.\nDevelop and implement risk mitigation strategies and controls to minimize the likelihood and impact of identified risks.\nManage exposures, insurance, legal/ regulatory requirements, cost justifications, vendor agreements, and business continuity.\n \nBusiness Continuity and Disaster Recovery\nContribute to business impact analysis and align IT continuity plans accordingly.\nDevelop and implement standard risk assessment, business impact analysis, and BCM tools and capabilities.\nFacilitate insurance and vendor agreements for disaster events.\n \nIncident Response and Crisis Management\nMaintain incident response plans and procedures to effectively respond to and recover from IT incidents and disruptions.\nParticipate in crisis management exercises.\n \nThird Party Risk Management\nEvaluate and manage risks associated with third-party vendors, suppliers, and service providers.\nAssess third party security controls, contractual obligations, and service level agreements to mitigate risks and ensure compliance with IT policies.\n \nCloud Services Risk Assessment and Mitigation\nConduct risk assessments for cloud services, develop mitigation strategies, and manage relationships with cloud service providers.\nEvaluate and manage relationships with cloud service providers, ensuring that contractual agreements, service level agreements (SLAs), and security commitments meet the organization's requirements.\nOversee change management processes for cloud environments.\n \nICT Compliance\nCollaborate with IT teams and business units to ensure that information technology systems and services meet risk management and compliance objectives.\nConduct regular audits and assessments of information technology systems and services to ensure that they are secure and meet compliance requirements.\nEnsure a compliance framework is maintained in accordance with required standards.\n \nPolicy Review and Implementation\nContribute to the development and implementation of departmental policies, standards, procedures, and processes.\nStay updated with effective policy execution strategies.\n \nReporting\nDefine key performance indicators (KPIs) and metrics to measure the effectiveness of IT Risk processes and controls.\nPrepare status reports on IT BCM matters, measure BCM program maturity, and publish DR program reports.\nMonitoring risk indicators, tracking risk treatment actions, and generating regular reports and dashboards to communicate risk status to senior management and stakeholders.\n \nStakeholder Management\nFoster proactive relationships with key stakeholders and address inquiries and requests for information.\nMaintain relationships with Enterprise Risk function, Auditors, service providers, and procurement teams.\n \nQualifications and Experience\nBachelor’s Degree/ Advanced Diploma in Information Technology/ Risk Management related qualification\nITIL will be an added qualification.\nRelevant 5 - 7 years’ experience in a Risk Management or an Information Technology related environment.\n \nTechnical and Behavioral Competencies Required\nResilience.\nNetwork and alliance.\nEmployee engagement.\nEthics and values.\nChange management.\nCritical and innovative thinking\nPolicy conceptualisation and formulation.\nRisk Management.\nStakeholder development and relations.\nReporting.\nKnowledge of information technology risks, governance and regulatory requirements, and risk management methodologies.\nData security management.\nIT risk management.\nInnovation and business improvement.\nRisk assessment.\nKnowledge of Software Vulnerability.\nCommunication skills.\nAnalytical skills.\n \nNB: “RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs”.\n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »\n \n \n \n \n \n ",
                " \n \nSPECIALIST: IT GOVERNANCE\nDivision:  Strategy and Transformation\nReference No:  4917\nLocation: Centurion, Gauteng, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  15\nJob Posting Salary:  R891,176.00\nJob Posting End Date:  8 Oct 2024\nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nPurpose of the Job: Reporting to the Manager: IT Risk and Governance, the successful incumbent is responsible for developing and implementing IT governance frameworks and controls to ensure alignment of IT processes, policies and systems with RAF’s strategic objectives, regulatory requirements and industry best practices.\n \nKey Performance Areas\n \nImplement IT Governance Frameworks\nCollaborate with senior management, IT teams, and key stakeholders to implement and maintain IT governance frameworks and policies.\nMonitor the effectiveness of IT frameworks (ITIL, COBIT, ISO 27001/2) and policies, making adjustments as necessary to maintain compliance and support evolving business needs.\n \nData Governance\nImplement data governance frameworks, policies, and procedures to ensure the quality, integrity, and security of organisational data assets.\nProvide support on data-related initiatives, including data classification, metadata management, data privacy, and regulatory compliance.\nFacilitate data governance training and awareness programs to promote a culture of data stewardship and accountability across the organisation.\n \nCloud Governance\nImplement and maintain a governance framework for cloud services that encompasses areas such as security, compliance, performance optimization, and risk mitigation.\n \nIT Compliance\nStay abreast of relevant laws, regulations, and industry standards pertaining to IT security and privacy (e.g., POPIA, GDPR, HIPAA) and ensure that the organisation remains compliant with applicable requirements.\nCollaborate with IT teams and business units to ensure that information technology systems and services meet compliance objectives.\nConduct regular audits and assessments of information technology systems and services to ensure that they are secure and meet compliance requirements.\nEnsure a compliance framework is maintained in accordance with required standards.\n \nIT Audit and Assurance\nCoordinate and support internal and external IT audits and assessments, including compliance audits, control reviews, and risk assessments.\nCollaborate with auditors to provide evidence of compliance, address audit findings, and facilitate implementation of  corrective actions as needed.\n \nPolicy Review and Implementation\nContribute to developing and implementing departmental policy, standards & procedures, and processes.\nStay updated with effective policy and practice execution strategies.\n \nReporting\nGenerate regular reports and dashboards to communicate IT governance performance to senior management and stakeholders.\n \nStakeholder Management\nFacilitate and manage communication with relevant internal and external stakeholders progressively manage the relationships.\n \nQualifications and Experience\nBachelor’s Degree/ Advanced Diploma in Information Systems, Computer Science, Audit, or related qualification. \nCertification in ITIL and COBIT.\nProject Management Professional (PMP) and Certified in Governance of Enterprise IT(CGEIT) will be advantageous.\nRelevant 5 - 7 years’ experience in developing, implementing, and maintaining IT governance frameworks and IT controls.\n \nTechnical and Behavioral Competencies Required\nResilience.\nNetwork and alliance.\nEmployee engagement.\nEthics and values.\nChange management.\nCritical and innovative thinking\nPolicy conceptualisation and formulation.\nRisk Management.\nStakeholder development and relations.\nReporting.\nKnowledge of IT frameworks and best practices.\n Excellent understanding of Regulatory requirements.\n Excellent corporate governance principles.\nMicrosoft office suite.\nTechnical ability.\nICT Policies, Procedures and Practices.\nData Governance.\nIT Processes.\nIT Frameworks.\nIT Regulations.\nCommunication (Written & Verbal).\nBasic Business management.\nBasic understanding of King IV.\n \nNB: “RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs”.\n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »\n \n \n \n \n \n ",
                " \n \n \n \n \n \nSENIOR MANAGER: MEDICAL ADVISORY MNGT\nDivision:  Claims\nReference No:  4922\nLocation: Centurion, Gauteng, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  18\nJob Posting Salary:  R1,371,054.00\nJob Posting End Date:  8 Nov 2024\n \nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n\n \nPurpose of the Job: Reporting to the Head: Medical Risk and Business Solutions, the successful incumbent is accountable for providing leadership to the clinical research team and function and medical advisory services; for the development of evidence-based treatment protocol and of associated policies and procedures in order to meet the objectives of the fund. This role will coordinate across all areas aligned to claims processing, rehabilitation and future care in order to ensure overall service provider engagement and stakeholder satisfaction.\n \nKey Performance Areas\n \nGovernance of Clinical/ Treatment Protocols (Policies, Processes and SOPs)\nDevise and execute a plan to monitor development, updating and refining healthcare   policies, processes, and protocol updates, on par with the latest technology and clinical developments in the industry.\nAssists and provide support to the medical management and claims assessment teams in decision making through policies and protocols.\nManage decisions, actions, clinical information, communication, and support related to claims processes, treatment and procedure.\n \nManagement of Treatment Protocols\nStandardisation on clinical standards and practices in order to strengthen an integrated service model for all related stakeholders (clinical and non-clinical)\nCo-ordinate holistic treatment protocol approach that is capped and includes all service providers. \nDevelop and deliver insightful, value-added solutions that address complex client issues.\nNavigate the market (including academic and specialist associations) in the effective and efficient standard treatment protocols. Nappi, ICD 10, CPT, orthotic, physiotherapy, occupational, etc.\nServes as a scientific advisor and provide guidance to the team on implementation of treatment protocol.\nInvestigate protocol related issues including protocol clarifications, inclusion/ exclusion determinations.\nPerform medical review of protocol.\nPerform medical review of adverse clinical coding.\n \nManagement of the Clinical Research Function\nFunction as a clinical leader for the Fund\nManage the analysis of clinical research data.\nDevelop and manage a project plan.\nProvide guidance to the clinical research team. \nAdvise, guide and support the clinical research team with clinical input and responses to all clinically related queries of RAF stakeholders e.g. attorneys, hospitals, etc.\nCheck medical trends, experience and approaches.\n \nStrategy Development and Operational Planning\nGuide the development and implementation of the departments strategy and plan that ensure alignment with short-term and long-term objectives.\nGuide implementation of the overall strategic plan for the department.\nGuide the implementation of specific key performance indicators and measures against outcomes detailed in the departmental strategic plans.\n \nPolicy Review and Implementation\nSupport the development and implementation of policy, procedures and processes for the business unit and ensure effective execution of policy and practices.\nCollaborate with appropriate structures to ensure effective execution of policy and practices.\nEnsure that all employees in the team know and understand the RAF policies.\n \nStakeholder Management\nRepresent the organisation in various provider platforms, and stakeholder relations area in order to ensure that the RAF treatment protocols and policies are on par with the local treatment standards. \nBuild collaborative working relationships with PMO, ICT, Post Claims Settlement etc. for implementation purposes.\nProvides medical and scientific advises to key internal and develop proposals.\n \nGeneral Administration\nDevelop clinical work templates\nRespond to complicated clinical queries in writing, supporting teams\nRecord keeping\nServe as the clinical expert providing technical support to the medical management and claims assessment departments.\n \nReporting\nUpdate RAF Management on progress of Clinical Research Team protocol development with milestones. \nReport quarterly on progress with implementation of operational plans.\nEnsure development of functional reporting systems, project or performance reporting for management.\nEnsure the development of reports/ policies/ procedures and guide the process through the alignment of these documents to the overall RAF’s Strategy.\nEnsure regular and periodic reports are prepared and submitted as and when required to provide progress updates and/or inform management decisions.\n \nFinancial Management\nEnsure that the periodic financial and strategic goals of RAF as well as the performance expectations of the various teams are achieved.\nReport and review operations financial and non-financial goals.\nEnsure sufficient internal control measures are implemented for adherence to PFMA, RAF and other relevant legislation and regulation.\nManage, monitor and control the department expense budget.\n \nPeople Management\nEnsure the sourcing, development and retention of a high-performance team.\nEnsure the motivation, cohesiveness, and alignment of the organisation’s team members.\nManage staff in the department to ensure that they achieve their objectives in line with the strategic objectives of the RAF.\n \nQualifications and Experience\nA Medical Degree (MBChB or equivalent).\nRegistration with the HPCSA as a Medical Doctor\nCertificate in Evidence Based training (PTCMA) or Health Technology Assessment (HTA) training or in progress of obtaining the qualification.\nPostgraduate in Health Sciences or Medical related qualification.\nBusiness Administration/ Management post graduate qualification would be an advantage.\nRelevant 9 – 10 years’ experience as a medical doctor of which 3 years’ must be on a management level/ area of expertise in a managed care/ insurance/ healthcare environment, medical advisory work.\nExperience in the development of treatment protocols, policies, and working with a team of researchers to develop the treatment protocols (clinical coder, pharmacist, etc.).\n \nNB: “RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs”.\n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »\n \n \n \n \n \n ",
                " \n \n \n \n \n \nSPECIALIST: CLINICAL RESEARCH PROTOCOLS\nDivision:  Claims\nReference No:  4924\nLocation: Centurion, Gauteng, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  14\nJob Posting Salary:  R771,969.00\nJob Posting End Date:  8 Oct 2024\nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nPurpose of the Job: Reporting to Manager: Policy and Research, the successful incumbent is accountable for working with clinical data for the collection, analysis, maintenance and use of quality data to support the development of evidence-based treatment protocols.\n \nKey Performance Areas\n \nOrganize and Manage Health Information Data and Ensure its Quality, Accuracy, Accessibility and Security\nSearch and review data in adherence to requirements of the clinical research team.\nSearch applicable databases for information and ensure that data used is accurate and up to date.\nDevelop health management information system (configuration and data structures) aligned to the objectives of the team.\nEnsure rigor of literature accessed across all research projects.\nDevelop and implement SOPs for data searches and access.\n \nMaintenance, Collection and Analysis of Data\nDevelop processes that ensure data accessibility, analysis and storage.\nEnsure that databases are up to date and ensure training and understanding of appropriate databases by the clinical research team.\nFilter search results according to specifications.\nDefine the data management framework compromising of search criteria, turn- around times for data requests and quality assurance.\nPlan, manages and requests resources for assigned projects.\nDevelop and maintain project plans, specifications and documentation in line with SOP requirements.\n \nPolicy Review and Implementation\nContribute to the development and implementation of departmental policy, procedures and processes.\nKeep up to date with effective policy and practice execution strategies.\n \nReporting\nPrepare and submit regulation reports as and when required to provide progress updates and/or inform management decisions.\nDevelop reports/ policies/ procedures and guide the process through the alignment of the documents to the overall RAF’s Strategy.\nDevelop functional reporting systems, for management, projects or performance reporting.\nPrepare proposals, briefings, presentations, reports, and other documentation and provide management information both verbally and in report format.\n \nStakeholder Management\nProvide data management expertise within the team.\nWork as a member of a holistic protocol development team.\nConstructively engage and liaise with team members in the protocol development team towards achieving collective goals.\nStay abreast of new scientific developments and expand the network of collaborative partners by attending workshops, technical working groups and academic engagements.\nProvide regular training to staff on clinical topics within the team as well as within other teams in the organization.\nWork closely with ICT to ensure that the infrastructure is compatible across all relevant data points.\n \nAdministrative and Report Writing\nCompile monthly reports on data searches, utilization, contribution to protocol development and clinical query resolution \nCollection of relevant statistics to inform future decisions\nEnsure processes are in place to have accurate and timeous information on databases and data management.\nRun data cleaning and status reports.\n \nQualifications and Experience\nBachelor’s Degree/ Advanced Diploma in Health Sciences Nursing, Pharmacy related qualification.\nValid registration with the relevant Statutory body (SANC, SAPC, HPCSA etc).\nCertification in evidence-based medicine and/or treatment protocol development will be an added advantage.\nRelevant 5 - 7 years’ experience in a Managed Healthcare environment or similar in data sourcing, collection and navigation.\nExperience working with treatment protocols and guidelines.\nWith experience working with medical databases, navigating large data quantities and data outputs.\nWith experience working with ICD 10 codes, CPT codes, NAPPI codes Experience in Functional Capacity Evaluation and associated reports and tariffs applicable.\nWith experience working with coding systems (ICD 10, CPT and NAPPI codes).\n \nTechnical, Managerial, and behavioural competencies required\nCommunication.\nNetwork and Alliances\nPlanning, Organising and Coordinating\nEthics and Values\nClient Service Orientation\nChange management\nConflict management\nPolicy conceptualisation and formulation\nRisk Management\nProgramme/ project management\nStakeholder development and relations\nReporting\nComputer literacy.\nDisplay a basic understanding of evidence-based medicine\nKnowledge of medical terminology and legal aspects of health information\nGood understanding of data search engines and intelligent data extraction\nUnderstanding of data research principles\nEnsure quality, accuracy, accessibility and security of data\nKnowledge of health data standards\nKnowledge of “managed healthcare” or financial risk assessment principles (environment)\nKnowledge of standards within the health industry\nKnowledge of the legislation governing RAF, policies and procedures\nKnowledge and understanding of the RABS Bill and its benefits\nKnowledge of the National Health Act, RAF Act, and other health related legislation such as the Medical Scheme’s Act, etc.\n \nNB: “RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs”.\n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »\n \n \n \n \n \n ",
                "SPECIALIST: EMERGENCY MEDICAL SERVICES\nDivision:  Claims\nReference No:  4923\nLocation: Centurion, Gauteng, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  15\nJob Posting Salary:  R891,176.00\nJob Posting End Date:  8 Oct 2024\nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nPurpose of the Job: Reporting to the Manager: Medical Advisory, the successful incumbent is accountable to manage the standard of clinical care by developing and maintaining clinical standards and supporting strategies.\n \nKey Performance Areas\nAssessment of Clinical Impairment in Line with International Best Practices\nProvide guidance in the interpretation of emergency rescue and stabilization analysis.\nAssessment and review of clinical appropriateness of emergency medical services.\nCoordinate with internal departments to find solutions and resolve matters.\nSupport in the identification, development and implementation of cost-effective processes in order to increase efficiency and reduce cost drivers related to the emergency medical services.\n \nTraining and Support\nEnsure updated and standardised emergency medical services training to medical staff within RAF.\nProvide support to RAF teams on EMS related matters.\nIdentify relevant treatment plans and gaps in EMS.\n \nQuality Assurance\nProvide consultations on the implementation or programs and services.\nEnsure that programs and services are implemented and maintained at the highest standards.\nManage the development and implementation an unusual occurrence procedure.\nEnsure that research is conducted to determine if there are any new or revised regulations.\n \nPolicy Review and Implementation\nContribute to the development and implementation of emergency medical service protocols.\nContribute to the development and implementation of emergency medical service tariffs\nKeep up to date with effective SOP’s, policy and practice execution strategies.\nEnsure that policies and systems are managed and monitored in line with regulations.\n \nReporting\nPrepare and submit regulation reports as and when required to provide progress updates and/or inform management decisions.\nDevelop reports/ policies/ procedures and guide the process through the alignment of the documents to the overall RAF’s Strategy.\nDevelop functional reporting systems, for management, projects or performance reporting.\nPrepare proposals, briefings, presentations, reports, and other documentation and provide management information both verbally and in report format.\n \nStakeholder Management\nPrepare and submit regulation reports as and when required to provide progress updates and/or inform management decisions.\nDevelop reports/ policies/ procedures and guide the process through the alignment of the documents to the overall RAF’s Strategy.\nDevelop functional reporting systems, for management, projects or performance reporting.\nPrepare proposals, briefings, presentations, reports, and other documentation and provide management information both verbally and in report format.\n \nQualifications and Experience\nBachelor’s Degree/ Advanced Diploma in an Emergency medical services related qualification.\nNational Ambulance Emergency Assistant Certification (AAA) or Intermediate.\nRegistration with the HPCSA as a Paramedic ILS Minimum/ ALS Desired.\nPre-hospital Trauma Life Support (PHTLS) certification will be an advantage.\nRelevant 5 - 7 years’ experience in Emergency Management Environment.\nExperience in working with ICD 10 codes (diagnosis codes) will be an advantage.\nExperience in Healthcare Administration and Funding industry.\nExperience in medical claims, related charges, and clinical audit of claims.\n \nTechnical and Behavioral Competencies Required\nResilience.\nNetwork and alliance.\nEmployee engagement.\nEthics and values.\nChange management.\nCritical and innovative thinking\nPolicy conceptualisation and formulation.\nRisk Management.\nStakeholder development and relations.\nReporting.\nUnderstand different systems of ambulance provision.\nVast knowledge of MVA and related complications.\nKnowledge of medical information systems and processes.\nKnowledge of clinical technology and trends.\nUnderstanding of health technologies.\nKnowledge of impairment rating procedures.\nKnowledge of relevant clinical legislation.\n \n\nNB: “RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs”.\n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »",
                "SENIOR OFFICER: FACILITIES MANAGEMENT\nDivision:  Corporate Support\nReference No:  4626\nLocation:  Centurion, Gauteng, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  12\nJob Posting Salary:  R579,259.00\nJob Posting End Date:  8 Oct 2024\nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nPurpose of the Job: Reporting to the Manager: Facilities Management, the successful incumbent is responsible for coordinating the implementation of Facilities related activities and processes to ensure a safe and functional working space. The role will also supervise the work of the Officer: Facilities Management.\n \nKey Performance Areas\n \nFacilities Related Support\nArrange for the appropriate maintenance and repair of building, furniture and equipment.\nIdentify problems regarding service level agreements with service providers contracted under Facilities Management services and escalate where necessary.\nEnsure all offices are fully furnished and equipped.\nPlan and coordinate office moves (churning) and oversee the execution thereof.\nConduct inspections and ensure that staff adhere to guidelines, policies and procedures.\nMonitor the delivery by service providers and engage where necessary.\n \nParking Space Management\nApprove parking requests and escalate the manager where necessary.\nQuality assure and provide secondary audit on the allocated parking and ensure compliance.\nProvide supervisory support to office churning and provide guidance.\n \nOffice Accounts\nKeep and maintain record of all FM accounts.\n Monitor contracts or purchasing orders for service delivery.\nSubmit verified accounts for payment.\nReconcile accounts monthly.\n \nReporting\nContribute to the preparation and submission of regulation reports.\nReport regularly and periodically perform necessary submissions as and when required to provide progress updates and/or inform management decisions.\n \nStakeholder Management\nProactive and progressive relationships with key stakeholders.\nDeal with inquiries and requests for information from both internal and external stakeholders.\nAid in the maintenance of relationships with vendors, service providers or procurement teams and ensure that all relevant procured items are invoiced and paid on time.\n \nPeople Management\nEnsure that good employee relations are maintained.\nProvide ongoing operational support to employees.\n \nQualifications and Experience\nBachelor’s Degree/ Advanced Diploma in Facilities Management related qualification.\nDrivers License.\nRelevant 4 years’ experience in Facilities related environment of which 1 year must have been on supervisory level.\n \nNB: “RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs”.\n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »"
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "pae52f762-c81f-4392-9aef-f7cca6cf867e"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/transnet-logo_orig.jpeg",
            "href": "https://www.govpage.co.za/transnet-vacancies-blog/transnet-vacancies5730988",
            "title": "TRANSNET VACANCIES",
            "content": [
                " \nTRANSNET\n ",
                " \n \n \nAIRCRAFT MAINTENANCE ENGINEER\nOperating Division: Transnet NPA\nEmployee Group: Permanent\nDepartment: NGQ, Aviation Operations, DNR\nLocation: Richards Bay\nReporting To: Senior Aircraft Maintenance Engineer\nGrade: AS1\nReference: req2233\n \nThe closing date is on 10/10/2024. It is the responsibility of the applicant to ensure that HR has received the application before the closing date of the advertisement.\n \nPosition Purpose\nResponsible for performing all technical maintenance activities as determined in the Maintenance Schedule and recording of all discrepancies identified during the required inspection operations. Certifying maintenance release of all technical work when authorised. Ensuring the provision of an airworthy aircraft, complying with manufacturers, regulatory authorities, and TNPA processes and procedures. Ensuring that high safety standards are adhered to at all times to mitigate risks associated with aviation operations.\n \nPosition Outputs\n• Perform all mandatory periodic inspections (MPI) on TNPA aircraft as determined by local authority and equipment manufacturer.\n• Rectify all technical defects in accordance with approved procedures.\n• Ensure airworthiness and readiness of TNPA aircraft for efficient service delivery.\n• Record all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken as a result of work accomplished.\n• Maintain sound technical practices.\n• Thorough knowledge and application of the requirements of the Manual of Procedures, CAR’s of 2011, Approved Schedules, Manufacturers Manuals Airworthiness Directives and Airworthiness Notices.\n• Accurate trouble isolation of defects and rectification.\n• Certify own work and as well as countersigning work of other engineers as well as junior engineers in training.\n• Maintain vigilance at all times for discrepancies, which may occur during operation of aircraft and rectify them correctly in the shortest possible time.\n• Hold current AME license with ratings applicable to TNPA aircraft.\n• Ensure that TNPA aircraft have valid and correct technical documentation at all times.\n• Maintain sound technical practices at all times and adhere to airworthiness codes.\n• Log all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken and work accomplished.\n• Ensure optimum ground support for TNPA aircraft.\n• Carry out pre-flight and after-flight inspections on every flight mission.\n \nQualifications and Experience\n• Hold a valid Aircraft Maintenance Engineer’s license (AME) rated on rotorcraft. • Rotorcraft general and turbine engine certification. • Trade certification. • 3 years aircraft maintenance experience. • AME rating(s) on twin-turbine helicopters will be an added advantage. • Management qualification will be an added advantage.\n \nCompetencies\nKnowledge required: • Aviation rules and safety guidelines. • Helicopter operating procedures & systems. • Public safety & security. • Transportation systems & procedures. • Aircraft systems, engines & airframes. • Port rules. • Customer & personal service. • English language proficiency. • Mathematical applications. • Computers & electronic applications. • Flight theory & engineering practices. Skills Required: • Good communication. • Time management. • Rapid judgement & decision making. • Operational control. • Active listening. • Technical trouble isolation & rectification. • Vigilance. • Accuracy. • Working with complex machines, tools & devices. • Social perceptiveness/diversity management. Attributes Required: • Decision making • Multi-tasking • Meticulous • Accuracy • Good communication • Teamwork\n \nEquity Statement\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation/Operating Division.\n \nAPPLY NOW\n \n \n \n \n \n ",
                " \n \n \n \n \n \nTRAINEE TRAIN ASSISTANT\nOperating Division: Transnet Freight Rail\nEmployee Group: Trainee\nDepartment: OP-COR-EXEC-TCM-Heavy Haul A-VYD\nLocation: Vryheid\nReporting To: Section Manager: Train Traffic\nGrade: SSTP\nReference: req2232\n \nThe closing date is on 08/10/2024. It is the responsibility of the applicant to ensure that HR has received the application before the closing date of the advertisement.\n \nPosition Purpose\n• A\nTrainee Train Assistant will be required to undergo module training, conduct\nand successfully complete the required modules in Train Assistant-Initial\nCourse and practical training as to be qualified and certified as a Train\nAssistant.\n \nPosition Outputs\n\"• Attend and successfully complete a theoretical Training Program within the required time frame • Develop competency via formal learning as to perform within a operational environment and operate equipment as assigned • Safely and efficiently accomplish work assignments and goals that are in line with the Training Program, company's strategies and vision. • Maintain comprehensive records (portfolio of evidence) of all theoretical and practical training experience for use in progressing. • Execute trainee Train Assistant duties as prescribed by TFR\"\n \nQualifications and Experience\n• Grade 12 with pure Mathematics and/or Physical Science Functional Training • Be prepared to successfully undergo Train Assistant duties (theoretical and practical) so as to be certified to work independently as a Train Assistant. Other Requirements • Be prepared to undergo periodic medical surveillance and safety behavioral risk assessments during the selection process and every 12 months • Physical hearing, vision, mental, fitness (to be verified through medical tests and related safety behavioural risk assessments) • The operator shall not allow employees younger than 21 years of age to undertake train driver or train control duties. (SANS 3000, par 6.2.6.8) The following minimum Trainee pre-requisite: • The candidate should be a minimum of 1.6 meters tall • Psychomotor ability (to be assessed through Vienna Testing System (VTS) standard) • Ability to carry heavy objects\n \nCompetencies\nKnowledge • Various communication systems • Depot layout • Locomotive classes • Locomotive equipment • Route/road • Sections/stations and sidings • Signing on duty procedures • Train working rules • Trip report • Yard and siding layout • Knowledge of general TFR policies • Shunting procedures • Locomotive classes and their hauling capacities, constraints on the particular territory • Health and Safety Act 85 • First aid • Basic conditions of employment act (BCEA) • SANS 3004 (Human factors) • HC policies and procedures • Train service/ITP • Train workings • Substance Abuse policy and procedures • Locomotive equipment • Route/road • Sections/stations and sidings • Signing on duty procedures • Train working rules • Trip report • Yard and siding layout • Knowledge of general TFR policies • Shunting procedures • Locomotive classes and their hauling capacities, constraints on the particular territory • Health and Safety Act 85 • First aid • Basic conditions of employment act (BCEA) • SANS 3004 (Human factors) • HC policies and procedures • Train service/ITP • Train workings • Substance Abuse policy and procedures Attributes • Stress handling • Self-management • Safety conscious • Punctual • Willing to work shifts • Results orientated “NB: The candidate must meet the minimum inherent health requirements of the job”\n \nEquity Statement\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation/Operating Division.\n \nAPPLY NOW\n \n \n \n \n ",
                " \n \n \n \n \n \n \nAIRCRAFT MAINTENANCE ENGINEER\nOperating Division: Transnet NPA\nEmployee Group: Permanent\nDepartment: NGQ, Aviation Operations, DNR\nLocation: Durban\nReporting To: Senior Aircraft Maintenance Engineer\nGrade: AS1\nReference: req2225\n \nThe closing date is on 10/10/2024. It is the responsibility of the applicant to ensure that HR has received the application before the closing date of the advertisement.\n \nPosition Purpose\nResponsible for performing all technical maintenance activities as determined in the Maintenance Schedule and recording of all discrepancies identified during the required inspection operations. Certifying maintenance release of all technical work when authorised. Ensuring the provision of an airworthy aircraft, complying with manufacturers, regulatory authorities, and TNPA processes and procedures. Ensuring that high safety standards are adhered to at all times to mitigate risks associated with aviation operations.\n \nPosition Outputs\n• Perform all mandatory periodic inspections (MPI) on TNPA aircraft as determined by local authority and equipment manufacturer.\n• Rectify all technical defects in accordance with approved procedures.\n• Ensure airworthiness and readiness of TNPA aircraft for efficient service delivery.\n• Record all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken as a result of work accomplished.\n• Maintain sound technical practices.\n• Thorough knowledge and application of the requirements of the Manual of Procedures, CAR’s of 2011, Approved Schedules, Manufacturers Manuals Airworthiness Directives and Airworthiness Notices.\n• Accurate trouble isolation of defects and rectification.\n• Certify own work and as well as countersigning work of other engineers as well as junior engineers in training.\n• Maintain vigilance at all times for discrepancies, which may occur during operation of aircraft and rectify them correctly in the shortest possible time.\n• Hold current AME license with ratings applicable to TNPA aircraft.\n• Ensure that TNPA aircraft have valid and correct technical documentation at all times.\n• Maintain sound technical practices at all times and adhere to airworthiness codes.\n• Log all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken and work accomplished.\n• Ensure optimum ground support for TNPA aircraft.\n• Carry out pre-flight and after-flight inspections on every flight mission.\n \nQualifications and Experience\n• Hold a valid Aircraft Maintenance Engineer’s license (AME) rated on rotorcraft. • Rotorcraft general and turbine engine certification. • Trade certification. • 3 years aircraft maintenance experience. • AME rating(s) on twin-turbine helicopters will be an added advantage. • Management qualification will be an added advantage.\n \nCompetencies\nKnowledge: • Aviation rules and safety guidelines. • Helicopter operating procedures & systems. • Public safety & security. • Transportation systems & procedures. • Aircraft systems, engines & airframes. • Port rules. • Customer & personal service. • English language proficiency. • Mathematical applications. • Computers & electronic applications. • Flight theory & engineering practices. Skills: • Good communication. • Time management. • Rapid judgement & decision making. • Operational control. • Active listening. • Technical trouble isolation & rectification. • Vigilance. • Accuracy. • Working with complex machines, tools & devices. • Social perceptiveness/diversity management. Attributes: • Decision making • Multi-tasking • Meticulous • Accuracy • Good communication • Teamwork\n \nEquity Statement\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation/Operating Division.\n \nAPPLY NOW\n \n \n \n \n \n ",
                "AIRCRAFT MAINTENANCE ENGINEER: AVIONICS\nOperating Division: Transnet NPA\nEmployee Group: Permanent\nDepartment: NGQ, Aviation Maintenance, DNR\nLocation: Durban\nReporting To: Chief Aviation Engineer\nGrade: G\nReference: req2224\n \nThe closing date is on 10/10/2024. It is the responsibility of the applicant to ensure that HR has received the application before the closing date of the advertisement.\n \nPosition Purpose\nResponsible for performing all avionic & technical maintenance activities as determined in the Maintenance Schedule and recording of all discrepancies identified during the required inspection operations. Certifying maintenance release of all avionics work as per TNPA and regulator authorisations. Ensuring the provision of airworthy aircraft, complying with manufacturers, regulatory authorities, and TNPA processes and procedures.\n \nPosition Outputs\n1. Perform all mandatory periodic inspections (MPI) on TNPA aircraft as determined by local authority and equipment manufacturer.\n2. Rectify all technical defects in accordance with approved procedures.\n3. Ensure airworthiness and readiness of TNPA aircraft for efficient service delivery.\n4. Record all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken as a result of work accomplished.\n5. Maintain sound technical practices.\n6. Thorough knowledge and application of the requirements of the Manual of Procedures, CAR’s of 2011, Approved Schedules, Manufacturers Manuals Airworthiness Directives and Airworthiness Notices.\n7. Accurate trouble isolation of defects and rectification\n8. Certify own work and as well as countersigning work of other engineers as well as junior engineers in training.\n\n9. Maintain vigilance at all times for discrepancies, which may occur during operation of aircraft and rectify them correctly in the shortest possible time.\n10. Hold current AME license with ratings applicable to TNPA aircraft.\nMaintenance Schedule and when necessary, record all discrepancies\nidentified during the required inspection operations.\n11. Ensure that TNPA aircraft have valid and correct technical documentation at all times.\n12. Maintain sound technical practices at all times and adhere to airworthiness codes.\n13. Log all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken and work accomplished.\n14. Ensure optimum ground support for TNPA aircraft.\n15. Carry out pre-flight and after-flight inspections on every flight mission.\n \nQualifications and Experience\n• Hold a valid AME license applicable to TNPA aircraft with W or X ratings. • Trade certificate. • Avionics general certificate. • Aircraft type course (s). • 3 years aircraft maintenance experience as a qualified avionics AME.\n \nCompetencies\nAttributes: • Decision making • Multi-tasking • Meticulous • Accuracy • Good communication • Teamwork Knowledge: • Aviation rules and safety guidelines • Aircraft operation procedures & systems • Public safety & security • Transportation systems & procedures. • Avionic systems, aircraft instruments & aircraft electrical systems. • Port rules • Customer & personal service • English language proficiency • Mathematical applications • Computers & electronic applications. • Flight theory & engineering practices Skills: • Good communication • Time management • Quick judgement & decision making • Operational control • Active listening • Technical trouble isolation & • rectification • Vigilance • Accuracy • Working with complex machines, tools & devices. • Social perceptiveness\n \nEquity Statement\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation/Operating Division.\n \nAPPLY NOW",
                "AIRCRAFT MAINTENANCE ENGINEER: AVIONICS\nOperating Division: Transnet NPA\nEmployee Group: Permanent\nDepartment: NGQ, Aviation Operations, DNR\nLocation: Richards Bay\nReporting To: Senior Aircraft Maintenance Engineer\nGrade: AS1\nReference: req2223\n \nThe closing date is on 10/10/2024. It is the responsibility of the applicant to ensure that HR has received the application before the closing date of the advertisement.\n \nPosition Purpose\nENTER JOB DESCRIPTION HERE\nPosition Outputs\n• Perform all Avionics technical maintenance activities as determined in the Maintenance Schedule and when necessary, record all discrepancies identified during the required inspection operations.\n• Signs maintenance release of all avionic work when authorised.\n• Ensure provision of an airworthy aircraft, complying with manufacturers, regulatory authority, and TNPA standards to the customer.\n• Maintain high technical standards and readiness of TNPA aircraft for efficient service delivery.\n• Record all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken as a result of work accomplished.\n• Maintain sound technical practices that include systematic troubleshooting to determine aircraft malfunctions and rectification.\n• Perform all maintenance activities (including compass swings, radio, instrumentation, electrical cabling and modifications) as determined in the Approved Schedule and when necessary, record all discrepancies identified during the required inspection process for analysis.\n• Thorough knowledge and application of the requirements of the Manual of Procedures, CAR’s of 2011, SAMSA regulations, Approved Schedules, Manufacturers Manuals Airworthiness Directives and Airworthiness Notices.\n• Accurate isolation of defects and corrective action planning.\n• Certify own work and as well as countersigning work of other engineers as well as junior engineers in training in accordance with operating procedures.\n• Maintain vigilance at all times for discrepancies, which may occur during operation of aircraft and rectify them correctly in the shortest possible time.\n• Hold current AME license with ratings applicable to TNPA aircraft, for installation of avionics equipment, functional testing and release to service.\n• Ensure that TNPA aircraft have valid and correct technical documentation and functioning avionics systems at all times.\n• Maintain sound technical practices at all times and adhere to airworthiness codes and safety standards.\n• Log all activities being performed through the use of approved documentation in a clear and concise manner showing all actions taken and work accomplished.\n• Use the correct tooling and equipment to perform required work operations on airborne navigation/communications systems, weather radar, autopilot, flight instrument systems and accessories.\n• Carry out pre-flight and after-flight inspections on every flight mission.\n• Assists with Mechanical work where necessary and ensure that TNPA aircraft are safe for operation at all times.\n• Supervision, mentorship and endorsement of junior engineers’ logbooks.\n \nQualifications and Experience\n• Hold a valid AME license applicable to TNPA aircraft with W or X ratings. • Trade certificate. • Avionics general certificate. • Aircraft type course (s). • 3 years aircraft maintenance experience as a qualified avionics AME.\n \nCompetencies\nKnowledge: • Aviation rules and safety guidelines • Aircraft operation procedures & systems • Public safety & security • Transportation systems & procedures. • Avionic systems, aircraft instruments & aircraft electrical systems. • Port rules • Customer & personal service • English language proficiency • Mathematical applications • Computers & electronic applications. • Flight theory & engineering practices Skills: • Good communication • Time management • Quick judgement & decision making • Operational control • Active listening • Technical trouble isolation & • rectification • Vigilance • Accuracy • Working with complex machines, tools & devices. • Social perceptiveness Attributes: • Decision making • Multi-tasking • Meticulous • Accuracy • Good communication • Teamwork\n \nEquity Statement\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation/Operating Division.\n \nAPPLY NOW"
            ],
            "postedDate": "30/9/2024",
            "iframe": "",
            "uuid": "p92871867-6fa4-4078-b1c0-bfb0642bc74f"
        }
    ],
    "departments": {
        "mpumalanga department of health vacancies": "https://www.govpage.co.za/mpumalanga-department-of-health-vacancies-blog/mpumalanga-department-of-health-vacancies9250955",
        "city of ekurhuleni vacancies": "https://www.govpage.co.za/ekurhuleni-metropolitan-municipality-vacancies-blog/city-of-ekurhuleni-vacancies4234860",
        "construction industry development board (cidb) vacancies": "https://www.govpage.co.za/construction-industry-development-board-cidb-vacancies-blog/construction-industry-development-board-cidb-vacancies1624920",
        "eskom vacancies": "https://www.govpage.co.za/eskom-vacancies-blog/eskom-vacancies7191545",
        "financial sector conduct authority (fsca) vacancies": "https://www.govpage.co.za/financial-sector-conduct-authority-fsca-vacancies-blog/financial-sector-conduct-authority-fsca-vacancies1850634",
        "industrial development corporation (idc) vacancies": "https://www.govpage.co.za/industrial-development-corporation-idc-vacancies-blog/industrial-development-corporation-idc-vacancies9667406",
        "national gambling board of south africa (ngb) vacancies": "https://www.govpage.co.za/national-gambling-board-of-south-africa-ngb-vacancies-blog/national-gambling-board-of-south-africa-ngb-vacancies5033794",
        "national home builders registration council (nhbrc) vacancies": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies9452390",
        "national lotteries commission (nlc) vacancies": "https://www.govpage.co.za/national-lotteries-commission-nlc-vacancies-blog/national-lotteries-commission-nlc-vacancies8567283",
        "proudly south african vacancies": "https://www.govpage.co.za/proudly-south-african-vacancies-blog/proudly-south-african-vacancies7700687",
        "road accident fund (raf) vacancies": "https://www.govpage.co.za/road-accident-fund-raf-vacancies-blog/road-accident-fund-raf-vacancies1855440",
        "transnet vacancies": "https://www.govpage.co.za/transnet-vacancies-blog/transnet-vacancies5730988"
    }
}