{
    "title": "govpage-public-sector",
    "blogPosts": [
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sars_orig.jpg",
            "href": "https://www.govpage.co.za/south-african-revenue-services-sars-vacancies-blog/south-african-revenue-services-sars-vacancies3613978",
            "title": "SOUTH AFRICAN REVENUE SERVICES (SARS) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN REVENUE SERVICES (SARS)\n ",
                " \n \nSPECIALIST: DATA ANALYST\nPosition Reports to: Chief Data Scientist    \nDivision: Design and Enabling         \nLocation: Head Office, Brooklyn\nAdvert Closing Date: \n \nAbout the Position\nThe Strategic Planning and Modernisation (SPM) unit was created to support SARS in its goal of building a technologically advanced, smart, and modern SARS. The Data Analyst along with the Design and Enablement team, will drive data driven problem solutions with a particular focus on modernisation initiatives across SARS.\n \nJob Purpose\nSARS is looking for a highly skilled and detail-oriented Specialist Data Analyst to join our team. The successful candidate will be responsible for analysing data, generating insights, and developing data-driven strategies to improve business performance. Your work will be well oiled by our data. We want you to better understand our data and come up with cutting-edge insights and solutions to further enhance our service offering.\n \nEducation and Experience\nMinimum Qualification & Experience Required\nRelevant Bachelor’s Degree / Advanced Diploma (NQF 7) in (Informatics/Computer Science/Statistics/IT) AND 8-10 years’ experience in Data Engineering / Business Data Intelligence / Data Science, of which 3-4 years at the operational specialist level\n \nAlternative#\n\nSenior Certificate (NQF 4) Informatics/Computer Science/Statistics/IT) AND 15 years in Data Engineering / Business Data Intelligence / Data Science experience with 3-4 years at the operational specialist level.\n \nMinimum Functional Requirements\nExperience in Data Engineering / Business Data Intelligence / Data Science\nAdvanced (applied theory) technical expertise regarding data processes, data cleaning, analysis, reporting, data models, and database design and testing\nKnowledge of and experience with reporting tools (SQL and Power BI / Tableau or equivalent), databases (SQL Server) and programming (R, Python, etc.)\nAdvanced (applied theory) knowledge of statistics and experience using statistical packages for analysing datasets (Excel, SPSS, SAS, R, etc.)\nAdvanced (applied theory) Data warehouse knowledge.\nBe advanced in the application of:\nBasic Data Migration\nBasic Data Visualization  \nBusiness Intelligence Methodologies\nDatabase Knowledge\nAdvanced (applied theory) Programming Skills – i.e. SQL, and Python/R, etc.\nMicrosoft skills (Advanced in)– i.e. Excel, Word, PowerPoint, etc.\n \nJob Outputs:\nProcess\nReview the effectiveness of related approaches and methodologies by conducting research, and best practice benchmarking initiatives.\nConduct assessments and use information to advise, make recommendations and facilitate improvement.\nAcquiring data from primary or secondary data sources and maintaining databases, applying the knowledge of data extraction, transformation, and business modelling.\nTo perform complex/advance business analysis using various techniques, e.g. statistical analysis, explanatory and predictive modelling, and data mining.\nTo design, develop, and test complex/advance data analytics solutions like Reports, Dashboards, Analysis, Extracts, Models, etc.\nTo identify, analyse and interpret trends and patterns in complex/advance data sets, based on data findings.\nCommunicate the results of their analysis and findings by using basic complex/advance visualisation techniques with both internal and external customers.\nTo ensure the availability of existing data analytics solutions (like reports, etc.) by maintaining them as well as improving them where shortcomings exist.\nAnalyses data, creates summary reporting, and performs analysis to support the decision-making of research, senior management, member companies, and internal departments.\nBuilds and manages/maintains a database to house data collected from various sources.\nGovernance\nImplement and provide input into the development of governance, compliance, integrity, and ethics processes within the area of specialisation.\nPeople\nDevelop and maintain productive working relationships with peers and team members to achieve predefined objectives.\nSearch for, integrate, and share new knowledge attained through formal and informal learning opportunities in the execution of your job.\nFinance\nAdhere to organisational policies and procedures to ensure cost-effectiveness and reduction of financial costs.\nClient\nContribute to a culture of service excellence, which builds positive relationships and provides opportunities for feedback and exceptional service.\nProvide authoritative, specialist services, expertise, and advice to internal and external stakeholders.\nBuild and maintain relationships with clients and internal and external stakeholders that promote cross-functional process delivery solutions.\n \nBehavioural competencies\nFairness and Transparency\nAccountability\nHonesty and Integrity\nTrust\nRespect\nHonesty and Integrity\nConceptual Ability\nAttention to Detail\nBuilding Sustainability\n \nTechnical competencies\nFunctional Policies and Procedures\nQuality Orientation\nFacilities Management\nService Delivery\n \nCompliance Competency\nGOC Confidential\n \nEmployment Equity\nThe Employment Equity policy of SARS will be considered as part of the recruitment and selection process and Persons with Disabilities are encouraged to apply. Successful candidates will be required to undertake an oath of secrecy, pre-employment screening, case study, pre-assessment, psychometric assessment and or vetting, and a declaration of private interest. The appointment is also subject to appropriate reference(s) and security clearance where applicable.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "RESEARCH: MACHINE LEARNING DATA SCIENTIST X3 (9864)\nPosition Reports to: Chief Data Scientist    \nDivision: Strategy Enab & Modernisation\nLocation: SARS Brooklyn\nAdvert Closing Date: 14 October 2024\n \nAbout the Position\nAt SARS we use data science and machine learning (ML) / artificial intelligence (AI) in collaboration with human experts to surface insights, predict outcomes and aid decision making to ultimately meet our strategic objectives and better serve our customers.\n\nThe Research: Machine Learning Data Scientist will play a crucial role in thinking creatively about our data and providing guidance on what to build, not just how to build – design, implement and validate statistical machine learning / artificial intelligence products in innovative ways to execute on projects that are a strategic priority for the organisation.\n \nJob Purpose\nTo provide expert advice and guidance in the design, implementation and validation of statistical machine learning / artificial intelligence products, be innovative in blending algorithms with the expertise of the organisation, to best serve the needs of SARS customers and support the organisation’s strategic intent of voluntary compliance. Use algorithms to improve operational efficiencies as well as detect non-compliance, conduct research and keep abreast of latest tools and models to be applied in resolving the organisation’s problems.\n \nEducation and Experience\nMinimum Qualification & Experience Required\nHonours / Postgraduate Diploma (NQF 8) in a quantitative field e.g. Actuarial Science, Statistics, Physics, Computer Science, Data Science, Machine Learning or similar AND 10-12 years' experience in a similar environment of which 3-4 years at a specialist level\nOR\nBachelor's Degree / Advanced Diploma (NQF 7) in a quantitative field e.g. Actuarial Science, Statistics, Physics, Computer Science, Data Science, Machine Learning or similar AND 12-15 years related experience of which 3-4 at a specialist level\nA Master’s degree would be advantageous\n \nMinimum Functional Requirements\nSkilled in statistics or machine learning.\nAble to read and digest academic papers to think creatively about our data and provide guidance on what to build.\nFluency in a coding language such as R, Python or similar.\nExcellent written and verbal communication. Able to articulate concepts effectively in different ways dependent on the audience – non-technical, non-ML technical, ML/DS practitioners.\nAdvanced level of experience with relational databases and SQL knowledge (5+ years).\nSome experience with non-relational databases e.g. DynamoDB (1+ years).\nExperience with different data format types e.g. JSON, Parquet, CSV, Pickle, XML (2+ years).\nSome experience with unstructured data and NLP techniques is desirable (not only ChatGPT e.g. Spacy, Hugging Face) (1+ year).\nIntermediate experience running end-to-end machine learning or research projects (must have been involved in operationalizing ML / AI projects).\nExperience with streaming data is an advantage.\nCloud experience on AWS, Azure, GCP, IBM Cloud is an advantage.\nExperience with foundational models (deploying as-is, using RAG or fine tuning) is an advantage.\n \nJob Outputs:\nProcess\nAnalyse and make recommendations about improvements to specialist systems, procedures, policies and practices.\nDevelop multiple practices in alignment with operational policy and procedural frameworks, supporting tactical development and excellence.\nIntegrate business information, compare, analyse and produce reports to identify trends, discrepancies and inconsistencies for decision-making purposes.\nStay up to date with DS/ML/AI techniques and trends and supporting architecture trends in the domain.\nThink creatively about the organisations’ data and provide guidance on what to build (using skills and innovative mindset to spot opportunities).\nShare best practices and learnings to the team and the wider data specialists across the organisation.\nAnalyse and critique Machine Learning models of teammates to continuously improve our artefacts.\nExpose Machine Learning outputs via APIs or similar, to stakeholders to use.\nDefine and build dashboards and analyses/reports that track KPIs, experiments and new initiatives.\nGovernance\nDevelop and/or align governance and compliance policies in own practice areas to identify and manage risk exposure liability.\nPeople\nIntegrate new knowledge and transfer skills attained through formal and informal learning opportunities in the execution of your job.\nProvide specialist expertise, support, advice and practice thought leadership in area of expertise.\nFinance\nImplement and monitor financial control, management of costs and corporate governance in area of specialisation\nClient\nParticipate in the specialist practice community and contribute positively to organisation knowledge management.\nDevelop and ensure implementation of own practices to build delivery excellence, encouraging others to provide exceptional stakeholder service.\nProvide authoritative, specialist expertise and advice to internal and external stakeholders\n \nBehavioural competencies\nAnalytical thinking\nAccountability\nConceptual ability\nOrganizational awareness\nBuilding Sustainability\nHonesty and Integrity\n \nTechnical competencies\nBusiness Knowledge\nData Collection and Analysis\nData Analytics\nEffective Business Communication\nFunctional Policies and Procedures\nReporting\nResearch\n \nCompliance Competency\nSecurity Clearance: GOC Confidential\n \n \nEmployment Equity\nThe Employment Equity policy of SARS will be considered as part of the recruitment and selection process and Persons with Disabilities are encouraged to apply. Successful candidates will be required to undertake an oath of secrecy, pre-employment screening, case study, pre-assessment, psychometric assessment and or vetting, and a declaration of private interest. The appointment is also subject to appropriate reference(s) and security clearance where applicable.\n \nPLEASE APPLY HERE",
                "BUSINESS AREA LEAD: CIVIL CASE SELECT STRATEGY\nPosition Reports to: Business Area Head: Case Selection  \nDivision: Taxpayer Engagement Operations\nLocation:  Head Office - Brooklyn\nAdvert Closing Date: 11 October 2024\n \nAbout the Position\nThe goal is to formulate the Head Office Civil Case Selection strategy and associated delivery plans related to multiple practice areas, ensuring practice integration and operational implementation through the achievement of Civil Case Selection Strategy objectives.\n \nJob Purpose\nTo provide leadership expertise in evaluating and selecting civil cases that align with the organisation’s goals, developing strategic plans for case management, efficiently allocating resources, monitoring case performance, and communicating with stakeholders.\n \nEducation and Experience\nMinimum Qualification & Experience Required\nRelevant Honours / Postgraduate Diploma (NQF 8) AND 10-12 years' experience in a similar environment, of which 3-4 years at the management level.\n# ALTERNATIVE\nRelevant Bachelor's Degree / Advanced Diploma (NQF 7) AND 12 - 15 years’ experience in a similar environment, of which 3-4 years at the management level.\n \nMinimum Functional Requirements\n \nJob Outputs:\nProcess\nAct as the bottom-line driver of best operating practices for Civil Case Selection Strategy.\nDefine and balance the best way to achieve business tactical intention through process, people and task determination for Civil Case Selection Strategy.\nOwn and oversee the practice of Civil Case Selection Strategy through compliance analysis and evaluation for Tax.\nFormulate the tactical strategy and associated delivery plans to manage the end-to-end process for Civil Case Selection Strategy.\nDevelop practices to identify and consolidate compliance risks across all taxpayer groups for Civil Case Selection.\nProtect organisation by establishing practices for compliance risk & Civil Case Selection Strategy standards, anticipating compliance trends.\nDevelop tactical strategy and delivery plans in support of functional objectives in partnership with leadership.\nDirect, control, coordinate and optimise budgeted resources to meet specific objectives and deliver agreed results and productivity requirements.\nEnsure the development and implementation of multiple practices in alignment with operational policy and procedural frameworks.\nIdentify and recommend opportunities to continuously improve all functions and systems in line with national, regional and organisational changes.\nPlan for handling work outputs, pull together interdependent activities & specify priorities, standards & procedures to ensure tactical excellence.\nProactively identify interconnected problems, determine its impact and use to develop best fit alternatives, driving best practice solutions.\nProvide periodic reports on performance against plan & progress on short-term initiatives & use to realign tactical plan and objectives appropriately.\nUse the insights gained through integrated business reports to measure success & realign tactical strategy development objectives appropriately.\nRecommend changes to optimise processes, systems, policies and procedures, and direct the implementation of change and innovation initiated by the organisation.\nGovernance\nImplement governance, risk and compliance policy in own practice areas to identify and manage governance and risk exposure liability.\nManage and or advise on the translation and application of policy in a specific functional area.\nPlan & develop enhanced organisational efficiency by identifying and addressing development requirements & providing tools for people resources.\nPeople\nPlan & develop enhanced organisational efficiency by identifying and addressing development requirements & providing tools for people resources.\nCreate a positive work climate & culture to energise employees & give meaning to work, minimise work disruption and maximise employee productivity.\nDevelop & implement appropriate people capacity plans in line with delivery & efficiency targets, on budget & in partnership with specialised areas.\nFinance\nImplement and monitor financial control, management of costs and corporate governance in area of accountability.\nDraw up a budget aligned to business unit delivery plans, monitor planned vs. actual, minimise expenditure and report on cost efficiency.\nClient\nManage an integrated service excellence culture, which builds rewarding relationships and provides opportunities for feedback and exceptional service.\nDevelop and ensure implementation of practices which build service delivery excellence and encourage others to provide exceptional client service.\nBuild strong relationships and develop service-level agreements that promote SARS with internal and external stakeholders.\n \nBehavioural competencies\nHonesty and Integrity\nTrust\nRespect\nProblem Solving and Analysis\nFairness and Transparency\nAccountability\nConceptual Thinking\nBuilding Sustainability\nDeveloping Others\nChampioning the Mandate\nInfluencing Others\nMobilising Teams\nDriving for Excellence\nLeveraging Diversity\nAccurate Understanding\n \nTechnical competencies\nFunctional Policies and Procedures\nManagerial Budgeting\nRisk Knowledge\nRisk Awareness\nFunctional Policies and Procedures\nReporting and Interpretation\nTax Knowledge\nFinancial Accounting\nBusiness Knowledge\nStrategic Planning\nInvestigative Skills\nGovernance, Ethics and Values\nEffective Business Communication\nProblem Analysis and Judgement\nPlanning, Management and Measurement\nDecisiveness\nBusiness Acumen\nStatistical and Mathematical Analysis\n \nCompliance Competency\nGOC Secret\n \n \nEmployment Equity\nThe Employment Equity policy of SARS will be considered as part of the recruitment and selection process and Persons with Disabilities are encouraged to apply. Successful candidates will be required to undertake an oath of secrecy, pre-employment screening, case study, pre-assessment, psychometric assessment and or vetting, and a declaration of private interest. The appointment is also subject to appropriate reference(s) and security clearance where applicable.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "paf3f8113-7f8b-43a8-88c3-afc4a1fa9a19"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ccma_orig.jpg",
            "href": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies5893514",
            "title": "COMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA) VACANCIES",
            "content": [
                " \nCOMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA)\n ",
                " \n \nPART-TIME INTERPRETER (INDEPENDENT CONTRACTOR)\nNorth West Province – Rustenburg Office\nRef: NWROPT10-24\nRate Per Day: R929.03\nThe North West Province – Rustenburg Office requests the services of a Part Time Interpreter.\n \nPurpose: To assist the CCMA Commissioners and structures by providing interpreter services to facilitate successful outcomes of CCMA activities.\n \nKey Performance Areas:-\nVerbal interpretations during hearings.\nAdministrative support functions.\n \nKey Requirements:\nMatric Certificate\nNational Diploma in Labour Related Qualification.\n1 year experience\nKnowledge on latest legislation/ amendments.\n \nLanguages: SeTswana, isiZulu, isiXhosa and English.\n \n \nNOTE FOR ALL APPLICANTS:    \nStrictly apply via the link provided: https://forms.office.com/r/wgsngX9AzT\n \nIn your online application for appointment, kindly ensure that you disclose all relevant material information to assist the panel in considering your application.\n \nDetailed CV, copies of qualifications, driver’s license & ID document must be uploaded. Failure to complete the online form in full or not provide relevant information will automatically disqualify your application.\n \n*Only One (1) online application should be submitted.\n \nNo emailed or hand-delivered applications will be accepted. Non-adherence to the stated procedures in applying as well as incomplete application will result in the disqualification of the application.\n \nClosing date: 08 October 2024\n \n N.B Incomplete and late applications will automatically be disqualified.\n \nIf we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The CCMA reserves the right not to make an appointment. It is the intention of the CCMA to promote representivity in respect of race, gender and disability through the filling of the posts. Preference will be given to candidate from the designated groups.\n \nPeople with disabilities are encouraged to apply.\n \n \n \n \n ",
                "OFFICER: FRAUD AND ETHICS\nNational Office\nREF: OFRET10-24\nPost level:07\nThe Governance and Secretariat Services Unit has a vacancy of Officer: Fraud and Ethics.\n \nPurpose\nTo uphold the highest ethical standards at the CCMA by ensuring compliance with laws and policies, preventing fraud and corruption, and managing the declaration and handling of gifts.\n \nKey Performance Areas:-\nDevelop and implement the Annual Fraud Prevention and Anti-Corruption Strategy.\nParticipate in regular fraud risk assessments and manage the Fraud Risk Register.\nMonitor and oversee compliance with policies on conflicts of interest, extraneous employment, gifts, donations, and sponsorships, amongst others.\nOffer advisory services on ethical issues and manage the CCMA Fraud Hotline.\nProvide fraud and ethics training and conduct awareness programs.\nEmbed a culture of good corporate governance.\nEthics, Fraud and Anti-Corruption Reporting.\n \nKey Requirements:\nB-degree in Commerce / Law, Corporate Governance / Risk Management and Compliance or equivalent.\nMinimum 5 years’ experience as an Ethics Officer or in a similar role.\nEthics Officer Certification Programme (EOCP) or equivalent. (Preferred)\nStrong analytical, facilitation and communication skills.\n \nKnowledge\nStrong knowledge of ethical principles, legal requirements, and anti-corruption practices.\nEthics Management\nKnowledge of general administration and business improvement principles:\nKnowledge of MS Office programmes\nHigh level of integrity and the ability to handle sensitive information confidentially.\n \nSkills and Behavioural Competencies\nPlanning and organising\nCollaboration\nFlexibility\nEthical\nInfluencing and assertiveness\nStress tolerance and ability to prioritise and work under pressure\nProject Management Skills / Professional/technical expertise\nMust be a peoples’ person with sound interpersonal skills\nProblem solving and decision-making skills\nSound communication skills (oral and written), good presentation skills, and ability to research and write comprehensive reports.\n \n \nNOTE FOR ALL APPLICANTS:    \nStrictly apply via the link provided: https://forms.office.com/r/VU210FNcDR\n \nIn your online application for appointment, kindly ensure that you disclose all relevant material information to assist the panel in considering your application.\n \nDetailed CV, copies of qualifications, driver’s license & ID document must be uploaded. Failure to complete the online form in full or not provide relevant information will automatically disqualify your application.\n\n \n*Only One (1) online application should be submitted.\n \nNo emailed or hand-delivered applications will be accepted. Non-adherence to the stated procedures in applying as well as incomplete application will result in the disqualification of the application.\n \nClosing date:  08 October 2024\n \nN.B Incomplete and late applications will automatically be disqualified.\n \nIf we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The CCMA reserves the right not to make an appointment. It is the intention of the CCMA to promote representativity in respect of race, gender and disability through the filling of the posts. Preference will be given to candidates from the designated groups.\n \nPeople with disabilities are encouraged to apply.",
                "MANAGER: PLANNING AND PERFORMANCE MONITORING\nNational Office\nREF: MPPMU10-24\nPost level: 04\nThe Governance and Secretariat Services Unit has a vacancy of Manager: Planning and Performance Monitoring.\n \nPurpose\nUtilising appropriate strategic management tools, the Manager: Planning and Performance Monitoring is to manage the CCMA’s planning processes, both at a strategic and operational level, ensuring that in the delivery of the CCMA’s vision, mission and mandate, there is in place an approved Strategic Plan and Annual Performance Plan. Furthermore, it is the responsibility of the Manager: Planning and Performance Monitoring to ensure that Departments and Provinces are operating on approved Operational Plans. Moreover, the Manager: Planning and Performance Monitoring is to facilitate performance information reporting (quarterly and annually) and performance monitoring and evaluation processes of the CCMA, including conducting mid and end-term impact assessments.\n \nKey Performance Areas:- \nConduct strategic forecasting and situational analysis\nFacilitate strategic planning (Strategic Plan and Annual Performance Plan)\nCoordinate annual operational planning (Departmental and Provincial Operational Planning)\nLead organisational performance monitoring (Strategic and Operational)\nConduct mid and end–term impact assessments\nProduce performance information dashboards\nProduce quarterly consolidated/integrated performance reports\nLead the production of the annual report project\nUnit Management including people management and budget management\n \nKey Requirements:\n \nAppropriate Bachelor’s Degree or Equivalent (Social Sciences/Developmental Studies/Public Administration/Public Management/BCom)\nPostgraduate qualification in Business Administration, Public Management, Strategic Management or Monitoring and Evaluation will be an added advantage.\nA minimum of 5 to 8 years’ experience in strategic planning, monitoring, and evaluation, with 3 years at managerial level.\nAdvanced practical knowledge and practical experience in using strategy and performance management tools\nAdvanced knowledge of planning and performance monitoring frameworks and guidelines governing the CCMA as a public entity.\nGood understanding of legislations and policies applicable to the CCMA as a public entity\n \nKnowledge \nMonitoring and evaluation\nStrategic Planning\nProject Management\nCorporate Governance\nAdministration\nReport and presentation\nRelevant legislation\n \nSkills and Behavioural Competencies\nAbility to work under pressure and meet deadlines.\nAbility to work independently and as part of a team.\nComputer literacy\nExtensive knowledge and understanding of legislative requirements applicable to public entities, including Corporate Governance principles, King codes, Companies Act and Regulations, LRA, PFMA, PAIA and POPIA.\nKnowledge and application of project management.\nGood communication and writing skills\nDesign, Coordinate, and implement a monitoring and evaluation framework\n \n \nNOTE FOR ALL APPLICANTS:    \n \nStrictly apply via the link provided: https://forms.office.com/r/Rq3tGLn6Rz\n \nIn your online application for appointment, kindly ensure that you disclose all relevant material information to assist the panel in considering your application.\n \nDetailed CV, copies of qualifications, driver’s license & ID document must be uploaded. Failure to complete the online form in full or not provide relevant information will automatically disqualify your application.\n \n*Only One (1) online application should be submitted.\n \nNo emailed or hand-delivered applications will be accepted. Non-adherence to the stated procedures in applying as well as incomplete application will result in the disqualification of the application.\n \nClosing date:  08 October 2024\n \nN.B Incomplete and late applications will automatically be disqualified.\n \nIf we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The CCMA reserves the right not to make an appointment. It is the intention of the CCMA to promote representativity in respect of race, gender and disability through the filling of the posts. Preference will be given to candidates from the designated groups.\n \nPeople with disabilities are encouraged to apply. "
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p999c175c-a881-4ef1-aa5d-1b67821fe28e"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/eskom_orig.png",
            "href": "https://www.govpage.co.za/eskom-vacancies-blog/eskom-vacancies3598072",
            "title": "ESKOM VACANCIES",
            "content": [
                " \nESKOM\n ",
                " \n \nCHIEF EXECUTIVE OFFICER - ESKOM DEVELOPMENT FOUNDATION (AT SENIOR MANAGER LEVEL)-INTERNAL AND EXTERNAL\nVacancy type: Executive\nTask Grade : E-Band\nArea of Specialization : Reporting to Group Executive Government and Regulatory Affairs, the Chief Executive Officer will be responsible to strategically lead and manage the Eskom Development Foundation (ESDF) and position Eskom as a top five performing utility supporting CSR\nDepartment : Eskom Development Foundation\nBusiness Unit : Eskom Development Foundation\nLocation : South Africa (Gauteng)\nReference Number : RE-GRADExec49982205\nClosing Date : 10/15/2024\n \nMinimum Requirements\n\nQualification(s):\nB Degree in Business Management/ Finance or similar\nA Postgraduate in business management qualification, e.g. MBA/ MBL or similar will be an advantage.\n\nRelated experience:\n10 Years’ extensive experience in a management capacity (at least 5 years) in a corporate environment.\nCorporate Social Responsibility (CSR) experience\nProven track record in leading key initiatives with a high degree of complexity.\n \nSkills and Competencies\n\nBehavioural:\nIntegrity\nHonesty\nTrustworthiness\nProfessionalism\n\nLeadership:\nCoaching, mentoring, compassion.\nAstute group facilitation, cross functional and conflict resolution capability.\nStrategic and conceptual thinking skills.\nAbility to integrate and synthesise a broad range of information sources into effective management decision making information.\nFinancial and general management acumen.\n\nKnowledge:\nKnowledge of Eskom business operations\nKnowledge of the South African Corporate Social Responsibility context\nIntegration methodologies and approaches\nProgramme management\nStrategic management\nKnowledge of best practice for Corporate Social Responsibility\nKnowledge of corporate governance\n\nSkills:\nExcellent verbal and written communication\nAnalysis and reporting.\nMarketing and stakeholder management\nLeadership development\nGeneral and operations management e.g. (planning, leading, organising and controlling).\nProgramme/project management/ tracking and monitoring\nCustomer service orientated and experienced in management.\nCoordination and integration of teams and activities\nFinancial and commercial management\nBusiness assurance and compliance management\nBusiness performance management, incentives, and performance scorecard management\nStrategic business and enterprise risk and resilience management\nEmployee relations and human resources management\nComputer applications (Microsoft Office, Windows)\n \nKey Responsibilities\nStrategically providing Corporate Social Responsibility (CSR) awareness and leadership to high impact Eskom-wide business imperatives.\nManage and lead the Eskom Development Foundation service delivery to ensure effectiveness and compliance to policies, frameworks and methodologist whilst achieving internal and external stakeholder and customer satisfaction.\nStrategically leading CSR effectiveness and Eskom Development Foundation business performance and governance by providing strategic support to improve decision making and proactively driving business improvement.\nEstablish and manage strategic relationships with key internal and external stakeholders and positioning Eskom as a lead caring corporate citizen.\nEnsure effective resources management of the Eskom Development Foundation\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.” Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” Eskom is committed to being an employer of choice, one that inspires highly talented employees to join and stay, and it continues to attract and retain the best talent to achieve organisational goals.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nSENIOR MANAGER STAKEHOLDER RELATIONS-MEGAWATT PARK-(INTERNAL AND EXTERNAL)\nVacancy type: Executive\nTask Grade : E-Band\nArea of Specialization : Reporting to the Group Executive Government and Regulatory Affairs (GRAD), the Senior Manager Stakeholder Relations will be responsible to provide strategic leadership for all activities related to stakeholder relations, enhance relationships.\nDepartment : Stakeholder Relations\nBusiness Unit : Stakeholder Relations\nLocation : South Africa (Gauteng)\nReference Number : GradExec50808813\nClosing Date : 10/15/2024\n \nMinimum Requirements\n\nQualification(s):  \n\nB Degree in Communication/Journalism/Political studies/Business Management at a NQF 7 level with 360 credits or\nB Tech in Communication/Journalism/Political Studies/Business Management at a NQF 7 level with 360 credits or an\nAdvanced Diploma in Communication/Journalism/Political Studies/Business Management at a NQF 7 level with 360 credits or a\nNational Higher Diploma in Communication/Journalism/Political Studies/Business Management at a NQF 7 level with 360 credits.\n\nExperience:\n10 Years’ extensive experience in government relations/ public affairs/ advocacy and lobbying/ international politics/ international relations/protocol.\n \nSkills and Competencies\n\nBehavioural:\nIntegrity\nHonesty\nTrustworthiness\nProfessionalism\n\nLeadership:\nTeam player\nMotivating teams\nCoaching\nMentoring\nDeveloping\n\nKnowledge:\nGood knowledge of energy industry\nWorkings of political and governmental environments\nWide knowledge of world issues\nUnderstand intelligence methodologies.\nKnowledge of critical stakeholder management\n\nSkills:\nExcellent communication and negotiation\nStrong financial, business, and general management\nStrong facilitation and networking\nStrong analytical\nAct as an advisor to executives\nExtensive leadership\n \nKey Responsibilities\nStrategize stakeholder relations in Eskom and develop strategies and plans.\nManage stakeholder relations resources.\nManage the internal stakeholder management fraternity.\nProvide a strategic stakeholder management advisory role.\nInteract with executives, key government and Parliament officials and business stakeholders.\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.” Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised. Candidates with disabilities are encouraged to apply for positions.” Eskom is committed to being an employer of choice, one that inspires highly talented employees to join and stay, and it continues to attract and retain the best talent to achieve organisational goals.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nCLERK\nVacancy type: External/Internal\nTask Grade : T05\nArea of Specialization : Perform clerical tasks as required\nDepartment : Materials Management\nBusiness Unit : Supply Chain Management\nLocation : South Africa (Gauteng)\nReference Number : ERI 0012703\nClosing Date : 10/21/2024\n \nMinimum Requirements\n\nQualification(s):\n•  Grade 12 Certificate\n•  Office Administration Certificates will be advantageous\n\nExperience:\n•  2 years related experience\n \nSkills and Competencies\n\nSkills:\n•  Computer Literacy (MS Office Suite)\n•  Attention to Details\n•  Time Management\n•  Basic Communication Skills – Verbal and Written\n•  Telephone Etiquette\n\nKnowledge:\n•  SAP Administration\n•  General Office Administration and Systems Knowledge\n\nAttributes:\n•  Interpersonal Skills\n•  Ethical and Honest\n•  Integrity to Maintain Confidentiality\n•  Punctuality\n•  Ability to work Under Pressure\n \nKey Responsibilities\n•  Administration\n•  SHEQ\n•  Training\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nSTOREPERSON\nVacancy type: External/Internal\nTask Grade : T06\nArea of Specialization : To provide effective warehouse services\nDepartment : Materials Management\nBusiness Unit : Supply Chain Management\nLocation : South Africa (Gauteng)\nReference Number : ERI 0012705\nClosing Date : 10/21/2024\n \nMinimum Requirements\n\nQualification(s):\n•  Grade 12\n\nExperience:\n•  1 year related experience\n \nSkills and Competencies\n\nSkills:\n•  Team player\n•  Numeracy\n•  Computer literacy\n•  SAP\n•  Operate material handling equipment\n•  Problem solving\n•  Computing\n•  Communication\n•  Warehouse operations skills\n\nKnowledge:\n•  OHSA\n•  Industrial relationship\n•  Legal liability\n•  Supply chain operations\n•  Warehouse work skills programme – training course\n\nAttributes:\n•  Accountable\n•  Proactive\n•  Punctuality\n•  Integrity\n•  Honesty\n \nKey Responsibilities\n•  Perform warehouse duties\n•  Conduct preservation activities\n•  Operation of the materials handling equipment as and when required\n•  Adhere to the OHS act and health and safety regulations.\n•  Perform administrative activities\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nOFFICER QUALITY CONTROL\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide Quality Control services including inspections, quality of workmanship, and testing, to ensure compliance to standards, regulations, and project requirements.  Area of specialization in Control & Instrumentation (C&I)\nDepartment : Quality Control\nBusiness Unit : Coal and Clean Technology Portfolio\nLocation : South Africa (Limpopo)\nReference Number : 50855036EMK\nClosing Date : 10/21/2024\n \nMinimum Requirements\n\nQualification(s):\n• National Diploma in Quality Management/Engineering/ Built Environmental/ Auditing at NQF level 6 with 240 credits\n\nRelated Minimum Experience:\n• 3 years related experience in technical quality control inspections and tests environment including special processes i.e. material specifications/requirements, welding and fabrication inspections etc/ quality management system implementation and auditing with a special process training qualification as an International Welding Specialist (IWS) or International Welding Professional (IWP)\n \nSkills and Competencies\nBehavioral\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism\n\nLeadership\n• Team player\n• Able to identify critical division/project/business unit activities and the impact of delays\n• Able to influence the thinking and activity of others\n• Allocate and utilise resources both human and technical in relation to division/project/business unit delivery schedules\n• Utilise diplomacy and tact in influencing others (listens -well)\n• Identify common ground and uses this to pursue win-win solutions\n• Continuously challenges and re-evaluate implementation\n\nKnowledge\n• Sound knowledge of quality control and related elements\n• Benchmark effectively\n• Display awareness of and an ability to introduce and implement new technologies where appropriate\n• Understating and knowledge of quality and other management systems relevant to the business\n• Create and implement systems to monitor quality and efficiency\n• Understating the relevant elements of the quality value chain and the implementation strategy\n• Define key roles and expectations of individuals and ensure regular monitoring and reporting\n• Identify potential problems, soliciting suggestions to improve performance and resolving problems effectively\n• Articulate quality standards/codes/specifications for team/section\n• Integrate information from variety of sources and make sound decisions that consider the needs of a multi-disciplinary environment\n\nSkill\n• Analytical\n• Auditing\n• Project management\n• Presentation and communication\n• Interpersonal and negotiations\n• Interact at various levels\n \nKey Responsibilities\nProvide input to the development of Contract Quality Plans (CQPs) and Inspection and Test Plans (ITPs).\n\n• Provide inspection services for all stages of manufacturing, shipping and transportation, preservations, site works, commissioning, outages, maintenance, operations, data books and handover.\n• Execute inspection and test measuring and monitoring services for special processes.\n• Provide supplier quality specification and related documentation.\n• Monitor supplier quality performance and reporting.\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL  recruitmentgcd@eskom.co.za\n **\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”  \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nENGINEER PROF ENGINEERING HVP X1 NATIONAL TRANSMISSION COMPANY SOUTH AFRICA ESKOM PARK, MPUMALANGA READVER\nVacancy type: External/Internal\nTask Grade : P13\nArea of Specialization : To provide engineering design, asset care and technical solutions.\nDepartment : High Voltage Plant\nBusiness Unit : North East Grid\nLocation : South Africa (Mpumalanga)\nReference Number : 50833437TM- 01\nClosing Date : 10/18/2024\n \nMinimum Requirements\n\nQualification(s):\nBSc Eng or B Eng Electrical Engineering\n\nExperience:\n2 Years Technical experience in power Generation, Transmission or Distribution\nProfessional Registration Body: Engineering Council of South Africa (ECSA) as candidate engineer\n \nSkills and Competencies\n\nBehavioural:\n• Professionalism\n• Honesty\n• Integrity\n• Safety Consciousness\n• String drive to learn\n• Be results and delivery focused\n• Trustworthiness\n\nLeadership:\n• Entrepreneurial mindset\n• Ability to build effective relationships and delivery on expectations.\n• Coaching and mentoring\n• Be able to work as part of the team\n\nKnowledge:\n• Power plant systems and technology\n• Design codes and standards\n• Engineering theory\n• Relevant processes, policies, guideline, and legislation\n• Engineering design\n• Cost analysis/economic evaluation\n• Extensive experience in successful plant configuration and project management technical problem solving.\n\nSkills:\n• Communication\n• Analytical\n• Multi-disciplinary problem solving\n• Technical report writing\n• Presentation\n• Life cycle planning\n \nKey Responsibilities\n• Condition Monitoring of HV Plant equipment\n• Execute design work.\n• Contribute to the integrity of the asset base\n• Deliver standardized outputs\n• Perform technical studies\n• Consult on discipline related issues\n\nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitment@ntcsa.co.za\n \nKindly apply for the position online by clicking on the link below:\n \n “If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“NTCSA is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of NTCSA and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  NTCSA reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nNTCSA is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \n \nOFFICER SAFETY X1 NATIONAL TRANSMISSION COMPANY SOUTH AFRICA ESKOM PARK, MPUMALANGA\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To establish and maintain Occupational Hygiene and Safety processes within the framework of legislation, ISO 45001 standards, procedures, systems, and processes according to Business Unit/Operating Unit requirements.\nDepartment : Safety\nBusiness Unit : North East Grid\nLocation : South Africa (Mpumalanga)\nReference Number : 50520650TM-01\nClosing Date : 10/15/2024\n \nMinimum Requirements\n\nQualification(s):\n• National Diploma in Safety Management/Behavioural Sciences/Environmental Sciences/Environmental Health at NQF 6 with240 credits\n\nExperience:\n• 3 Years of Experience in a human safety management environment\n \nSkills and Competencies\n\nBehavioural:\n• Integrity\n• Honesty\n• Trustworthiness\n• Professionalism\n• Initiative and action oriented\n• Customer focused\n• Be able to work as part of team\n• Strong drive to learn\n• Result and delivery driven/focused\n• Safety Consciousness\n\nLeadership:\n• Strong communication skills\n• Ability to build effective relationships and delivery on expectations\n• Coaching and mentoring\n\nKnowledge:\n• Human safety performance understanding\n• Risk analysis principles\n• Project management principles\n• Sound knowledge and understanding of human behaviour and occupational hygiene and safety\n• Understanding of organisational behaviour\n• Knowledge of Business Processes Management\n• Legal Knowledge\n\nSkills:\n• Analytical and Problem solving\n• Process consultation\n• Project management\n• Facilitation skills\n• Negotiation and contracting\n• Presentation\n• Communication\n• Planning\n• Training\n• Interpersonal relational\n \nKey Responsibilities\n• Provide business and department managers/leadership with professional integrated human safety management (HSM) advice.\n• Facilitate the implementation of human safety performance initiatives.\n• Facilitate the implementation of the human safety performance framework.\n• Compilation and determination of specific OHS risk assessments and controls\n• Establish, Implement and maintain OHS programs within the parameters of legal requirements, OHSAS 18001 ISO 45001, standards and procedures\n• Provide a service and guidance with respect to OHS for employees, contractors/suppliers, customers and members of the public\n• Provide OHS awareness, training and communication service\n• Do inspections, audits and reviews to ensure compliance to legislation and Eskom requirements\n• Administrative functions\n\n \nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitment@ntcsa.co.za\n \nKindly apply for the position online by clicking on the link below:\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“NTCSA is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of NTCSA and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  NTCSA reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nNTCSA is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nSENIOR ADVISOR ENVIRONMENTAL MANAGEMENT (WATER) X2, GENERATION, MEGAWATT PARK\nVacancy type: External/Internal\nTask Grade : G15\nArea of Specialization : To provide support and assurance to Eskom that environmental related risks are identified and managed appropriately with focus on water management\nDepartment : Environmental Management\nBusiness Unit : Office of the GE\nLocation : South Africa (Gauteng)\nReference Number : 49993873LM\nClosing Date : 10/21/2024\n \nMinimum Requirements\n\nQualification(s):\n• Grade 12 and a 3-year Degree in Natural Sciences with 4 years related minimum experience (which can include a completed Training Program for Graduates) or\n• B-Tech with 6 years related minimum experience (which can include a completed Training Program for Graduates) or\n• National Diploma with 8 years related minimum experience (which can include a completed Training Program for Graduates)\n• Professional Registration Body: None but professional registration/ability to register an advantage\n \nSkills and Competencies\n\n• Behavioural\no Integrity\no Honesty\no Trustworthiness\no Professionalism\n\n• Leadership\no Team player\no Motivating teams\no Coaching\no Mentoring\no Developing etc.\n\n• Knowledge\no Relevant environmental related legislation\no Water Use Licence Application Process\no Good understanding of power generation water management including water treatment processes.\no Ground and surface water management\no Blue and Green Drop Programme\no EMS ISO 4001\n\n• Skill\no Communication skills\no Analytical, numerical and data management skills\no Problem Solving\no Research knowledge\no Presentation skills\no Computer literacy\no Report writing\no Intermediate Excel Skills (Advance skills will be advantageous)\no Relevant Environmental legislation\n \nKey Responsibilities\n1. Minimise water risks to Eskom in terms of related Environmental aspects\n2. Monitor and measure water management performance within Generation Division.\n3. Manage water use licence applications for projects and existing water use licence authorisation amendments.\n4. Assure that Eskom complies with internal water targets/standards/procedures and legal requirements.\n5. Provide environmental technical support and advisory on water related matters.\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recuitmentgx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nBUSINESS ANALYST INFO TECHNOLOGY, GENERATION, MEGAWATT PARK\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To utilize information technology, understand, capture, document and maintain business requirements, facilitate solution development and deliver and deliver relevant information technology services, solutions\nDepartment : P and SCM\nBusiness Unit : Head Office\nLocation : South Africa (Gauteng)\nReference Number : 50867242PL\nClosing Date : 10/21/2024\n \nMinimum Requirements\nQualification(s):\n• National Diploma in Information Technology/Information Management at NQF6 with 240 credits.\n\nExperience:\n• 3 Years Related Minimum Experience in information technology/information environment with relevant business.\n \nSkills and Competencies\n• Behavioural\n- Professionalism\n- Honesty\n- Integrity\n- Self-Motivated\n\n• Leadership\n- Team Player\n- Coaching\n\n• Knowledge\n- Understanding relevant business processes\n- Information Technology\n- Application delivery & Management Processes\n- Business operations management\n- Solution delivery elements\n\n•     Skill\n- Analytical\n- Communication and presentation\n- Facilitation\n- People\n- Customer liaison\n- Relationship building\n- Problem solving\n- Communication & influence various levels of management\n- Conflict handling\n- Negotiation\n- Interpersonal\n- Work under pressure & deadlines\n \nKey Responsibilities\n• Obtain and interpret business requirements or identity, develop and implement business intelligence initiatives.\n• Facilitate Business as Usual (BAU) requests and application health on existing applications.\n• Document information technology (IT), information system (IS) solution requirements.\n• Provide project support.\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recuitmentgx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nRE - ADVERT SENIOR ADVISOR PROF OCCUPATIONAL HYGIENE-GENERATION GROOTVLEI POWER STATION\nVacancy type: External/Internal\nTask Grade : P15\nArea of Specialization : To develop, direct, influence and manage the Eskom occupational hygiene management programme ensuring a healthy, safe working environment and legal compliance.\nDepartment : Health and Safety\nBusiness Unit : Grootvlei Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : RE-SFT20240916\nClosing Date : 10/14/2024\n \nMinimum Requirements\nB Degree/B Tech/Advanced Diploma in Environmental Management/Safety Management at NQF7 with 360 credits\n\nProfessional Registration Body: \nRegistered with South African Institute of Occupational Hygiene (SAIOH) as Registered Occupational Hygienist (ROH), as required by the Department of Employment and Labour\n\nRelated Minimum Experience:\n5 Years Extensive experience in the relevant occupational hygiene environment.\n \nSkills and Competencies\n\nBehavioural\nAccountability\nTrustworthiness\nProfessionalism\nIntegrity\n\nLeadership\nBusiness acumen\nResults orientation\nTeam player\n\nKnowledge\nAudit Level 3\nFinancial Analysis and Management Reporting Level 4\nFinancial Risk Assessment Level 4 \nFinancial Systems Knowledge Level 4 \nFinancial Systems Implementation and Enhancement Level 4\nNegotiation and Project Management Level 4\nPerformance Management Reporting Level 4\nPolicy Interpretation, Formulation, and Implementation Level 4\nProject Accounting Level 4\nSystems, Applications and Products (SAP) Level 3\nWorkflow Systems Level 3 and general systems\nInternational Financial Reporting Standards (IFRS), Companies Act, Public Finance Management Act (PFMA) and other relevant legislation\nInternational Organisation for Standardisation (ISO)/South African National Standards (SANS) 17025 and ISO/SANS 17020\nNational and international networking regarding latest occupational hygiene developments \n\n\nSkill\nAdvisory \nAnalytical \nInterpersonal \nNegotiation \nConceptual thinking \nGeneral management \nProblem solving \nInnovative and creative\nLeadership\nCommercial  awareness and judgement\nPeople management\nStrategy awareness\nConflict resolution\nCommunication and engagement\nCustomer orientation\nDecision making\nInformation technology (IT) literate \nSoftware literate Microsoft Office Excel, Word, etc\n \nKey Responsibilities\nManage occupational hygiene programs.\nEnsure occupational hygiene and legal compliance.\nManage health risk assessments.\nAnalyse and evaluate occupational hygiene stressors.\nResearch and implement occupational hygiene control measures\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL BELOW ** recuitmentgx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "OFFICER PROCUREMENT (GENERATION) GROOTVLEI POWER STATION X3\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide efficient and effective procurement of goods and services (i.e., high value, high risk), timeously, within budget and in accordance with procurement policies, procedures and practices\nDepartment : Procurement\nBusiness Unit : Grootvlei Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : 50768001NN\\GVL\nClosing Date : 10/14/2024\n \nMinimum Requirements\n\nQualification(s):\nNational Diploma /National N Diploma in Commerce/Transport Logistics & Supply Chain Management at NQF 6  with 240 credits\n\nExperience:\n3 years experience in Commercial / Supplier Management experience\n \nSkills and Competencies\nComputer Literacy\nTotal Cost of Ownership Analysis\nFinancial Analysis\nStrategic Thinking & Decision Making\nStrong Negotiation Skills\nRelationship Management Skills\nStrong Analytical Skills\nStrong communication skills\nAbility to work and interact effectively\nFacilitation skills\nAdministrative skills\nAttention to detail\n \nKey Responsibilities\nExecute integrated sourcing and procurement processes and follow prescribed procedures towards fulfilling procurement needs.\nExecute purchases of goods and services and manage procurement administration.\nNegotiate and coordinates conclusion of agreement with suppliers to meet customer expectations.\nPerform dual adjudication of tenders and management of contracts/ purchases orders within set policies and standards.\nAccess, analyse procurement information independently.\nUse own discretion to manage problems / risks and make recommendations timeously.\nBuild and maintain healthy interpersonal and inter-team relationships.\n\nIf you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE",
                " \n\n\n\n\nQUALITY MANAGEMENT\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To provide quality assurance support to project/divisional/business unit process owners, delivery, support teams and governance regarding quality management systems and supplier quality management requirements.\nDepartment : Quality Assurance\nBusiness Unit : Majuba Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : GX50452997BN/MAJ\nClosing Date : 10/15/2024\n \nMinimum Requirements\nNational Diploma Quality Management/Engineering/Auditing/InformationTechnology/Information Systems/Computer Science/Built Environment at NQF6 with 240 credits. 3 years Quality Assurance experience with ISO 9001 exposure in the relevant environment e.g., division, power station, project etc.\n \nSkills and Competencies\nBehavioural:\nIntegrity, Honesty, Trustworthiness, Professionalism,\nLeadership:\nTeam player\n\nKnowledge:\n• Relevant South African National Standards (SANS)/International Organisation for Standardisation (ISO) standards\n• Site quality management practices and techniques\n• Industry specific codes\n• ISO 9000, 9001, 19011\n\nSkill\n• Computer literate Microsoft (MS) Office Suite\n• Good report writing\n• Interpersonal\n• Time management\n• Good communication\n• Decision making\n• Analytical\n• Problem-solving\n \nKey Responsibilities\n• Ensure quality management.\n• Conduct quality measurement, analysis and improvement.\n• Provide audit management support.\n• Conduct supplier quality management activities.\n• Provide quality reports.\n \n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL (Choose your BU) ** recuitmentgx@eskom.co.za\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p60ce17a1-9e22-4299-aa96-58ebe3d80b04"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/housing-development-agency-hda_orig.jpg",
            "href": "https://www.govpage.co.za/housing-development-agency-hda-vacancies-blog/housing-development-agency-hda-vacancies3372423",
            "title": "HOUSING DEVELOPMENT AGENCY (HDA) VACANCIES",
            "content": [
                " \nHOUSING DEVELOPMENT AGENCY (HDA)\n \nThe Housing Development Agency (HDA) is a national public sector development agency that inter alia has the mandate to identify, acquire, prepare, and develop suitable land for human settlements. The agency also undertakes the programme and project management for development of housing and human settlements. The HDA carries out its functions in partnership with a range of stakeholders including national, provincial, and local government as well as with communities, developers, and financiers. Established in 2009, the Agency was established by an Act of Parliament in 2008 and is accountable through its Board to the Minister of Human Settlements.\n \nFor more information about the HDA, please visit our website: www.thehda.co.za.\nFollow us on X @the_hda and on Facebook: The Housing Development Agency.\nLinkedIn @The Housing Development Agency\n ",
                " \n \nThe HDA has the following Fixed Term Contract position:\n \nPROJECT MANAGER: ENGINEER\nLocation: North West\nReporting Line: Development Manager\nRef: HDA PMENW002\n \nMain Purpose: To define, manage and monitor the implementation of Engineering, infrastructure, and project technical support for the North West programme as well as providing technical support to all projects implemented (including planning projects) within the NW province).\n \nKey Performance Areas:\n1. Strategic Management\n• Contributing as a Project Manager to the overall effective functioning of the HDA assigned projects in the province.\n• Ensuring integration of the different project function within the Provincial Office to ensure optimal delivery of the HDAs mandate.\n• Ensure the alignment of projects to the broader HDA strategy and strategic intention.\n2. Project Development\n• Develop and maintain a project programme.\n• Interpret engineering services report during Land Use Management\n• Align programme to HDA strategic direction, policy, and plans.\n• Take into account and accommodate sector development and changes in the programme approach and strategy tailored for specific service offering to organs of state.\n3. Programme support and services to clients\n• Develop project plans to ensure achievement of agreed services.\n• Define project feasibility factors, resourcing requirements and project deliverables and time frames.\n• Develop project plans in line with HDA project service offering.\n• Develop appropriate terms of reference for appointment of project resources.\n• Implement appropriate procurement practices to ensure appointment of required project resources in line with project timeframes.\n• Reporting in terms of service to client.\n• Accommodate any changes and/or specific related client request as part of programme offering.\n4. Programme Resource Management and alignment\n• Procure required project resources by meeting the requirements of HDA SCM policy.\n• Monitor performance and provide feedback to identified resources on performance.\n• Ensure alignment of external resources to project, regional and internal capacity support on the programme.\n5. Programme Budgeting and Financial Management\n• Develop project/programme budgets in line with agreed feasibilities and available funding.\n• Monitor project expenditure against budget and project deliverables.\n• Address any project budget variance.\n• Provide feedback and input to overall HDA budget.\n6. Develop support tools, products, lessons learnt and Best Practice\n• Identify project design, planning, implementation, management and monitoring best practices that emerge from HDA projects and programmes interventions.\n• Identify and develop possible support tools and product and opportunities.\n• Identify and develop opportunities to enhance and improve any existing support tools and products.\n• Review best practices developed and amend to accurately reflect lesson learnt.\n• Integrate lessons learnt into new project design, planning, implementation, management, and monitoring methodologies.\n7. Project Planning\n• Planning engineering projects to be implemented (bulk infrastructure and internal reticulation).\n• Conceptualise engineering infrastructure projects.\n• Estimate costs and timelines of conceptualised engineering infrastructure projects.\n• Provide engineering infrastructure risks along with mitigation approaches.\n• Prepare engineering layouts.\n• Interpret maps, drawings, geotechnical, drawing and other technical studies reports.\n \nQualifications & Experience\n• Registration with relevant accredited councils within the built environment and/ or project management discipline is required.\n• Civil Engineering Degree or equivalent qualification is required.\n• Project and programme management qualifications added advantage.\n• A minimum of 8 years of experience in the built environment is required.\n• Excellent understanding and at least 5 years’ working experience in a PFMA/MFMA and public entities environment\n• A minimum of 3 years’ experience must be in a large scale and/ or a low-cost housing construction environment or engineering services or infrastructure development (bulk pipelines, water, sanitation, roads &/ or storm water).\n• Demonstrate previous project management capabilities in managing various built environment service providers (PRT and/or consultants and/ or contractors).\n• Valid Driver’s license is required.\n• Computer literacy in AUTOCAD, MS Project, Civil Engineer and/ or Microsoft is required.\n• Willing to travel extensively\n \n \nRemuneration Scale: R 807 700 and R 1 050 000 per annum (all-inclusive package)\n \nClosing date for applications is 10 October 2024\n \nTo submit your application, please send an email HDARecruitRegBNW@thehda.co.za\n \nWhen submitting your application for a position, please adhere to the following:\n1. CVs received after the closing date will NOT be considered.\n2. The Job Title and Reference number for the relevant position must appear in the subject line of your application.\n3. The CV must be in PDF format.\n4. Copies of all qualifications must be provided.\n5. Copy of identity document must be provided.\n6. Two contactable references.\n \nKindly take note if you have not been contacted within twenty-one (21) working days of the closing date; please consider your application unsuccessful. Should you not comply with the above requirements your application will NOT be considered.\n \nConditions of service: The HDA is an equal opportunity employer ● Appointments will be made in accordance with the HDA Employment Equity policy ● The HDA reserves the right not to make an appointment. We thank all applicants for their interest.\nCommunication will be conducted with short-listed applicants only.\nThe HDA operates in accordance with the Protection of Personal Information Act 3 of 2013 (“POPI Act”), and by submitting your personal information to the HDA (by way of application and/or providing any other documentation as may be required during the recruitment process), you agree that the HDA may utilise and process your personal information in accordance with the POPI Act.\n \n \n \n \n \n ",
                "The HDA has the following Fixed term contract position:\n \nPROGRAMME COORDINATOR\nLocation: North West\nReporting Line: Provincial Manager\nRef: HDA PCNW002\nMain Purpose: To ensure that programmes are fully functional through facilitating, coordinating and supporting the Manager: Support Services with the operational functions and administrative logistics, including programme office support.\n \nKey Performance Areas:\n1. Programme office support Management\n• Develop and implement office management systems that facilitate in the smooth operation of the office and support a pleasant working environment\n• Assisting with the logistics of site office set up and maintenance requirements ate these offices\n• Managing office procurement requirements\n• Design and implement business continuity procedures to ensure business stability in the event of a crisis\n• Attend to health and safety requirements within the office environment.\n2. Document Management\n• Facilitate the gathering of relevant information and reports of each programme\n• Oversee storage and maintenance of existing documents within the document management system.\n• Provide training to users e.g. project teams, Project administrator’s on usage of electronic version of the document management system.\n• Monitor and update store information and data.\n• Maintain database of service providers, clients and other key stakeholders.\n3. Reporting\n• Compile regular Technical Status Report.\n• Complete electronic document management system reporting.\n• Develop Office Business dashboard/scorecard.\n• Develop and Complete Learning s (lessons learnt) Report where / when required.\n• Compile Expanded Public Works Report (EPWP) Reports where / when required.\n• Compile Portfolio Management Office (PMO) Reports where / when required.\n• Complete Programme Project Reports, spreadsheet and presentations.\n\n• Generate/Compile reporting files (soft copy and hard copy when required.\n4. Knowledge Management\n• Coordinate and monitor framework for documenting learning’s/lessons learnt. (Quarterly reporting)\n• Monitoring and evaluation of information from various departments within the programmes\n• Provide quality analysis of information from departments to provide relevant reports, proposals and recommendations to Regional Manager/Head: National Programme Design and Management.\n5. General Programme operational support\n• Ensure new staff receive induction and orientation training and all details are loaded on the relevant HR and HDA Systems.\n• Creation and implementation of a system that create accessible information to all users within the various programmes.\n• Provide operational and administrative support to the regional offices when required.\n• Maintaining a diary and meeting schedules management for the Regional Manager / Head: National Programme Design and Management.\n• Liaison and facilitation of relationships with stakeholders including service providers and government officials with Regional Manager / Head: National Programme Design and Management.\n• Sourcing and booking venues and meetings rooms when required.\n• Ensure set-up for critical meetings are in order i.e. tools, documentations, projectors etc.\n• Coordinate all the teams travel, accommodation and conference arrangements.\n• Drafting, receiving approvals and distribution of relevant documentation (agenda’s, minutes, report, presentations etc.)\n• Participate and coordinate the management the management of budget utilization (availing the accurate budget general accounts).\n• Coordination of meetings when required (invitation, agenda, venue, minutes, attendance register etc.\n \nQualifications & Experience\n• Minimum relevant NQF level 6 qualification.\n• Relevant Admin or Business Administration qualification (National Diploma) is required.\n• 5-8 years of experience in similar role is required.\n• Competent in MS Office package, Outlook, Excel, PowerPoint, Project and Word is required.\n• Experience in basic office management will be added as an advantage.\n \n \nRemuneration Scale: R 394 200 and R 492 750 per annum (all-inclusive package)\n \nClosing date for applications is 11 October 2024\n \nTo submit your application, please send an email HDARecruitRegBNW@thehda.co.za\n \nWhen submitting your application for a position, please adhere to the following:\n1. CVs received after the closing date will NOT be considered.\n2. The Job Title and Reference number for the relevant position must appear in the subject line of your application.\n3. The CV must be in PDF format.\n4. Copies of all qualifications must be provided.\n5. Copy of identity document must be provided.\n6. Two contactable references.\n \nKindly take note if you have not been contacted within twenty-one (21) working days of the closing date; please consider your application unsuccessful. Should you not comply with the above requirements your application will NOT be considered.\n \nConditions of service: The HDA is an equal opportunity employer ● Appointments will be made in accordance with the HDA Employment Equity policy ● The HDA reserves the right not to make an appointment. We thank all applicants for their interest.\nCommunication will be conducted with short-listed applicants only.\nThe HDA operates in accordance with the Protection of Personal Information Act 3 of 2013 (“POPI Act”), and by submitting your personal information to the HDA (by way of application and/or providing any other documentation as may be required during the recruitment process), you agree that the HDA may utilise and process your personal information in accordance with the POPI Act.",
                "The HDA has the following Fixed Term Contract position:\n \nASSISTANT TOWN PLANNER\nLocation: North West\nReporting Line: Project Manager Town Planner\nRef: HDA ATPNW002\nMain Purpose: To provide assistance and technical support in terms land acquisition, project planning and packaging for the development of human settlements.\n \nKey Performance Areas:\n1. Land and Property Identification:\n• Implement a set of criteria for appropriate land identification.\n• Collect a variety of statistical data and prepare reports and maps on topics such as census information, land use.\n• Collate and compile land record information in support of land identification for human settlement developments.\n• Identify appropriate land and properties for the HDA.\n• Research opportunities related to land.\n• Identify suitable land for HDA to acquire.\n• Assess land in line with the HDA criteria and strategy.\n• Engage with stakeholders around pre-identified land.\n• Research viability of the land\n• Assess the land in line with the HDA criteria and strategy.\n2. Land Suitability Assessment:\n• Assess land potential in terms of the approved pre-acquisition feasibility model in relation to:\n• Geotechnical assessments\n• Land use assessments.\n• Environmental impact assessments\n• Financial feasibility assessments including valuations.\n• Integrated development and social infrastructure assessments\n• Development potential and assessments\n• Infrastructure capability and capacity assessment\n• Any other relevant assessments\n• Draft layout plans to support land release requests from government departments.\n• Develops planning studies and reports in support of HDA land acquisition programme.\n• Conducts field evaluations and assessment.\n3. Development Planning:\n• Provide support and information for submission of development applications.\n• Manage the land use management processes for the HDA.\n• Evaluates or assists in the evaluation of rezoning, statutory applications, site plans, and other town planning related plans and policies.\n \nQualifications and Experience:\n• A relevant diploma or degree in Town Planning is required.\n• 3 years’ experience in the built environment is required.\n• Knowledge of GIS and AutoCAD or related spatial information systems will be an added advantage.\n• Sound knowledge and understanding of deeds information.\n• Knowledge of human settlements development will be an added advantage\n \nRemuneration Scale: R 453 300 and R 566 616 per annum (all-inclusive package)\n \nClosing date for applications is 11 October 2024\n \nTo submit your application, please send an email HDARecruitRegBNW@thehda.co.za\n \nWhen submitting your application for a position, please adhere to the following:\n1. CVs received after the closing date will NOT be considered.\n2. The Job Title and Reference number for the relevant position must appear in the subject line of your application.\n3. The CV must be in PDF format.\n4. Copies of all qualifications must be provided.\n5. Copy of identity document must be provided.\n6. Two contactable references.\n \nKindly take note if you have not been contacted within twenty-one (21) working days of the closing date; please consider your application unsuccessful. Should you not comply with the above requirements your application will NOT be considered.\n \nConditions of service: The HDA is an equal opportunity employer ● Appointments will be made in accordance with the HDA Employment Equity policy ● The HDA reserves the right not to make an appointment. We thank all applicants for their interest.\n \nCommunication will be conducted with short-listed applicants only.\n \nThe HDA operates in accordance with the Protection of Personal Information Act 3 of 2013 (“POPI Act”), and by submitting your personal information to the HDA (by way of application and/or providing any other documentation as may be required during the recruitment process), you agree that the HDA may utilise and process your personal information in accordance with the POPI Act."
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "pa9ad1a29-ea31-407d-aa90-427e1c54e25e"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/hsrc_orig.gif",
            "href": "https://www.govpage.co.za/human-science-research-council-hsrc-vacancies-blog/human-science-research-council-hsrc-vacancies8118939",
            "title": "HUMAN SCIENCE RESEARCH COUNCIL (HSRC) VACANCIES",
            "content": [
                " \nHUMAN SCIENCE RESEARCH COUNCIL (HSRC)\n ",
                " \n \nEDITORS/WRITERS\nDetails\nClosing Date 2024/10/28\nReference Number HSR241004-1\nJob Type Freelancer\nJob Title Editors/Writers\nBusiness Area Equitable Education and Economics - EEE\nDepartment EEE\nNumber of Positions   10\nWorkplace Type Remote\nLocation - Town / City Cape Town, Pretoria, or Sweetwaters\nLocation – Province Free State, Western Cape, North West, KwaZulu-Natal, Gauteng, Limpopo, Northern Cape, Eastern Cape, Mpumalanga\nLocation – Country South Africa\nMinimum Education Level NQF 9 - Masters Degree or equivalent\nApplication Closing Date 28-Oct-2024\nJob Category Other\n \nJob Advert Summary\nIn delivering ‘social science that makes a difference’, the Research Divisions, Units, Institutes and Centres of the Human Sciences Research Council (HSRC) undertake policy-oriented research from its offices in Pretoria, Cape Town, and Pietermaritzburg. Our public purpose mandate is set out in the Human Sciences Research Council Act of 2008.\n \nThe Equitable Education and Economies (EEE) division undertakes research to transform educational outcomes and increase economic participation. It recognises that education and the economy have long been linked and conducts research to understand educational performance and improve learning outcomes, and to interrogate social, spatial and structural obstacles to economic participation.\n \nEEE has a large and vibrant research programme with over 60 experienced and emerging researchers working on methodological and transformative research. Current research in EEE includes young people and the future of work; undoing spatial divides in access to education and economies; the impact of digitalisation on education and the economy; the innovation needed to ensure wider participation in the economy and allow for greater services and support for food security; the role of the informal sector in generating livelihoods, land, housing and economic development; and the transformation of higher education including a wider role for Technical Vocational Education and Training colleges (TVETs).\n \nThe EEE research division is looking to appoint a panel of freelance Editors/Writers to support our research outputs. This panel will provide high-quality editorial and writing services for a variety of projects, including client reports, newspaper articles, and book chapters.\n \nEditors/Writers\nRef. No: EEE-Editors 10/2024\n \nMinimum Requirements\nCandidates are expected to have extensive writing experience, preferably with exposure to scientific publications and a strong ability to meet tight deadlines.  Additional requirements include:\nA master’s degree in Language, Journalism, Media and Communication or extensive experience in academic writing.\nExperience working in the social sciences and humanities is preferred.\nAt least 5 years relevant professional experience as an editor/writer of high-quality English language publications.\nAt least 3 years of experience in academic editing.\nProficient experience in Microsoft environment including the use of OneDrive and academic software such as RefWorks.\nProven experience in editing for scientific publications would be advantageous.\nDemonstrable writing skills.\nSome experience with relevant software (e.g. Adobe In Design and Photoshop) would be an advantage;\nExperience in development of infographic summaries of research findings would be an added advantage.\nAbility to provide guidance on publications for different audiences.\nHigh personal motivation, self-management, and detail-orientation.\nTemperament to cope with a pressurised, deadline driven work environment\n \nDuties & Responsibilities      \nThe scope of work and expectations of the Editor/Writer will include the following:\nEditorial and writing services will include but is not limited to:\nContent editing: Ensure the final product is professionally written, accurate and coherent.\nLanguage Editing: Assess drafts for linguistic quality, including grammar, syntax, and consistent use of terminology and style; correct errors and provide a certificate attesting to the language edit if required.\nAcademic Editing: Edit theses for Masters and PhD candidates, ensuring clarity and scholarly quality.\nTechnical Editing: Ensure consistency in font, size, and formatting according to specified requirements.\nReport and Publication Formatting: Format reports and publications according to guidelines.\nProofreading: Check for typos, spelling errors, formatting inconsistencies, and ensure citations and figures are accurate.\nSummarizing: Write executive summaries of full-length reports.\nScientific Short Pieces: Write concise articles for public media based on published journal articles.\nRapporteuring: Take detailed notes during workshops and meetings, producing comprehensive or summarized reports.\nInfographic Development: Create infographic materials that visually represent the content of reports and publications.\nRead and understand the requirements of the writing/editing assignment paying special attention to the style and format of the intended user of the output (e.g. client report, journal article, dissertation, book chapter or workshop reports).\nCopy-edit and proofread reports/draft papers submitted to ensure editorial quality standards for publication.\nLiaise with authors to address any editorial amendments;\n \nApplications should include:\nA cover letter of motivation detailing your suitability for the position.\nA detailed CV with contact details of 3 references.\nProof of qualifications.\nTwo examples of scientific, popular and other forms of editing and writing assignments undertaken.\nComplete and submit table below for your rates. These costs will be fixed for the duration of the contract and must include all relevant taxes. \n \nThe HSRC will only consider applications that comply with the above requirements.\n \nPlease register and submit your application on-line at https://hsrc.erecruit.co/\n \nApplication Instructions:\nCandidates can make use of their mobile devices or any browser to register on the Neptune recruitment site, as well as to make application for available vacancies;\nCandidates will be prompted to upload their documents;\nAttachments must be less than 1MB (here is an on-screen option to resize);\nThe Neptune system will only allow you to upload 1 attachment. Please ensure that all documents are merged into 1 file before uploading.\n \nEnquiries about the nature of the position, and NOT applications, may be directed to:\n \nGray van der Bergh – gvdbergh@hsrc.ac.za\n \nFor further information about the HSRC or the post, please consult our website www.hsrc.ac.za. \n \nThe HSRC is committed to accelerating the improvement in the proportion of its staff complement who are SA Citizens, black, female or disabled.\n \nClosing date: 28 October 2024. We encourage applicants to submit applications prior to this date. Applicants who have not been contacted within eight weeks should assume that their application has been unsuccessful. Only applicants who are interviewed will be advised of the outcome of their applications.\n \nThe HSRC reserves the right not to make an appointment.\n \nAPPLICATIONS FROM RECRUITMENT AGENCIES WILL NOT BE ACCEPTED\n \nPolicy\nIn delivering 'social science that makes a difference' in South Africa and the region, the Research Programmes of the Human Sciences Research Council initiate and undertake policy-oriented research projects and programmes from its offices in Cape Town, Durban, Pietermaritzburg and Pretoria. Its public-purpose mandate is set out in the Human Sciences Research Council Act No.17 of 2008.\nThe HSRC aims to attract and retain high-calibre skills and human resources necessary to effectively execute both its mandate to conduct research and to support the strategic intent of the organisation.\nThe HSRC is committed to accelerating the improvement in the proportion of South African Citizens who are black, female, or disabled towards achieving Equity goals.\nThe HSRC reserves the right not to make an appointment.\nApplication from recruitment agencies will not be accepted.\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \nRESEARCH DIRECTOR\n \nDetails\nClosing Date 2024/10/27\nReference Number HSR240911-1\nJob Type Permanent\nJob Title Research Director\nBusiness Area Equitable Education and Economics - EEE\nDepartment EEE\nNumber of Positions 1\nWorkplace Type Hybrid\nLocation - Town / City Cape Town, Sweetwaters or Pretoria.\nLocation – Province KwaZulu-Natal, Western Cape, Gauteng\nLocation – Country South Africa\nMinimum Education Level NQF 10 - PhD Degree or equivalent\nApplication Closing Date 27-Oct-2024\nJob Category Other\n \nJob Advert Summary\nIn delivering ‘social science that makes a difference’, the Research Divisions, Units, Institutes and Centres of the Human Sciences Research Council (HSRC) undertake policy-oriented research from its offices in Pretoria, Cape Town, and Pietermaritzburg. Our public purpose mandate is set out in the Human Sciences Research Council Act of 2008.\n \nThe Equitable Education and Economies (EEE) division undertakes research to transform educational outcomes and increase economic participation. It recognises that education and the economy have long been linked and conducts research to understand educational performance and improve learning outcomes, and to interrogate social, spatial and structural obstacles to economic participation.\n \nEEE is currently looking to appoint a Research Director on a permanent contract to be based in Cape Town, Sweetwaters or Pretoria. The incumbents must have a PhD, and extensive knowledge of, and policy-relevant research experience in Economics or Education.\n \nResearch Director (1 Position)\nRef. No: EEE-Dir 09/24\nPermanent contract from 1 January 2025 or soon after\n \nMinimum Requirements       \nA PhD in Education, Economics, Sociology or in a related social sciences and humanities field;\nAt least ten (10) years of research and management experience, preferably in a research institution or a university;\nExcellent writing skills in drafting briefing papers, reports, and academic publications for wider public dissemination of research findings;\nAt least 20 peer-reviewed publications* (books, books chapters, journal articles), of which several must be international, and several must be first or sole authored;\nRelevant quantitative and or qualitative research experience;\nExtensive experience in securing funding for research;\nGood research project management experience and the ability and enthusiasm to lead research teams in a large multidisciplinary research division;\nIntellectual leadership in a specified area, personal integrity, imagination and drive; and\nSkills in managing, mentoring and training team members.\n \nDuties & Responsibilities\nIdentify key research areas in support of national, African and global South development agendas;\nFormulate targeted research proposals and secure funding on a sustainable basis to enable policy relevant, strategic research projects;\nImplement and manage high quality, large scale, long-term research studies with a focus on social impact;\nDeliver high-quality results and reports to budget and deadline;\nStimulate public debate, civil society engagement, and develop communities of practice to ensure uptake of evidence to transform educational and economic outcomes;\nProduce high quality knowledge outputs through publishing in accredited refereed journals, books, and book chapters and with collaborators on the African continent;\nEnsure research impact through government and stakeholder engagement, policy briefs and research reviews;\nCommunicate research findings across multiple media platforms and at academic conferences and forums; and\nDevelop research skills and competencies through formal and informal training for self and others.\nThe HSRC offers attractive, market-related packages depending on qualifications and experience.\n \nApplications should include:\nA cover letter of motivation indicating your area of expertise (clearly marked), your suitability for the position, your goals, and the position you are applying for. Please do not apply for more than one position. You will be contacted if we think you qualify for a higher or lower ranking position.\nA detailed CV which should clearly indicate your highest qualification; an indication of your quantitative and qualitative research experience; your fieldwork experience (not related to your degree) and details of your citizenship.\nThe details of three recent referees with telephone number, email, and institutional affiliation.\nDetails of three first- or sole-authored publications.\n \nThe HSRC will only consider applications that comply with the above requirements.\nPlease note that applicants may be required to make a presentation pertaining to these positions.\n\nPlease register and submit your application on-line at https://hsrc.erecruit.co/\n \nApplication Instructions:\nCandidates can make use of their mobile devices or any browser to register on the Neptune recruitment site, as well as to make application for available vacancies;\nCandidates will be prompted to upload their documents;\nAttachments must be less than 1MB (here is an on-screen option to resize);\nThe Neptune system will only allow you to upload 1 attachment. Please ensure that all documents are merged into 1 file before uploading.\n \nEnquiries about the nature of the position, and NOT applications, may be directed to:\nDirector positions – Prof Sharlene Swartz at email address sswartz@hsrc.ac.za\n \nFor further information about the HSRC or the post, please consult our website www.hsrc.ac.za. \n \nThe HSRC is committed to accelerating the improvement in the proportion of its staff complement who are SA Citizens, black, female or disabled.\n \nClosing date: Thursday, 27 October 2024 \n \nWe encourage applicants to submit applications prior to this date. Applicants who have not been contacted within eight weeks should assume that their application has been unsuccessful. Only applicants who are interviewed will be advised of the outcome of their applications.\n \nThe HSRC reserves the right not to make an appointment.\n \nAPPLICATIONS FROM RECRUITMENT AGENCIES WILL NOT BE ACCEPTED\n \nPolicy\nIn delivering 'social science that makes a difference' in South Africa and the region, the Research Programmes of the Human Sciences Research Council initiate and undertake policy-oriented research projects and programmes from its offices in Cape Town, Durban, Pietermaritzburg and Pretoria. Its public-purpose mandate is set out in the Human Sciences Research Council Act No.17 of 2008.\nThe HSRC aims to attract and retain high-calibre skills and human resources necessary to effectively execute both its mandate to conduct research and to support the strategic intent of the organisation.\nThe HSRC is committed to accelerating the improvement in the proportion of South African Citizens who are black, female, or disabled towards achieving Equity goals.\nThe HSRC reserves the right not to make an appointment.\nApplication from recruitment agencies will not be accepted.\n \n \n \n \n \n ",
                "PHD RESEARCH TRAINEE\n \nDetails\nClosing Date 2024/10/18\nReference Number HSR241004-2\nJob Type Fixed Term contract- long term\nJob Title PhD Research Trainee\nBusiness Area Public Health, Societies and Belonging - PHSB\nDepartment PHSB\nNumber of Positions 1\nWorkplace Type Hybrid\nLocation - Town / City Pietermaritzburg\nLocation – Province KwaZulu-Natal\nLocation – Country South Africa\nMinimum Education Level NQF 9 - Masters Degree or equivalent\nApplication Closing Date 18-Oct-2024\nJob Category Education\n \nJob Advert Summary\nThe Public Health, Societies and Belonging research programme within the HSRC employs a multi-disciplinary group of social scientists and public health specialists who conduct numerous empirical and policy-related studies each year, three-quarters of which are donor-funded.  The Public Health, Societies and Belonging division conducts transdisciplinary, intersectional, policy and programme-relevant research to improve health, well-being and promote a socially just and cohesive society.\nPHSB has offices in Pretoria, Cape Town and, Pietermaritzburg. The division seeks to appoint a PhD intern to join a dynamic team of researchers and administrators in the HSRC community. The incumbent will be based in Pietermaritzburg.\n \nPhD RESEARCH INTERN\nLocation: Pietermaritzburg\nRef: HSC PhD Intern 10/2024\n \nOne PhD Research Internship is currently available. The PhD Research Intern Programme in the HSRC provides the successful candidate with an opportunity to further develop their research expertise by working with subject experts and project specialists. The research internship experience is intensive and seeks mature individuals who are able to work independently as well as part of a team. While appointees will be exposed to a wide variety of project-related research, they will be expected to complete their thesis within three years. Time is set aside for this purpose.\n \nMinimum Requirements\nApplicants must be in possession of a Master’s degree in the Social Sciences or Public Health and be registered for the appropriate higher degree either with a recognised South African or equivalent.\nA sound grounding in research methods and previous experience in research and data analysis will be a strong recommendation\nRequisite computer skills (e.g. Microsoft Office, SPSS, STATA, ATLAS-ti or similar programme)\nAbility to work well under pressure and to meet deadlines.\n \nDuties & Responsibilities\nIn addition to being registered for a PhD degree at a recognised South African university and currently working on their degrees, or eligible for registration at a recognised South African university, research interns are required to participate in all aspects of the research process as they work with other staff on different research projects.\n \nAmong other duties, they will participate in the following activities under supervision:\nSupport the research and research-related work of the HSC Programme\nAssist with the conceptualisation and execution of research projects\nAssist with the formulation of research questions and writing proposals\nAssist with the submission of research proposals for ethical review\nCollection and analysis of data\nWriting up of research results, research reports and manuscripts for publication\nPresenting at conferences\nManagement or supervision of research projects\n \n \nPolicy\nIn delivering 'social science that makes a difference' in South Africa and the region, the Research Programmes of the Human Sciences Research Council initiate and undertake policy-oriented research projects and programmes from its offices in Cape Town, Durban, Pietermaritzburg and Pretoria. Its public-purpose mandate is set out in the Human Sciences Research Council Act No.17 of 2008.\nThe HSRC aims to attract and retain high-calibre skills and human resources necessary to effectively execute both its mandate to conduct research and to support the strategic intent of the organisation.\nThe HSRC is committed to accelerating the improvement in the proportion of South African Citizens who are black, female, or disabled towards achieving Equity goals.\nThe HSRC reserves the right not to make an appointment.\nApplication from recruitment agencies will not be accepted.\n \nPLEASE APPLY HERE",
                "PROJECT ADMINISTRATOR\n \nDetails\nProject Administrator (HSR241003-1)\nClosing Date 2024/10/18\nReference Number HSR241003-1\nJob Type Fixed Term contract - short term\nJob Title Project Administrator\nBusiness Area Equitable Education and Economics - EEE\nDepartment EEE\nNumber of Positions 1\nWorkplace Type On-site\nLocation - Town / City Cape Town\nLocation – Province Western Cape\nLocation – Country South Africa\nMinimum Education Level NQF 5 - Diploma or equivalent\nApplication Closing Date 18-Oct-2024\nJob Category Other\n \nJob Advert Summary\nIn delivering ‘social science that makes a difference’, the Research Divisions, Units, Institutes and Centres of the Human Sciences Research Council (HSRC) undertake policy-oriented research from its offices in Pretoria, Cape Town, and Pietermaritzburg. Our public purpose mandate is set out in the Human Sciences Research Council Act of 2008.\n \nThe Equitable Education and Economies (EEE) division undertakes research to transform educational outcomes and increase economic participation. It recognises that education and the economy have long been linked and conducts research to understand educational performance and improve learning outcomes, and to interrogate social, spatial and structural obstacles to economic participation.\n \nEEE is looking to appoint a dynamic, detail-oriented, self-starter to join the team as a Project Administrator for 6 months with the possibility of extension based on the availability of project budget. This position is based in Cape Town.\n \nProject Administrator\nRef. No: EEE/Admin. 10/2024\n \nMinimum Requirements\nRelevant post-matric qualification with a minimum 5 years relevant experience.\nExperience in project administration and familiarity with the PFMA will be an advantage.\nAdvanced computer proficiency, specifically in the MS Office suite and Outlook.\nExceptional administrative skills with strong problem-solving abilities.\nStrong written and verbal communication in English.\nDemonstrated drive, initiative, flexibility, and ability to handle pressure.\nStrong interpersonal skills to work effectively with diverse stakeholders.\nWillingness to work after hours and travel when necessary.\n \nDuties & Responsibilities\nThe incumbent will provide a range of project and office administration duties to support all relevant stakeholders. \n \nThese include but are not limited to:\n \nProject administration:\nContribute to preparing formal documents, including memorandums, proposals, and other essential materials.\nOversee the procurement of goods and services.\nCoordinate logistics for meetings, workshops, and conferences, including travel arrangements.\nCoordinate and participate in project meetings.\nMaintain a systematic and secure digital filing system.\nPromptly address and resolve administrative queries and complaints.\nFinancial administration:\nFacilitate the processing and documentation of financial claims, creditor payments, and salaries.\nWork with the finance manager to develop budgets, track project spending, identify any issues, and make the relevant corrections as needed.\nGeneral Office administration:\nMonitor and co-coordinate the distribution of assets.\nAssist with on/off boarding of staff.\nCoordinate general office related meetings.\nCoordinate all stationery and refreshments in the office.\nThe HSRC offers attractive, market-related salaries, depending on qualifications, experience and recent performance.\n \nAPPLICATIONS:\nA cover letter of motivation indicating your suitability for the position;\nA detailed CV and an indication of your residency status;\nA certified ID copy, as well as copies of all completed qualifications.\nThe details of three recent referees with telephone/cell number, e-mail, contact details and institutional affiliation.\n \nPlease register and submit your application on-line at https://hsrc.erecruit.co/\n \nApplication Instructions:\nCandidates can make use of their mobile devices or any browser to register on the Neptune recruitment site, as well as to make applications for available vacancies;\nCandidates will be prompted to upload their documents;\nAttachments must be less than 1MB (here is an on-screen option to resize);\nThe Neptune system will only allow you to upload 1 attachment. Please ensure that all documents are merged into 1 file before uploading. \n \nShortlisted applicants may be required to undertake a written or oral competency exercise for this position.\n \nEnquiries (NOT Applications or CVs) may be directed to Mr Gray van der Bergh email:GvdBergh@hsrc.ac.za\n \nClosing date: 18 October 2024. \n \nWe encourage applicants to submit prior to the closing date. If you do not receive any response from us within eight weeks, please accept that your application was unsuccessful. Only candidates who are interviewed will be advised of the outcome of their application.\n \nThe HSRC is committed to accelerating the improvement in the proportion of its staff complement who are SA Citizens, black, female or disabled\n \nThe HSRC reserves the right not to make an appointment.\nAPPLICATIONS FROM RECRUITMENT AGENCIES WILL NOT BE ACCEPTED.\n \nPolicy\nIn delivering 'social science that makes a difference' in South Africa and the region, the Research Programmes of the Human Sciences Research Council initiate and undertake policy-oriented research projects and programmes from its offices in Cape Town, Durban, Pietermaritzburg and Pretoria. Its public-purpose mandate is set out in the Human Sciences Research Council Act No.17 of 2008.\nThe HSRC aims to attract and retain high-calibre skills and human resources necessary to effectively execute both its mandate to conduct research and to support the strategic intent of the organisation.\nThe HSRC is committed to accelerating the improvement in the proportion of South African Citizens who are black, female, or disabled towards achieving Equity goals.\nThe HSRC reserves the right not to make an appointment.\nApplication from recruitment agencies will not be accepted.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "pcb93b634-9aa5-41ed-9c71-a503d7c7e59b"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/idc-logo_orig.jpg",
            "href": "https://www.govpage.co.za/industrial-development-corporation-idc-vacancies-blog/industrial-development-corporation-idc-vacancies8552547",
            "title": "INDUSTRIAL DEVELOPMENT CORPORATION (IDC) VACANCIES",
            "content": [
                " \nINDUSTRIAL DEVELOPMENT CORPORATION (IDC)\n ",
                " \n \nMANAGEMENT ACCOUNTANT SFP (12 MONTHS FTC)\nJob number IDC00384\nJob Grade P-Band\nClosing date 14-Oct-2024\n \nJob Description\n• To perform financial planning for the IDC\n• Co-ordinate and facilitate budget process for the business and consolidate for IDC\n• To provide training and professional advice to relevant stakeholders within the IDC\n• Ensure compliance to statutory requirements (PFMA)\n \nQualification and Experience\n \nQualifications: \n• Relevant BCom Degree (with a finance related major) \n• MBA / MBL / Post-graduate degree advantageous \n• Proficiency in SAP \n• Proficiency in Microsoft Word, Excel, PowerPoint \n• Proficiency in Power BI or other data analysis tool would be an added advantage\n•Registration with relevant regulatory bodies e.g. CA (SA), CIMA, SAIPA (Would be desirable) \nExperience  \n•Budget and Forecasting (5-8 years’ experience) \n• Cost Accounting and Cost Control (5-8 years’ experience) \n• Financial Analytical skills \n• Financial Planning Implementation and Enhancement \n• PFMA reporting \n• Knowledge of SAP Business Intelligence (BI) and Business Warehouse (BW) \n• Loading Budget on SAP\n \nRoles and Responsibilities\n \nStrategic Alignment\n• Ensure that operational expenditure budget is alignment to the business strategy\n• Provide support and professional advice to the cost center owners, functional areas, HODs and executive management\n• Ensure timeous reporting of IDC Group Irregular and Fruitless and Wasteful Expenditure to relevant governance structures\nFunctional Operations Management\n• Preparation of operating expenditure budgets\n• Ensure that correct data is uploaded on SAP\n• Monthly monitoring of performance against budgets and conduct relevant cost analysis\n• Provide expert and professional advisory service to cost center owners\n• Prepare, review, and interpret performance reports to determine projections for the year end\n• Ensure accounting activities comply with relevant legal, professional, and ethical standards\n• Prepare monthly performance presentations for submission to relevant governance structures\n• Maintain and update systems and procedures and maintain a sound control environment\n• Prepare and consolidate Irregular, Fruitless and Wasteful Expenditure (IFWE) report for the Group\n• Prepare IFWE presentation for submission to relevant governance structures\n• Ensure compliance of the PFMA submissions (timeous and accurate)\n• Create and maintain cost and profit master data on SAP\n• Implement and maintain cost allocation methodologies\n• Attend to other ad-hoc requests\n \nLEARNING AND GROWTH\n• Innovative and continuous improvement on new ways of doing the work\n• To take ownership of Personal Development\n• To promote/participate in knowledge sharing with team members\n• Provide training to trainee CA’s\n• Active learning\nStakeholder Management\n•Provide support and professional advice to the cost center owners, functional areas, HODs and executive management\nReporting\n• Monthly and quarterly reporting of operational expenditure to relevant stakeholders and governance structures\n• Annual Budget reporting to relevant stakeholders and governance structures\n• Manage and co-ordinate the consolidation of IFWE reporting for the Group\n• Ensuring compliance with statutory requirements\n \nAPPLY NOW\n \n \n \n \n ",
                " \n \n \n \n \n \nCREDIT ORIGINATION ANALYST\nJob number IDC00383\nJob Grade P-Band\nClosing date 13-Oct-2024\n \nJob Description\nResponsible for the oversight on the origination of deals and management of Credit and investment risk at the onboarding stage.\n \nQualification and Experience\n \nQualifications:\nB Com degree or an equivalent qualification\nKnowledge and Experience:\n5 to 8 year’s relevant experience in a financial institution.\nUnderstanding and knowledge of credit risk management or deal origination with strong emphasis on risk identification, assessment and mitigation.\nKnowledge and Understanding of credit risk and any associated risks prevalent in the financing of transactions/projects.\nPortfolio management experience will be an advantage\n \nRoles and Responsibilities\nProviding the necessary support required by Senior Origination Managers and Credit Evaluation Managers in the Deal Development process.\nConduct research and credit analysis on deals that are at basic assessment stage.\nEnsuring that potential deals at basic assessment are in line with mandate, Risk appetite framework and Credit policies.\nPerformance and provision of indicative risk grading and pricing.\nConducting credit checks and other necessary checks required at origination stage.\nAssist with the clearing of drawdown conditions.\nCommunicate the Organisation’s Risk Appetite to front line and encourage adherence and conduct within the stipulated appetite levels.\nAssist with the review and continuous enhancement of Credit submission templates.\nChallenge existing methodologies and develop innovative ways to enhance the credit risk origination systems and procedures and the Credit submission templates.\nBeing the voice of risk at SBU internal meetings and cultivate a holistic risk-aware culture within operation divisions.\nWork alongside Senior Origination Managers to inculcate production of succinct and high-quality reports that assist in efficient decision making\nCollaboration with Evaluation Managers to ensure alignment on risk appetite and terms of credit.\nAssist with the development of differentiated, superior solutions (solution engineering) that meet stakeholder and business requirements\n \nJob Requirements\n \nTECHNICAL/FUNCTIONAL COMPETENCIES\nProblem Solving\nReport writing Skills\nStrong attention to detail and data validity\nStrong Analytical Skills\nPlanning and Organizing\n \nBEHAVIOURAL COMPETENCIES\nGood Communication Skills\nSelf-motivated and self-driven skills\nInterpersonal Skills\nSIGNATURES\n \nAPPLY NOW\n \n \n \n \n ",
                " \n \n \n \n \nSENIOR SPECIALIST- BUSINESS RESCUE\nJob number IDC00387\nJob Grade M Band (Heads and Champions)\nClosing date 12-Oct-2024\n \nJob Description\nTo provide advice to clients depicting early warning signs of distress, assist in curbing further distress; and where distress is encountered, influence and monitor implementation of solutions for distressed clients that are either going through Business Rescue or require Business Rescue intervention in order to prevent further deterioration.\n \nQualification and Experience\n \nQualifications:\nMinimum requirements:\nCommercial qualifications e.g. BCom with post graduate degree\nMBA / MBL would be an advantage\nKnowledge and Experience:\nAt least 8-10 years’ experience in a Turnaround and Restructuring environment - businesses experiencing distress.\n Experience in Business Rescue advisory\n Knowledge of business and the diversity of risks that may affect businesses.\nGood understanding of different types of security.\n Good working knowledge of Chapter 6 in the Company’s Act, Contract, Taxation, IFRS and Insolvency legislation.\nGood knowledge of Industry standards, technology trends and best practices\n \nRoles and Responsibilities\nProvide advice and support to Sector Business Units (SBUs) and Post Investment Segments in respect of clients who are showing early signs of operational and/or financial stress.\nAssist in recommending the suitable Business Rescue Practitioner\nAttend all meetings to do with the specific Business Rescue process\nPlan and execute the Business Rescue process of IDC clients experiencing distress through:\no Carry out Business Reviews to 1) diagnose cause of distress and 2) ascertain reasonable prospect of client becoming operationally and financially viable;\no Determine the optimum Rescue solutions that will improve the company’s viability,\no Determine the optimum Financial/non-financial Restructuring intervention that can be implemented to support the Rescue strategy\no Influence the Business Rescue process for the benefit of the IDC;\no Evaluate Business Rescue plan presented by the Business Rescue Practitioner and recommend changes;\nSafeguard IDC’s Security position through maintaining and/or improving the recoverability of IDC’s exposure,\nDraft and present submission reports to various decision making committees,\nReview drafted legal agreements to ensure they capture the IDC credit committee approval\nClosely monitor the implementation of the Business Rescue strategy through attending Creditors meetings; Interaction with key stakeholders; regular client visits; etc.\nRegularly update the Business Advisory & Turnaround monitoring platform (SAP) iro tracking progress against process and status update notes;\nAttend and contribute to the monthly Business Advisory & Turnaround Portfolio Management meeting\nPrepare and present regular monitoring submissions to Portfolio Monitoring Committee\nProvide efficient service to both internal and external stakeholders/clients\n \nJob Requirements\nTECHNICAL COMPETENCIES\nBusiness Turnaround & Rescue\nFinancial modelling\nAnalytical/Diagnostic Skills\nBusiness/Commercial Acumen\nProblem Solving/Solution Generation\nClient Insights & Focus\nFormulating strategies and concepts\nReport writing Skills\nProject Management Skills\nStakeholder Management\n \nBEHAVIOURAL COMPETENCIES\nCommunication & Presentation skills\nCreating & Innovating\nCoping with pressure & set backs\nPlanning & Organising\nNegotiating & Influencing\nNetworking Skills\nResults Driven\nCoaching & Mentoring\nDeciding & Initiating\n \nAPPLY NOW\n \n \n \n \n \n ",
                "HUMAN CAPITAL CONSULTANT (3 YEAR FTC)\nJob number IDC00380\nJob Grade P-Band\nClosing date 10-Oct-2024\n \nJob Description\nThe purpose of the Human Capital Consultant role is talent acquisition and retention, geared to attract, recruit, develop, and retain skilled individuals who can contribute to the success and growth of ISA. This role involves strategically identifying and acquiring talent that aligns with the company's goals and values, as well as nurturing and developing employees to maximize their potential and drive Infrastructure South Africa (ISA) success.\n \nQualification and Experience\n \nQualification\n• A 3-year Degree (NQF Level 7) or Diploma in HR Management or related discipline.\nKnowledge & Skills\n• 5 - 8 years of experience in talent acquisition, recruitment, or human capital with a focus on talent acquisition and retention.\n• Additional Advantage: 3 years’ experience working at a management level.\nJob Related Knowledge (knowledge of systems, processes, regulations or law)\n•Recruitment techniques.\n•Diversity & inclusion.\n•Relevant legislation.\n•Continuous learning & adaptability.\n•Communication & relationship building.\n•Training development.\n•Staff retention.\n \nRoles and Responsibilities\n•Develop and execute innovative recruitment strategies to attract top-tier candidates across various channels, including job boards, social media, professional networks, and referrals.\n•Conduct thorough candidate screenings, interviews, and assessments to evaluate qualifications, skills, suitability and cultural fit to the organization.\n•Build and maintain a strong talent pipeline for current and future human capital needs.\n•Collaborate with hiring managers to understand staffing needs and provide guidance on best practices for attracting and selecting candidates.\n•Coordinate and facilitate the onboarding process for new hires, ensuring a smooth transition into the organization.\n•Coordinate offboarding of existing employees and lessons learnt feedback for more improved services.\n•Implement talent retention initiatives, including performance management, career development, succession planning, and employee engagement programs.\n•Analyse recruitment metrics and trends to continuously improve the effectiveness of talent acquisition and retention processes.\n•Stay up to date on industry trends, best practices, and legal requirements related to talent acquisition and retention.\n \nJob Requirements\n \nJob-Related Skills\n•Ability to build and manage relationships.\n•Good written and verbal communication skills.\n•Excellent scheduling and time management skills.\n•Good attention to detail.\n•Good interpersonal skills.\n•Ability to liaise and engage with both internal and external clients.\n•Excellent customer relationship skills.\n•Respect for confidentiality due to nature of work.\n•Ability to follow through with initiatives and effective prioritisation.\n\n•Ability to multitask and thrive under work pressure.\n•MS Office: Excel, Word, PowerPoint, Outlook, MS Teams.\n•Project management skills.\n•Presentation skills.\n•Agility.\n•Solutions orientation.\n\nAPPLY NOW",
                "CONSOLIDATION IFRS SPECIALIST\nJob number IDC00385\nJob Grade P-Band\nClosing date 10-Oct-2024\n \nJob Description\nThe purpose of the role is to act as a subject matter expert for the consolidation, period close reporting and intercompany accounting functions for IDC company and group in compliance with IFRS, regulatory requirements and IDC policies.\n\nThe Consolidation IFRS Specialist is responsible for activities related to period end, consolidation, and intercompany accounting. The specialist needs to ensure standardisation of consolidation reporting processes, policies, procedures across the group; timely and accurate preparation of consolidated monthly, quarterly, and annual financial results; and implementation and maintenance of appropriate consolidation financial reporting systems.\n \nQualification and Experience\n \nQualifications \nBachelor’s degree in finance /accounting or equivalent CA(SA) – Mandatory\n \nExperience:\n•5-8 Years’ experience in finance or finance operations related roles.\n•3-5 Years’ experience in performing Group Consolidations function of a large company.\n•Experience in a managerial position (preferable).\n•Experience in accounting for complex consolidations in a multinational environment.\n•Industry experience from financial services/Lending/Banking would be advantageous.\n•Good understanding of the functioning of the SAP system and consolidation systems.\n•Strong IFRS 10 and IAS 28 experience required.\n•Understanding of financial analysis and the ability to prepare management reports.\n•Sound financial Excel Modelling Skills, Microsoft Office inclusive of Word and PowerPoint\n•Proficient in Microsoft Excel and Word.\n \nRoles and Responsibilities\n•Review and guide the group financial reporting processes.\n•Design and implement group wide reporting controls and templates required for the execution of financial consolidation.\n•Preparation of the group consolidation in compliance with the group reporting policies, procedures, and templates.\n•Continuously provide input into the improvement of the group reporting policies, procedures, templates and the efficiency of the consolidation preparation processes.\n• Perform the group consolidation for monthly, quarterly, and annual financial performance.\n• Process the relevant approved year-end adjustments key to the consolidation performance.\n• Manage the overall process for the preparation and consolidation of monthly, quarterly, and annual financial results.\n• In liaison with Client Support and Growth (CSG), identify and maintain a record of investments that meet the requirements of consolidation.\n• Implement controls to ensure that the list of investments to be consolidated is complete at any point in time on the consolidation platform.\n• Monthly review and reconciliation of ZPR (SAP client depository) to ensure alignment of the investments list across the various business areas, i.e., completeness and accuracy to the trial balance.\n• In liaison with Technical Finance, ensure the accuracy of the classification and measurement of the investments.\n• Responsibility for the development and update of intercompany policies and procedures.\n• Define and identify the nature of intercompany transactions and account types specific to the IDC reporting environment for intercompany transaction elimination purposes.\n• Ensure the group consolidation process is in compliance with IFRS requirements.\n• Keep abreast of latest developments in IFRS and integrate these into group accounting policies and procedures.\n• Prepare monthly, quarterly, and annual internal consolidation financial reports to key IDC committees.\n• Participate, provide input and support in the audit preparation process and during the performance of the external audit.\n• Support the financial reporting team with the preparation of any internal financial reports, as applicable.\n• Contribute to the preparation of external financial reports to external stakeholders.\n• Assist with ad-hoc Financial Management department initiatives and projects.\n•Create and maintain a good relationship with internal and external stakeholders.\n•Provide coaching and training to the financial reporting team as and when necessary.\n•Support and drive Innovation of the IDC group consolidation process.\n•Participation in key meetings as per nomination.\n \nJob Requirements\nFUNCTIONAL KNOWLEDGE\nFinancial Consolidation\nConsolidation systems\nFinancial accounting\nPeriod end & Closing\nIFRS (International Financial Reporting Standards)\nJSE Listing Requirements\nCorporate Governance – King IV\n \nBEHAVIOURAL COMPETENCIES\nDeadline driven and attention to detail\nGood Communication Skills and a hands-on approach\nGood Interpersonal Skills\nCoping with Pressures and tight deadlines\nConflict resolution skills\nNegotiating and influencing\nPresentation Skills\nDecision Making Skills\n \nAPPLY NOW"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p86e25d1b-6810-4831-be15-7106fad6fa29"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/legal-aid_orig.jpg",
            "href": "https://www.govpage.co.za/legal-aid-vacancies-blog/legal-aid-vacancies7275915",
            "title": "LEGAL AID VACANCIES",
            "content": [
                " \nLEGAL AID\n ",
                "ADMINISTRATION MANAGER\nREF: QON/AM/04/10/2024\nINTERNAL AND EXTERNAL RE-ADVERTISEMENT                                                  \nQONCE LOCAL OFFICE \nNB: Applicants who applied previously are encouraged to re-apply\nLegal Aid SA is a National Public Entity; a key contributor to South Africa’s constitutional democracy, providing quality legal services to indigent and vulnerable persons. The organisation has a national footprint in all nine (9) provinces. Legal Aid SA is a credible employer of choice, boasting Top Employer SA accreditation for 15 consecutive years. We offer an exciting Employee Value Proposition with opportunities for development, career growth and an inspiring workplace.\nApplications are invited from persons interested to fill the above-mentioned position. The incumbent will be appointed on a permanent basis. \nThe position is based in Qonce.\n \n \nKEY OUTPUTS\nManage the local office processes in respect of finance, human resources, communications and legal administration within a matrix environment.\nManage administrative functions from a compliance and operational effectiveness approach.\nManagement of the local office Manual and Standard Operating Procedures (SOPs) for the local office and advise on application.\nEnsure the implementation of new/revised Policies and Procedures and monitor adherence thereof.\nTogether with the management team, identify risks facing the office and ensure effective mitigation against such risks.\nManagement oversight of Business Intelligence (BI) reports to accurately reflect the status of strategy implementation.\nManagement and monitoring of local office contracts to ensure compliance and value for money.\nManagement and monitoring of the correct use of petty cash.\nManagement of infrastructure and fixed assets.\nManage procurement and payments (sourcing quotes from suppliers, processing of invoices, orders, et cetera).\nManagement of over and under expenditure to ensure budgetary control.\nEfficient vehicle and fleet management.\nManage a diverse team to ensure efficiencies and accountability.\n \nCOMPETENCIES (SKILLS, KNOWLEDGE & ATTRIBUTES) REQUIRED                    \nNational Senior/Matric certificate, plus three (3) year Financial Management/Accounting tertiary qualification (NQF 6/National Diploma).\nA Supply Chain Management qualification will be advantageous.\nA valid driver’s licence.\nFive (5) years of administrative experience.\nTwo (2) years of relevant management experience.\nSupply Chain Management experience.\nUnderstanding and application of basic computer software packages.\nAbility to develop and implement operational plans.\nLeadership and problem-solving skills.\nResource and risk management.\nBusiness writing and project management skills.\nAbility to compile and interpret reports and statistics.\nKnowledge of the core administration, human resources, communication and financial disciplines and how to implement and leverage these within a matrix business environment, for example: working knowledge of the Constitution, Public Finance Management Act (PFMA), National Treasury Regulations, Legal Aid SA Act and other relevant Statutes.\nWorking knowledge of all employment-related Acts and functional ability in utilisation of electronic systems and technologies.",
                "BASIC SALARY: Level 10 (R552,081.00) per annum plus benefits\n\n \nA detailed curriculum vitae reflecting practical application of the position outputs and the required competencies as advertised must be submitted by close of business on 22 October 2024, quoting the reference number QON/AM/04/10/2024  in the subject line to ECRecruit [at] legal-aid.co.za or apply online at www.legal-aid.co.za \n \nEnquiries to Thenjiwe Magazi, Tel: 041 395 9916\n \nThe employment decision shall be informed by the Employment Equity Plan of Legal Aid SA. It is Legal Aid SA’s intention to promote equity (race, gender and disability) through the filling of this post(s) with a candidate whose transfer/promotion/appointment will promote representivity in line with the numerical targets as contained in our Employment Equity Plan. Legal Aid SA reserves the right to withdraw posts or not to make an appointment, if by doing so, the interests of Legal Aid SA will be best served.\n \nAPPLICANTS NOT CONTACTED WITHIN TWO (2) MONTHS MAY CONSIDER THEIR APPLICATION UNSUCCESSFUL."
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p26a104c2-db4f-461c-81d9-b6fa7bcad015"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/mintek_orig.jpg",
            "href": "https://www.govpage.co.za/mintek-vacancies-blog/mintek-vacancies1115078",
            "title": "MINTEK VACANCIES",
            "content": [
                " \nMINTEK\n ",
                "ARTISAN – PLANT BUILDING AND MAINTENANCE\nListing reference: minte_000283\nListing status: Online\nApply by: 18 October 2024\nPosition summary\nIndustry: Mining & Quarrying\nJob category: Artisan\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: No\n \nIntroduction\nMintek has an exciting career opportunity for an Artisan: Comminution position within the Mineral Processing Division (MPD). The candidate is required to perform tasks related to executing plant building and equipment maintenance activities within MPD. This includes being responsible for building and maintenance of pilot plants, laboratory equipment and MPD assets in accordance with specified designs, engineering drawings, plant layouts, flow sheets, and standard operating procedures (SOPs).\n \nJob description\n \nKey Performance Indicators:\nPlan and execute planned maintenance schedule on various MPD plants and equipment, making sure to effectively interpret conditions of plants and equipment and determine causes thereof as well as check and ensure quality of maintenance work in MPD equipment.\nMaintain a sign-in and sign-out for MPD equipment.\nAssist with Works Orders and do follow ups.\nCompile reports on the status of inspected equipment and submit the report with recommendations to the Head of the group.\nEnsure registration of assets in equipment register and monitor assets movements.\nHelp to record and track the movement of assets.\nLook after the MPD assets (Asset numbers & Bar codes) and help identify broken or non-repairable.\nIdentify resources required to execute required maintenance.\nPlan execution of recommended maintenance activities.\nExecute planned maintenance as per plan.\nReport back to ead on completed work.\nPreventative Maintenance\nExecute planned maintenance inspections on various mechanical plants and equipment, making use of mechanical theories to effectively interpret conditions of plant and equipment and determine causes thereof.\nCompile reports on the status of inspected equipment.\nSubmit report with recommendations to Supervisor.\nIdentify resources required to execute required maintenance.\nPlan execution of recommended maintenance activities.\nExecute planned maintenance as per plan.\nReport back to Supervisor on completed work.\nReactive Maintenance\nRespond to breakdown of equipment and plant.\nAssess the extent and cause of failure.\nIdentify the best remedial action to be taken, taking into account the impact of downtime and cost of repair.\nInform Supervisor of the failure/breakdown and request required spares.\n Execute repairs to failed equipment or plant and commission. Ensure high quality of workmanship to prevent recurrence of failure.\nProjects\nInterpret drawings (PFD’s, P&ID’s and Structural) to assemble plant and equipment as requested by Cis.\nDesign manufacture and install water, air, gas and steam reticulation according to relevant quality and safety standards.\nMeeting requirements of CI for pilot plant building.\nCommission pilot plants.\nMeeting deadlines for projects and reliability.\nEnsure when decommissioning of a pilot plant is complete, all equipment is returned to its original state.\n \nAdditional \nPerform risk assessment before carrying out work.\nSupervise subordinates and ensure they work safely.\nEnsure high quality of work in all maintenance activities.\nMinimise wastage of materials and spares when maintaining equipment or making new fixtures or structures.\nPerform standby duties, responding to calls after hours regarding failed equipment, plant and services\nMentor trainees.\nEnsure all SHEQ requirements are adhered to and met.\n\nMinimum requirements\nTrade Certificate\nAt least 5 years' experience in the operation and maintenance of relevant minerals processing related unit operations such as flotation, milling, crushing, physical separation and sample preparation.\nAt least 5 years on the job training.\n \nAPPLY",
                "INSTRUMENTATION TECHNICIAN\nListing reference: minte_000287\nListing status: Online\nApply by: 18 October 2024\nPosition summary\nIndustry: Scientific, Research & Development\nJob category: Maintenance\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nMintek has an exciting career opportunity for an Instrumentation Technician. The successful candidate will be responsible for designing, installing, commissioning and maintaining instrument and control systems without supervision. All suitably qualified and experienced candidates are invited to apply.\n \nJob description\nProjects (Without supervision)\nWith the help of engineering theory and process flow knowledge, the Technician is:\n·       Responsible for the planning and alignment of designs into business strategies and objectives, and with industry best practices, ensuring effective cost management, adherence to safety regulations and effective client service.\n·       Prepare scope of work, specifications, bill of quantities and tender documents according to client needs & specifications, and continuous liaising with the client thereon.\n·       Responsible for continuous improvements in designs ensuring optimal and cost efficient implementation.\n·       Responsible to coordinate and implement design initiatives upon completion of project scoping, tendering and contract preparation with the client.\n·       Responsible to compile all information necessary for the manufacturing and software engineering phases of the project (detailed data pack).\n·       Project costing.\n·       Participate in tender drafting and evaluation meetings.\n·       Project bidding participation.\n·       Budget control measures for projects.\n·       Contract negotiation skills.\n \nMaintenance (Corrective, Preventative and breakdown)(Without supervision)\n\n·       You will be responsible for PLC wiring, PLC programming, PLC input and output tagging, SCADA development and fault finding.\n·       Performing calibration and installation of various instruments:\n Temperature instruments\n Flow instruments\n Level instruments\n Radiation instruments\n·       Perform corrective maintenance on instruments and repair any irregularities on allocated machines.\n·       Perform preventative maintenance and repair on process controllers (PLCs, microcontrollers, DCSs, etc.) and instruments\n Maintenance as recommended by manufacturer\n Calibrating the instruments to make sure they work properly\n Software maintenance for all process controllers\n·       Perform all kinds of maintenance work and report back to the supervisor on completion\n·       Reassemble instruments and replace instruments in system, using hand tools\n·       Assist junior technicians and instrument mechanics in technical problem solving\nApplying engineering theory in problem solving\nApplying process flow knowledge in troubleshooting\nTake over problem solving from junior personnel\n·       Budget control measures for project and maintenance activities\n Working within stipulated budget\n Allocating resources to tasks cost effectively\n Determining the budget required for projects and maintenance tasks\nCost control during task execution\n·       Tests the accuracy of various instruments used to meet business objectives such as:\nflow meters\n pressure gauges\n temperature indicators\ncontrollers\nradiation counters or detectors\nother recording, indicating or controlling instruments to locate defective components in system\n \nTraining and Others (Without supervision)\nMentoring junior technicians\nMentoring Instrument mechanics\nActing in the position of the supervisor on request\nPotential hazard identification and risk assessments before commencing work at hand\nEnforce ISO 9001,14001,17025 and 18001 among subordinates\nQuality and environmental issues report back to the supervisor\n Performing breakdown work on call Reporting back breakdown work on completion\n \nMinimum requirements\nEDUCATION:\nMinimum:  National Diploma or a Higher National Diploma. Electrical / Instrumentation/Mechatronics\n \nEXPERIENCE:\n·       A minimum of 3 - 5 years post-apprenticeship experience with knowledge of various instruments (temperature, pressure, flow, level, vibration, radiation, etc.) .This should cater for but not limited to these attributes:\n Installations\n Operations\n Maintenance\n Calibration\n·       Extensive knowledge of PLC Systems, DCSs and SCADA networks. This should include but not limited to:\n Installations\n Operation\n Maintenance\n Input/output tagging for PLCs and DCSs\n Analogue and digital circuitry wiring for PLCs and DCSs\n Programming of PLCs and DCSs\n Computer networking fundamentals\n Knowledge of the TCP/IP protocol\n Knowledge of the OSI model\n Familiar with industrial Ethernet networks\n·       Knowledge of AC/DC drives. This includes but not limited to:\nKnowing principles of power electronics\nKnowledge of electrical machines like motors\nSizing a AC/DC drive\nWiring the circuits associated with AC/DC drives\nProgramming AC/DC drives\n Maintenance on AC/DC drives\n·       Experience on installation, commissioning and maintaining of instruments, PLC Systems, DCSs, SCADA networks and AC/DC drives.\n·       Ability to calibrate all measurement and control systems.\n \nAPPLY"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p323863c4-f0ba-4aca-a564-342470f955ae"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-empowerment-fund-nef_orig.jpg",
            "href": "https://www.govpage.co.za/national-empowerment-fund-nef-vacancies-blog/national-empowerment-fund-nef-vacancies1722424",
            "title": "NATIONAL EMPOWERMENT FUND (NEF) VACANCIES",
            "content": [
                " \nNATIONAL EMPOWERMENT FUND (NEF)\n ",
                "SENIOR CREDIT RISK ANALYST\nListing reference: nef_000089\nListing status: Online\nApply by: 9 October 2024\nPosition summary\nIndustry: Financial Services\nJob category: Credit Analysis and Risk Management\nLocation: Sandton\nContract: Fixed Term Contract\nRemuneration: Market Related\nEE position: No\n \nIntroduction\nThe NEF is hiring a Senior Credit Risk Analyst to join our Credit Risk team on a 12 months contract. The incumbent will assist the department with performing detailed quantitative and qualitative credit analysis and insightful reporting with recommendations. In addition, contribute to the management of the companies Credit Risk by providing information and analytical support for the effective monitoring and control of risk exposure.\n \nJob description\nReporting\nProduce accurate risk reports with commentary and in the correct format \nPerform credit and background searches on applicant companies and the entrepreneurs and directors and prepare a credit and background checking report \nRate transaction using the risk rating model \nRun the pricing model to propose a final deal pricing having considered risk ratings \nSupport continuous development of credit risk capability through feedback in discussions and observations in different forums as appropriate \nRecommend improvement actions where appropriate\nSupport the building and development of credit metrics, as well as projects to deliver credit risk control \nAttend credit committees \nPerform other ad hoc duties as requested",
                "Minimum requirements\n \nQualification Requirements\nBachelor’s degree in Finance or Risk\n \nExperience / Skills Required\nMinimum 3 years of working experience in the Credit Risk environment \nHigh-level understanding of the concept of credit risk management \nReport writing skills \nGood technical capability in the use of SQL and MS Word and Excel; \nGood communication skills to be able to effectively communicate complex processes and outputs to colleagues with varying levels of technical knowledge\nAble to build relationships and networks both internally and externally \nSelf-starter with the ability to work under pressure; \nA logical approach to problem solving in relation to both technical and business issues.\n \nPersonal Attributes/Behaviours/Attitudes\n \nCognitive Competencies:\nAnalysis and Attention to Detail \nConceptual / Big Picture Thinking \nFocused and Sustained Attention \nProblem Solving \nTolerance of Ambiguity \n \nIntrapersonal Competencies\nExcellence/ Quality Orientation \nRule Orientation \nEthical Judgement \nFlexibility \nDrive and Results Orientation \nTime and Self-Management \n \nInterpersonal Competencies\nInterpersonal Agility \nBuilding relationships \nTeamwork \nEngaging diversity \n \nCommunication Competencies\nConflict Management \nPresentation and Facilitation \nVerbal and Written Communication (incl. Listening) \n \nFunctional Competencies\nCommercial and Financial Acumen \nProcess and Technological Competence \nSafety and Security Orientation \nMathematical Acumen\nResearch Competence \nEnvironmental Scanning \nKnowledge Sharing \nOrganisational Awareness\n \nAPPLY"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p5b4e5330-1a24-454b-b7d9-d457d175c85c"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/national-gambling-board-ngb.jpg?1728351061",
            "href": "https://www.govpage.co.za/national-gambling-board-of-south-africa-ngb-vacancies-blog/national-gambling-board-of-south-africa-ngb-vacancies8692436",
            "title": "NATIONAL GAMBLING BOARD OF SOUTH AFRICA (NGB) VACANCIES",
            "content": [
                " \nNATIONAL GAMBLING BOARD OF SOUTH AFRICA (NGB)\n ",
                "PERSONAL ASSISTANT TO THE CHIEF STRATEGIC ADVISER \nReference Number: NGB/005-2024 \nNature of Employment – Permanent position \nRemuneration Scale: R503,364 – R654,617 per annum \n(all-inclusive package) \nPreference will be given to Coloured Male and Female, White Male and Female, Indian Male and people with disabilities \n \nBRIEF SUMMARY OF THE ACT \nThe National Gambling Board (NGB) is established in terms of the National Gambling Act, (NGA) 2004 (Act 7 of 2004). It is a schedule 3A Public Entity in terms of the Public Finance Management Act, 1999 (Act 1 of 1999). The NGB makes provision for the coordination of concurrent national and provincial legislative competence over matters relating to the continued regulation of gambling activities and also makes provision for the establishment of uniform norms and standards applicable throughout the Republic in certain gambling activities. \n \nSTRATEGIC OUTCOMES \nThe strategic outcomes stated below straddle and apply across all positions within the NGB. Successful incumbents will be required to execute their functions in consideration of the following strategic outcomes: \nAccount for and identify all legal gambling machines, devices and owners, licensed juristic and natural persons and excluded persons; \nEconomic transformation and increased participation of Historically Disadvantaged Individuals in the mainstream gambling industry; \nEffectively monitored PLA compliance with gambling legislation; \nFacilitated S16 confiscation of proceeds from illegal gambling activities; \nEffectively monitored socio-economic patterns of gambling activity within the Republic; \nUniformity of legislation in the gambling industry; and \nBroad-based public education \n \nPURPOSE\nTo provide secretarial support to the Chief Strategic Adviser (CSA) and an administrative support function on all matters within the office.\n \nKEY PERFORMANCE AREAS \nDiary Management and Meeting Coordination \nManages the diary with guidance from the CSA by diarising and scheduling meetings promptly and correctly. \nRecords meetings on electronic calendar to allow for viewing by the CSA. \nSecures boardrooms and arranges refreshments for the CSA’s visitors. \nMeets and greets CSA’s visitors on arrival at the National Gambling Board to escort them through to the Office / Boardroom. \nFollows up on action items from meetings to ensure completion within stipulated deadlines. \nPrepares itinerary that includes details regarding dates, travelling times, maps / directions, addresses, phone numbers, e-mail addresses, parking and contact persons. \nChecks travel plans a few days prior to departure to ensure all is in order. \nSubmits approved travelling claims for payment upon the CSA’s return for purposes of re-imbursement. \n \nSecretarial support \nTypes business letters, memorandums and general correspondence for internal and external purposes. \nAssists with preparing of meeting packs. \nAssists with collating information for preparation of meetings. \nCoordinates responses to routine correspondence for the Office of CSA. \nTranscribes minutes of meetings distributes to relevant role players. \n \nOffice support \nScreens telephone calls to prevent unnecessary interruptions. \nCorrectly records and relay’s messages promptly to the CSA. \nAddresses queries from stakeholders and / or channels queries to correct role players. \nActs as the Point of contact for within the CSA’s office to ensure smooth operations. \nMaintains an effective filing system for ease of tracking and retrieval of documents. \nDevelops a database of contacts and updates regularly to ensure current information. \nDevelops good working relations with relevant personnel for ease of execution of duties. \nProvides ad-hoc administrative assistance as and when required. \n \nAdministration of performance information \nEnsures that all direct reports of the CSA have scorecards in place. \nCoordinates the performance management process between the CSA and direct reports. \nEnsures performance agreement of direct reports are signed, submitted on time and filed for easy reference. \nEnsures quarterly reviews take place and assessment sheets are signed and filed. \nFollows up on action items in relation to performance improvement for direct reports. \nTracks performance progress of direct reports in relation to the overall goals on the performance agreement of the CSA. \n \nRecords Management \nEnsure that records management is performed in accordance with NGB approved file plan and electronic document management system. \n \nMINIMUM JOB REQUIREMENTS \nQualifications\nThree years National Diploma or Degree in Administration or Management. \n \nExperience\nFive (5) years relevant experience as a Personal Assistant of which three (3) years relevant secretarial experience to an Executive Manager. \n \nCompetence and skills \nThe appointee must have the following skills: \nTyping \nBusiness English \nCommunication \nKeeping Minutes \nCoordination \nThe appointee must have the following knowledge in terms of legislations: \nPublic Finance Management Act. \nKnowledge of National Treasury guidelines & regulations.",
                "The successful applicants’ remuneration package will be in terms of the NGB Remuneration Policy. The National Gambling Board subscribes to the principles of Employment Equity. \n \nThe appointee will be required to sign a performance agreement within one (1) month of joining the organisation and this position is subject to a twelve (12) months’ probation period. \n \nTo apply for this position, interested applicants are required to complete the NGB employment application form to be obtained from NGB’s website www.ngb.org.za, attach and complete the following mandatory documents i.e. comprehensive CV, copies of qualifications and identity document. Failure to submit all requested documents will disqualify your application. \n\n \nThe completed application with all supporting documents must be submitted by e-mail to hr@basadzi.co.za, hand delivered to the NGB offices at 1085 Francis Baard Street, Hatfield, 0028 or posted to the Human Capital Optimisation, Private Bag x 27, Hatfield 0028. \n \nCLOSING DATE for all applications: 14 OCTOBER 2024 \n \nBackground verifications, criminal record checks, citizenship check and competency assessment will form part of the selection process. It is the responsibility of candidates or applicants with foreign qualifications to have them verified by the South African Qualifications Authority (SAQA). If you have not been contacted within three months after the closing date, please regard your application as unsuccessful. \n \nIMPORTANT NOTICE \nBy applying for this position, you hereby acknowledge that you have read and accept the following Protection of Personal Information Act (POPIA) disclaimer:\nI hereby consent for NGB to process my personal information as part of the recruitment process. NGB shall take all reasonable measures to protect the personal information of applicants and for the purpose of this disclaimer “personal information” shall be defined as detailed in the Protection of Personal Information Act, Act 4 of 2013 (POPIA”). \n \nThe NGB reserves the right not to fill the position."
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p973b199e-e3d2-4dfc-ba00-e8f7443df69d"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/national-home-builders-registration-council-nhbrc.png?1728351363",
            "href": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies7321646",
            "title": "NATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC) VACANCIES",
            "content": [
                " \nNATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC)\n ",
                "CHIEF OPERATIONS OFFICER (COO)\nCONTRACT TYPE: 5 YEARS FIXED TERM CONTRACT\nJOB GRADE: PEROMNES 2\nREPORTING TO: CHIEF EXECUTIVE OFFICER\nLOCATION: CENTRAL OFFICE, SUNNINGHILL JHB          \n                         \nKEY DELIVERABLES\nReporting directly to the Chief Executive Officer, the Chief Operations Officer is responsible for operational systems and processes aligned with strategic goals, policies, and objectives approved by the Council. The COO is further responsible for overseeing the execution of the company’s business plans according to its business model.\n \nThe Individual will primarily be responsible for, but not limited to the following:\nLead, manage and monitor the process of developing and implementing NHBRC strategic plans, and review and monitor annual business plans and where appropriate implement corrective actions to realize stakeholder value and NHBRC sustainability.\nDevelop strategic plan from the overall business plan. Responsible for the organisation short, medium and long-term strategies for the fulfillment of business deliverables. Visualizes the future for the proper adaptation of long-term strategies.\nManaging and providing strategic leadership and oversight to assigned divisions across 9 provinces (Business Services/Customer Care, Technical Services, Corporate Services, Legal, Compliance & Enforcement, Policy Development, Social Transformation. etc.)\nImplementation and maintenance of the NHBRC’s operations procedures, reporting on the performance and initiating improvements for operations.\nEstablish procedures for maintaining high standards of operations, effectiveness, reliability and safety.\nDirect, monitor and report on the identification of all major risks and development and implementation of mitigating action plans and a business continuity plan for disaster management to ensure the organisation’s sustainability and governance compliance. Adapts strategic change by adapting own strategy, making changes in the overall plans, work processes, staffing and project approaches to adapt to evolving business situations. Makes changes and actively seeks to influence strategy.  Uses leading-edge technologies and processes to affect company plans and promote future client needs.  Adapts tactics and industry know-how for effective Management process.\nReview and monitor that all procurement and contracts entered into meet all legislative and regulatory requirements and that competitive pricing is achieved.\nEstablishes a strategic partnership with the customers for generation of customer-driven solutions and recommends change to effect customer satisfaction and add overall value to customer results.\nActs as a custodian of organisational policy in relation to external parties and vendors.\nFostering and implementation of any statutory governance to internal Housing Protection Measures Act.\nReport to the CEO, operational matters for review in advance of meetings of the Council; or as requested by the Council, attend meetings of the Council and its Committees and present the information necessary or relevant to the Council or such Committee for discharging its duties.\nEnsures the development and implementation of the Employment Equity requirements.\nFoster a corporate culture that promotes ethical practices, customer focus and service and encourages individual integrity.\nEnsures the adherence to all labour laws.\nEvaluate the performance of executives;\nPerform other functions related to the office of the COO or as may be requested by the CEO or the Council.\nLiaises with stakeholders at the highest level i.e. Minister, MEC’s & Premiers and Portfolio Committee.\n \nMINIMUM REQUIREMENTS:\nMust hold a Postgraduate Degree in Civil/Structural Engineering, Architecture or related built environment qualification is mandatory.\nProfessional Registration (Pr) with the relevant built environment is mandatory\nAn appropriate Postgraduate Degree (NQF 9) in Business Administration/Leadership\nMinimum 10 years of Operations Management experience in a large organisation within the construction/built environment /housing sector\nMinimum 10 years of experience in managing technical teams of which 6 years should be experience in leading Executive Teams\nHands-on and practical experience in public sector procurement and compliance practices\nExperience in a regulatory sector will be advantageous\nAdvantage:\nLeadership experience in operations within Government/Semi-Governmental field and\nExtensive knowledge of NHBRC’s operations and its product\n \nAPPOINTMENT\nThe above-mentioned position will be offered on a 5-year fixed-term contract with a Total Cost To Company package.\n \n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMs. Neo Stephens\nTel: (011) 317 0496\n \nCLOSING DATE: 13 October 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Chief Operations Officer” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates shall be subjected to appropriate psychometric testing and other selection instruments. The successful candidate will be required to obtain security clearance as a condition of their appointment. In conjunction with merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups.",
                "PROVINCIAL MANAGER: CUSTOMER EXPERIENCE & MARKET DEVELOPMENT: LIMPOPO\nCONTRACT TYPE: PERMANENT\nJOB GRADE: COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\n\nREPORTING TO: EXECUTIVE MANAGER CUSTOMER EXPERIENCE & MARKET DEVELOPMENT\nLOCATION: POLOKWANE\n                                                                                \n KEY DELIVERABLES\nThe Provincial Manager: Customer Experience & Market Development within the organisation serves to manage, co-ordinate and monitor all activities of the provincial office and its satellite offices to ensure operational excellence for the region.\nThe Individual will primarily be responsible for, but not limited to the following:\nProvide input into the overall Corporate Strategic Plan\nProvide input into the development of the Provincial Strategy\nDevelop Provincial Strategic Plan and implementation programmes based on Annual Performance Plan (APP)\nDevelop policies, procedures and process flows.\nManage and guide office managers (Administration Officer/s) in execution of all duties and functions assigned to them.\nManage and guide office supervisors in execution of all duties and functions assigned to them.\nPromote and maintain positive working relationships amongst provincial staff.\nSupport and advise line manager in their management role.\nReport as required to the line Manager on all areas of responsibility.\nBuild and lead strong professional and functional provincial team.\nManage all Facilities and Maintenance related services at NHBRC Provincial and Satellite Offices.\nDevelop, implement, monitor and review policies, procedures, standards and process flows.\nRespond to audit and risk requests and findings.\nEnsure compliance to all NHBRC policies and procedures and applicable regulations.\nPrepare submissions for EXCO and relevant Council sub-committees.\nPrepare monthly/quarterly and annual Provincial Performance reports and all other relevant reports.\nEnsure a safe working environment in line with Occupational Health and Safety Act\nDevelop risk and audit management mitigation plans based on findings.\nContribute to the development and maintenance of the risk register for the section.\nCollaborate with Audit, Risk and Governance and Compliance functions in monitoring and implementing compliance processes.\nDevelop a zero-based and incremental budget for the Provincial Office.\nManagement of the Provincial Office budget and ensuring financial stability within the province\nExercise cost containment and ensure expenditure is within the approved budget through effective cost control measures.\nMaximise revenue through effective VFP management.\nManage the procurement of and safeguarding of assets of the Provincial Office(s)\nReview and approve purchase requisitions for the province within its own area of responsibility.\nAuthorise or recommend claims against the warranty fund in line with DOH.\nApprove petty cash expenditure.\nApproval and rescindment of financial guarantees.\nDevelop a demand plan for the province.\nAuthorise or recommend IPWs for claims for forensic work.\nReview age analysis and debtors accrued liability engagement with debtors to ensure payment.\nEnsure creditors’ payment within prescribed Treasury timeframes.\nProcurement of office (both main and satellite), and management of lease contract thereof\nManage Service Level Agreements with service providers.\nBuild client relations by demonstrating professionalism, a facilitative communication style, and constructive response to client needs.\nMaintain positive interpersonal relationships with team members and others by demonstrating productivity, initiative, and flexibility.\nProvide relevant and specialised technical support to applicable stakeholders.\nConsult and advise with all role players that are stakeholders in NHBRC services.\nEnsure alignment of services with NHBRC mandate.\nOversee the management of NHBRC marketing campaigns and information programmes.\nDevelop a marketing and stakeholder relations plan that meets the strategic objectives of the province and the organisation and oversee its implementation.\nEducate Builders and consumers through education and awareness programs.\nEstablish and maintain effective customer feedback mechanisms.\nEnsure efficient and professional VFP services are rendered to customers.\nRepresent the NHBRC at external forums.\nRepresent NHBRC through all forms of media.\nEstablish and maintain relations to the government and other key stakeholders in the province and provide support services.\nPromote the brand and positive image of the NHBRC.\n \nMINIMUM REQUIREMENTS:\nMust hold an appropriate bachelor’s (NQF 7) or equivalent, preferably in Business Related field.\nMinimum of ten (10) years’ work experience preferably in the Built Environment of which five (5) years of this experience should be in a supervisory or management-level role.\nKnowledge of legislation and policies regulating the human settlement sector would be added advantage.\n \n \nAPPOINTMENT:\nThe above-mentioned position will be offered on a permanent basis with a Total Cost To Company package.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMr. Jabulani Ntshani\nTel: (011) 317 0146\n \nCLOSING DATE: 11 October 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Provincial Manager: Customer Experience & Market Development Limpopo” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates will be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups."
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p32282b8d-a30c-410c-9fe4-ae236ac2138b"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/raf_orig.jpg",
            "href": "https://www.govpage.co.za/road-accident-fund-raf-vacancies-blog/road-accident-fund-raf-vacancies8918443",
            "title": "ROAD ACCIDENT FUND (RAF) VACANCIES",
            "content": [
                " \nROAD ACCIDENT FUND (RAF)\n ",
                "DOCUMENT MANAGEMENT: ADMINISTRATIVE ASSISTANT (X2)\nDivision:  Operations\nReference No:  4886\nLocation:  Johannesburg, Gauteng, ZA\nEmployment Type:  Fixed Term Contract\nDisability (EE targeted role):  No\nT.A.S.K Grade:  06\nJob Posting Salary:  R244,732.00\nJob Posting End Date:  11 Oct 2024\nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nNB: This is a 12-Month Fixed-Term Contract position \n \nPurpose of the Job: The Administrative Assistant is responsible for providing administrative day-to-day support to the Document Management Department.\n \nKey Performance Areas\n \nCompliance Administration\nMaintain up-to-date written documentation related to the departments business activities.\nEnsure compliance to the policies and process standards.\nKeep abreast of internal standards and business goals to ensure adherence to sound internal control.\n \nOffice Coordination\nAssist in making follow-ups on outstanding matters.\nEnsure all requests are handled and responded to within set timelines.\nAssist in ensuring the availability of stationery within the department.\nValidate and verify information and documents submitted for accurate capturing and further handling.\nEnsure the systems/registers used are kept up to date.\nCheck for duplicate documents, requests and queries and report on them.\nAllocate reference numbers and accurately capture related documents on different systems.\nAllocation of matters to responsible team members.\nDraft and send out letters to all stakeholders as required.\n \nMeeting Support\nArranging meetings on behalf of the department.\nAssist with taking and distributing minutes in accordance to set governance standards.\nCreate and maintain a register to track matters outstanding.\nMaintain a follow-up plan on meeting resolutions and matters outstanding.\nEnsure confirmation of meetings and management of team diaries.\nSchedule appointments with internal and external stakeholders as and when required.\n \nDocument and Records Management\nAdminister the records management and filling processes in line with the RAF filling plan\nEnsure that the filing system is always up-to-date and functional.\nRetrieval of information at all times as requested in the office.\nEnsure confidentiality of all documents under control and that documentation reaches the intended recipients.\nAcknowledge the receipt of documentation, apply a file number allocation, record data onto the computer system and file appropriately.\n \nQualifications\nMatric or Grade 12 certificate.\n \nExperience\nRelevant 1 years’ experience in Administrative or similar environment.\n \nCompetencies\nBehavioural\nPlanning, Organising and Coordinating\nPersonal Mastery\nEmotional wisdom and Decision Making\nEthics and Values\nClient Service Orientation                                                                                                                                       \nTechnical\nComputer literacy in MS Word, Excel, PowerPoint.\nExcellent planning and organisational skills.\nGood administrative skills.\nAbility to access required information.\nWriting skills.\nBasic understanding of SCM processes.\nBasic financial acumen.\n \n \nNB: \"RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs.\" \n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\n\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »",
                "SENIOR OFFICER: CYBERSECURITY\nDivision:  Strategy and Transformation\nReference No:  4919\nLocation: Centurion, Gauteng, ZA\nEmployment Type:  Permanent\nDisability (EE targeted role):  No\nT.A.S.K Grade:  13\nJob Posting Salary:  R668,708.00\nJob Posting End Date:  15 Oct 2024\n \nThe Road Accident Fund’s mission is to provide appropriate cover to all road users within the borders of South Africa; to rehabilitate and compensate persons injured as a result of motor vehicle accidents in a timely and caring manner; and to actively promote safe use of our roads.\n \nPurpose of the Job: Reporting to Manager: Cyber Security Operations, the successful incumbent is responsible to protect and maintain the confidentiality, integrity and availability of all data processed on the RAF’s ICT systems and networks.\n \nKey Performance Areas\n \nCreate and Manage Documented Standards, Processes and Procedures\nEnsure compliance with ICT security standards, processes, and procedures for both systems and applications.\nDevelop and update necessary documentation to support system and application security measures.\nSupport regular reviews of these standards, processes, and procedures.\nAid in the creation and upkeep of various documentation, including business recovery plans, technical standards and procedures.\n \nSecurity Solutions Implementation and Maintenance\nDevelop and implement security procedures, and standards to safeguard company assets and data.\nManage and administer common security tools such as Data Loss Prevention (DLP), Antivirus software, and Cloud Security Tools like Cloud Access Security Broker (CASB).\nConduct regular security assessments and audits to identify vulnerabilities and assess the effectiveness of existing security controls.\nCollaborate with IT teams to design and implement security measures for new systems and applications.\nProvide guidance and support to internal teams on security-related matters, including incident response and security awareness training.\nStay abreast of industry trends, emerging threats, and best practices in cybersecurity to continuously improve RAF security posture.\n \nSecurity Monitoring\nMonitors networks and analyses intrusions using various tools like Intrusion Detection/ Prevention Systems (IDS/ IPS), firewalls, and Host-Based Security System (HBSS).\nIdentifies unauthorised usage trends by correlating network activity across different networks.\nReviews alerts and sensor data, then compiles technical incident reports.\nResearch emerging threats and vulnerabilities to aid in detecting network incidents.\nOffers incident response support to network subscribers, including implementing containment actions and facilitating forensics analysis as needed.\nConducts pre-implementation testing on new computers, software, switch hardware, and routers to ensure security.\nAssists in developing business continuity/disaster recovery plans, conducts disaster recovery tests, publishes results, and implements necessary changes to address any deficiencies.\n \n2nd Level Support on Cybersecurity Incidents\nResponds and resolves reported security incidents\nResponds to and, where appropriate, resolves or escalates reported security service requests\nMonitors system logs from the SIEM and other network traffic for unusual or suspicious activity. Interprets such activity and makes recommendations or escalate for resolution\nCollates security incident and event data to produce monthly exception and management reports.\nInvestigates and resolves security violations by providing postmortem analysis to illuminate the issues and possible solutions\n \nImplement Security Controls Across Applicable RAF Systems and Networks\nVerify all requests and changes are correctly authorised before implementation.\nEnsure that the implementation of controls follow the RAF change control procedure.\nParticipate in identifying potential security violations, segregation of duties and risks prior to and post implementation of controls.\nOperate and administer ICT security control solutions to ensure that systems and applications are protected against security threats and vulnerabilities.\nAdhere to processes and procedures to ensure that security solutions under your control are always functioning correctly.\n \nICT Security Awareness\nParticipate and assist with the development of Information Security awareness programs within the RAF.\nParticipate and assist with awareness by appropriate means such as, employee briefings, intranet, newsletters, and road shows.\nHandle enquiries relating to ICT security and escalate where you are unable to assist.\n \nMonitoring, Reviewing and Reporting on ICT Security\nParticipate with all monitoring, reviewing and reporting activities for systems and applications under your control.\nParticipate in defining and implementing processes and procedures to ensure monitoring, reviewing and reporting activities are performed as agreed.\nProvide quality and accurate inputs for reports as agreed.\nParticipate in monitoring ICT systems and applications changes to security controls and applicable security breaches/incidents and compliance status.\nProvide inputs for periodic reports on systems and applications under your control.\nProvide recommendations for appropriate security control improvements, introduction of new security controls.\n \nAuditable Record Keeping\nParticipate and assist with defining and implementing processes and procedures to ensure that auditable records are kept for all security activities for which the teams are responsible.\nParticipate and assist in maintaining all records.\n \nReporting\nTrack and report against set objectives and targets.\nReport on emerging risks.\nProvide ad hoc reports on process improvement initiatives.\n \nStakeholder Management\nMaintain healthy relationships with all stakeholders.\nFollow up and resolve all queries, following up and making recommendations on which corrective actions are appropriate.\nFollow up and feedback to all stakeholders to keep them updated on the status of a query.\nRespond to queries within the predefined turnaround times.\n \nAudit Recommendation Analysis and Implementation\nParticipate and assist in defining and implementing processes and procedures to ensure that audit recommendations are:\nanalysed before implementation thereof.\nare properly authorised and implemented within the time schedules agreed.\nAssist in implementing recommended changes as per audit\nParticipate and assist in reporting the status of recommendation analysis and implementation regularly to management.\n \nQualifications and Experience\nBachelor’s Degree/ Advanced Diploma in Information Technology related qualification.\nCertifications such as Security +, CISSP\\ CEH\\ Cybersecurity Practitioner Certification are advantageous.\nRelevant 4 years’ experience in an ICT Security related environment.\nExperience in developing, documenting and maintaining security procedures.\n \n \nNB: “RAF offers Total Employment Cost packages with no additional contributions from the Employer, successful candidates are required to structure their packages in a manner that will suit their needs”.\n \nThe Road Accident Fund subscribes to the principles of employment equity and preference will be given to People with Disabilities.\nApplicants who have not received any correspondence from us within six weeks from the closing date can consider themselves unsuccessful\nSecurity Vetting shall be conducted on all prospective employees\nIt is the applicants’ responsibility to have foreign qualification evaluated by the South African Qualification Authority (SAQA) and to provide proof of such evaluation.\n \nAPPLY NOW »"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "pad297ec8-e351-4a27-b264-f339be1656fb"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sabc_orig.jpg",
            "href": "https://www.govpage.co.za/south-african-broadcasting-corporation-sabc-vacancies-blog/south-african-broadcasting-corporation-sabc-vacancies7653123",
            "title": "SOUTH AFRICAN BROADCASTING CORPORATION (SABC) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN BROADCASTING CORPORATION (SABC)\n ",
                " \n \nPERSONAL ASSISTANT COMPANY SECRETARY OFFICE\nReporting line: Company Secretary\nDivision: Company Secretary\nScale Code: 402\nPosition ID: 60017481\n \nCLOSING DATE: 13 October 2024\n \nMAIN PURPOSE OF POSITION\nReporting to Company Secretary : To ensure Smooth running of the office of the Company Secretary daily activities through the effective and efficient management of the office and dairy in accordance with the requirements.\n \nDUTIES AND RESPONSIBILITIES\n \nOFFICE MANAGEMENT\nEstablish and maintain good relations with all staff, management, and stakeholders\nPlanning, organising and scheduling the Company Secretary diary including electronic diary management, scheduling of meetings and calendar events.\nManage changes, actions and reminders\nEnsure that all correspondence for noting and approval by the Company Secretary is administered timeously\nCoordinating and monitoring of the office resources to ensure that all is in working order.\nEffective handling of client complaints and enquiries.\nOrdering stationery, and any consumables required by the Office of Company Secretary\nCo-ordination meetings with internal and or external stakeholders.\nManagement of all office expenses.\nProvide Support to office of the Company Secretary inclusive of Administration and logistical support\nAttend to any outstanding actions resulting from meetings arranged and/or attended\nCoordinate the timeous receipt of Board and Exco packs for these meetings\nScreening all calls to Office of the Company Secretary, and connects or redirect as necessary.\n\n2. LOGISTICAL ARRANGEMENTS\nProcessing of information system for approval.\nArranging and coordinating of all special events/ functions/ seminars/ conferences/ workshops.\nCoordinating all logistical arrangements (including flights, car hire, accommodation etc.).\n \n3. DOCUMENT MANAGEMENT\nTimeous and accurate preparation and management of documentation\nEffective management of the filing system to ensure easy retrieval of information and all records.\nEnsuring that all sensitive documents and or information are managed appropriately.\nEnsuring effective processing of documents in-and-out of the office of the Group Executive  and implementing an effective document follow-up and/or tracking system.\n\nMINIMUM REQUIREMENTS AND EXPERIENCE\nNational Diploma in secretarial/administration or any other equivalent tertiary qualification.\n5 years’ experience as a secretary or similar role.\n\nKNOWLEDGE:\nGeneral knowledge.\nComputer literate - Microsoft Office and in particular Excel, Word and PowerPoint, SAP (preferred but not critical), the Internet etc.\nCreativity and innovation.\nProactive and action-orientated.\nEstablish and maintain good relationships.\nGood written and verbal communication skills\nAttention to detail.      \nPlanning and organisation.\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n\n \nONLINE EDITOR: CHANNEL AFRICA\nReport Line: Editor: News & Current Affairs\nDivision: Radio\nScale Code:  401\nPosition ID: 60017996\n \nCLOSING DATE: 13 OCTOBER 2024\n \nMAIN PURPOSE OF POSITION\nPlan, assign, manage and co-ordinate multimedia coverage of local, national, continental and international events and stories for the Channel Africa website. The online editor is responsible for daily multimedia production, working closely with content producers and digital specialists to enhance the multimedia offering on the website and to increase traffic to the website.\n \nDUTIES AND RESPONSIBILITIES:\nProvide support and input in the development and implementation of Channel Africa’s strategy.\nDevelop and Implement implementation plans relevant to the unit, from the station’s strategy.\nProvide strategic direction   to the online team in terms of defining the business unit’s strategy and operational objectives.\nPlan, organize and control activities pertaining to the business unit.\nEnsure important stories particularly from the African continent, are reflected on the website\nEdit, proofread and approve all written material, checking on copyright, libel and other legalities.\nOversee web streaming of live events, web publishing of video, audio and other content\nOversee selection, creation and editing of stories, images, graphics and animation.\nEdit text and copy, pictures, sound from online writers and approve for publishing\nEdit translations of stories from other language services.\nCheck story facts from various news sources to ensure factual end product.\nSearch news sources and newsroom for breaking stories, fresh angles and updates.\nAdhere to the SABC editorial code.\nAdhere to South Africa’s Constitution, all broadcasting and other legislation, Icasa regulations, the BCCSA Code of Conduct, SABC editorial policies and radio news and current affairs style guide etc.\nAssist the development and ensure implementation of Standard Operating Procedures (SOP).\nOversee the management of online unit risks to protect organisational integrity, create value, prevent financial loss and ensure compliance with applicable policies and legislations.\nMonitor and report on compliance in line with OHS requirements.\nManage and oversee the internal risk and provide mitigation plan.\nAttend to internal and external customers/clients queries/ complaints\nNetwork with other newsmakers and sources of news\nCommunicate with other news outlets in the SABC\nDetermine and serve customers/clients’ needs\nContract and manage the SABC’s Performance Management System with the team in accordance with the organizational policy and procedures.\nAllocate responsibilities and scheduling of team.\nManage available staff and ensure fair and balanced distribution of work.\nCoach, mentor and develop the team.\nDirect, manage and develop the performance of staff. \nProvide direction on the retention and attraction of staff.\nManage the employee relations to ensure conducive and productive working environment.\nOversee the implementation of organisational development initiative i.e. Wellness, Employment Equity, Career Progression, Talent Management, and Human Capital Planning etc.\n \nREQUIREMENTS:\nDegree or National diploma in Journalism/Media studies or related field of study. (NQF 6)\n4-5 years relevant experience in radio broadcasting environment.\nWork experience in an online news media environment will be an advantage\nKnowledge and understanding of broadcast standards, Policies and SOP’s\nAdvanced understanding of SABC broadcast operations\nGood understanding of equipment and facilities within broadcasting environment\nKnowledge & understanding of transmission chain.\nKnowledge & understanding of play-out and recording systems e.g. Dalet or Dira!\nSound understanding of current trends and issues in the social, economic and political environment on the African continent.\nImpeccable English writing skills.\nAbility to work with people of diverse language and culture.\nExcellent news sense.\nAbility to work under pressure and for long, irregular shifts.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \n \nPRODUCTION CONTROLLER X3\nDIVISION: Video Entertainment - Operations\nREPORT LINE: Manager – Production Control\nSCALE CODE: 401\nPOSITION ID: 60019712, 60019713, 60019714\n \nCLOSING DATE: 11 October 2024\n \nMAIN PURPOSE OF POSITION\nThe purpose of the job is to evaluate SABC funded production budgets line by line against SABC pricing norms by considering specific needs of the production; and ensure optimal use of resources to achieve the intended outcome; and on-going monitoring of risk to reduce threats to project objectives.\n \nDUTIES AND RESPONSIBILITIES:\nContribute to the development of the Production Management Strategy\nImplement the approved Production Management Strategy\nMaintaining cost within the operational Production Management budget\nEffective management of the productions within the Video Entertainment approved budget\nFinalisation of production budgets and closures of projects within the approved timelines\nEliminate Fruitless and Wasteful Expenditure and Irregular Expenditure on productions\nEnsure that production cashflow is aligned to the production schedule and Production Control deliverables\nEffective management of production control process to ensure that productions continue without disruption\nReview the Production Control Tariff List annually to ensure that rates are in line with the industry norms\nNegotiate volume deals with suppliers to achieve economies of scale in the allocated production budget\nCompile and deliver accurate and timeous monthly report and production progress report.\nReview the budget pack and ensure that it remains current\nAssess the underlying information presented by the producer to confirm the accuracy of the production’s financial status.\nEnsure that the production expenditures are accounted for and used economically, efficiently and solely for the purpose for which they are granted\nMonitor compliance with the provisions of the production agreement and promote sound, efficient and well managed productions\nHelp prevent and detect fraudulent activities; and aid producers in establishing an ethical television industry\nEliminate deliberate misstatement, misrepresentation and omission of financial reporting data that could affect the smooth operation and efficiency of the production\nKeep abreast of latest technology and production techniques to ensure effective production and use of available funds\nEnsure transparency of production processes by applying industry norms and keeping relevant parties informed\nVisit production offices and sets to ensure reconciliation between production processes and budgets\nImplement internal control measures to ensure good governance and compliance\nOversee the management of production finance to protect organizational integrity, create value, prevent financial loss and ensure compliance with applicable policies and legislations\nReport on operational risk and compliance profile as related to finance\nAdhere to finance policies and standard operating procedures\nImplement internal control measures to ensure good governance and compliance\nOversee the production budget and mitigate possible risks to prevent financial loss\nVerify internal and external resource utilization\nAssist in the compilation of production benchmarks for all productions\nReport on production expenditure against budget per production\nEnsure that Performance Management Contract are completed and signed annually\nEnsure that Performance Management Contracts are reviewed quarterly\nEnsure that Personal Development Plans are completed annually\n \nREQUIREMENTS:\nBachelor’s Degree / National Diploma (NQF 7/ NQF6) in Film and Television Production/Communication / Financial / Cost Accounting/ Business Management or related equivalent qualifications.\n7 years’ experience in the broadcasting production environment with specific knowledge in any of the television production disciplines, being production management; line producing; production accounting; or production budgeting of which 2 years in production accounting.\nExperience in a variety of genres and sub-genres in any of the above disciplines including but not limited to fiction, documentary, variety & magazine and reality.\nPFMA knowledge\nInternal Auditing\nBusiness Plan\nProject management\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \nHR CONSULTANT: HUMAN RESOURCES (KZN-DURBAN)\nReport Line: Lead/s: Human Resources Business Partner\nDivision: Human Resources\nScale Code: 401\nPosition ID: (60017625)\n \nCLOSING DATE: 10 OCTOBER 2024\n \nReporting to the Lead: HRBP, the incumbent is to partner with HRBP Lead & Consultant to provide HR services, advice and support to the relevant region/ unit in order to establish and implement HR programmes that foster the organization and people development for them.\n \n DUTIES AND RESPONSIBILITIES\n DEVELOPMENT AND IMPLEMENTATION OF STRATEGY (STRATEGY ALIGNMENT)\nParticipate in regional/business unit management meetings and strategic planning sessions to obtain a clear understanding of business requirements. \nAnalyses effectiveness and efficiency of HR practices and programmes through discussions and focus groups.  Involves line and HR colleagues to effect required changes.\nApplies theoretical knowledge and understanding in practice in order to influence current work cultures and leadership styles. \nUses standardized measurements to assess leadership styles.  Communicate results to relevant stakeholders.  In conjunction with senior HR-colleagues design interventions to affect modification to leadership styles and behaviours.\n \nMANAGE TALENT ATTRACTION AND RETENTION PROCESS\nIdentify the vacancy, check whether the vacant position is funded and critical. Then, complete the Request to Employ and engage the line manager.\nEnsure that interviews are scheduled\nSubmit advert to HRSSC for advertising (internal and or external)\nIn conjunction with Line Manager and Panel:\nconduct final short-listing with line manager,\ndevelop interview questionnaire guidelines and decision matrix,\nconduct the interviews and assessment - compile interview report.\nProvide guidance and advice to line manager on the recruitment processes\nFacilitate the qualification and background check.\nPro-actively address client needs on all human resources matters.\nIn collaboration with HRBP Lead & Consultant\nmake employment offer & On-boarding and engagement packs to the successful candidate,\nadvise line manager on the remuneration directive guidelines to attract and retain incumbents,\nmake the counter offer to retain the incumbents where possible,\nidentify short, medium- and long-term resourcing issues; engage clients on new roles, replacement and recruitment and retention strategies.\n\nCOLLABORATING WITH LEARNING AND DEVELOPMENT AND COORDINATION OF EMPLOYMENT RELATIONS\nIdentify and recommend training needs, gaps and interventions\nEnsure that division and each employee submit Personal Development Plans\nFacilitate the implementation of the Workplace Skills Plan (WSP)\nAdvise and facilitate the divisional specific training needs, and all relevant training interventions\nCollaborate with organizational effectiveness, employee relations and remuneration colleagues to ensure efficient delivery within customer base.\nAdvice, manage, and facilitate grievances and outcomes of the disciplinary matters.\nEducate and advise managers, staff on adherence to HR processes, policies, rules and legislation.\n \nCOLLABORATE AND COORDINATION OF ORGANISATIONAL DEVELOPMENT PROGRAMMES & REMUNERATION AND BENEFITS\nAdvise and educate employees on wellness services\nManagement of employee referrals to wellness\nMonitor the progress of the employees\nContribute toward the implementation of wellness programmes within the division.\nUpdate and compile the EE plan, reports and presentations.\nAdvise line on implementing divisional micro-plan EE targets.\nAdvise on the process and procedure of job evaluation\nComplete the job evaluation request form with the line manager.\nCoordinate the process of developing job profiles.\nCheck and ensure that the supporting documents are attached for evaluation.\nRequest for creation for posts in conjunction with line manager.\nFacilitate and coordinate the process of review of the organisational structure.\nFacilitate the implementation of human resources projects\nImplement performance-based culture intervention within the business unit.\nAdvice and coach business unit on performance contracting, monitoring and reviews.\nCapacitate business unit on performance management process.\nFacilitate and advice on dealing with non-performance matters and dispute arising from performance management review.\nTo manage a change management ethos and understanding within the division, providing support to management with a rapidly changing media environment.\nUnderstand and champion the business of being a strategic business partner.\nAdvise on the remuneration scale code and benefits, remuneration related process and policy.\nProvide advice on all benefits such as, the medical aid contributions, group life and pension, long service awards, commemorative fund, best funeral scheme, etc.\n\nGENERAL ADMINISTRATION, MAINTENANCE AND HR ANALYTICS\nFacilitate the termination of employment\nCoordinate and action relocation/ transfers of employees i.e. allowance payment.\nFacilitate the compliance and completing declaration of business interest(s) on SAP.\nPrepare and submit inputs into human resource monthly reports\nKeep abreast of human resources practices and labour law updates in order to provide a one-stop professional human resource service\nUses HR technology and systems (SAP) to extract relevant HR data for line management to make better decisions on workforce issues/matters\nCompile and presents meaningful HR reports through interpretation, comparisons and trend analyses\nOversees the process of ensuring data integrity of HR system\nConduct and analyse exit interviews with suggestions on improvement to line management\n\nSTAKEHOLDER MANAGEMENT\nTrusted and works effectively with all stakeholders to improve effectiveness across all HR function\nPartner with HR Services and the Centres of Expertise to ensure seamless HR service for Management, Labour and Employees \nInfluence the adherence to HR policies and procedures through effective support to the business\nFormulate strong partnerships with business to manage any under-performance and dealing with ad-hoc employee relations issues.\nCollaborate with relevant HR Specialists to identify, enhance and promote best practices aimed at forming an effective HR service.\nGuiding people to address SABC Processes & Policies\nUnderstand employee opinions and anticipate their needs and concerns.\n \nINHERENT/MINIMUM REQUIREMENTS\n \nQUALIFICATIONS\nDiploma/Degree (NQF 6/7) in Human Resources or related discipline\nMembership of SABPP and IPM will be a recommendation\n \nEXPERIENCE\n3 years’ experience in human resources environment\nExperience in working in a unionised environment will be an advantage\nThorough knowledge of HR processes and policies\n \nKNOWLEDGE\nHuman Resources Information System\nSouth African employment/labour legislation  and related regulatory frameworks\nHuman resources governance, principles, rules, processes and procedures.\nDemonstrates thorough understanding of HR theories and best practices regarding behavioural drivers for improving and sustaining working relationship;\nThorough understanding and capability in Individual, Team and Organisational Development processes.\nDemonstrates thorough understanding of Emotive, Behavioural and Leadership Development processes.\nDemonstrates thorough understanding of labour relations, coaching, counselling and mentoring theories and best practices, as well as methodologies.\nDemonstrates thorough understanding of Conflict Resolution Processes, (facilitation, mediation, arbitration of individual, team and unions) techniques and feedback. \nWorking knowledge of the legislative framework governing human resource practices in the country.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "AUDIO VISUAL IMAGING PRODUCER: SAFM\nReport Line: Programme Manager\nDivision: Radio\nScale Code:  403\nPosition ID: 60018026\n \nCLOSING DATE: 09 OCTOBER 2024\n \nMain purpose of position\nTo conceptualize, produce and deliver high quality Seasonal, Generic, Programme Specific and Campaign Specific multi-platform Imaging Material & Promos in line with the station’s sound and feel, programme briefs, campaign briefs and programming & marketing strategies.\n \nDUTIES AND RESPONSIBILITIES:\nConceptualize, script, and produce cutting edge, high quality, generic, seasonal and thematic Station Imaging (jingles, promos, and one-liners).\nPrepare/compile briefs for station’s brand and imaging campaigns.\nIdentify relevant voices in order to produce unique and up-to-date station imaging.\nReceive bookings and prepare for recordings, ensuring all equipment, facilities and resources are available for production, according to production specifications.\nAssist in the planning, preparation, logistical arrangements and production of station promos.\nEffective recording of productions, ensuring the optimal mix of all the sound for broadcast, recording and sound reinforcement, in order to optimally deliver on the production needs and requirements.\nContinually monitor the technical quality of recording, ensuring optimal quality of broadcast and adherence to broadcasting standards.\nTimeous and accurate administration of production procedures, ensuring adherence to operational standards.\nEffective monitoring of technical quality and reporting of faults, in order to resolve any technical problems.\nAdvise and assist on appropriate aspects, limitations, alternatives and utilisation of equipment to minimise mistakes and optimise and enhance product.\nProvide advice on aspects of quality control, in order to ensure superior quality of broadcasts.\nAssess and evaluate new equipment and provide feedback on relevance and suitability.\nEffective execution of daily administrative tasks to assist with the effective functionality of the section.\nExecute administrative procedures necessary for the smooth running of the business unit.\nEnsure timeous studio bookings to ensure delivery of promo materials according to agreed timelines.\nCreate and manage production schedules for recording of promos, liners and other imaging elements.\nEnsure effective informal and on-the-job training for interns and junior employees to ensure a competent staff compliment.\nProvide weekly and monthly imaging Reports, highlighting key milestones, challenges and achievements.\nCommunicate with internal and external stakeholders regularly to ensure timeous delivery of Imaging and promo materials as per brief.\nMaintain close working relationships with producers and production teams to ensure optimal delivery of generic and programme specific imaging.\nFacilitate and manage meetings with my production teams to go through creative briefs and generate creative concepts, angles and ideas for various show promos and Imaging.\nEngage with internal content contributors (News & CAFF, Sport and Commercial Enterprises) and go through various plans for the monthly content plans for imaging and promo alignment.\n \nREQUIREMENTS:\nNational Diploma (NQF Level 6) in Sound engineering or related discipline.\n4 years’ experience in Broadcasting environment of which 2 years should be on Radio production.\nProficiency in recording and editing software (i.e. pro tools, audacity, adobe etc).\nAbove average experience and knowledge of broadcasting production technology and digital media application.\nAbove average proficiency of the English language (spoken and written) is essential.\nAbility and willingness to work under pressure and on short notice\nGood research skills and ability to apply research information\nKnowledge of popular music, and current affairs will be an advantage.\n \nPLEASE APPLY HERE",
                "MANAGER: COMMERCIAL SERVICES (LEGAL)\nREPORT LINE: HEAD: LEGAL SERVICES \nDIVISION: LEGAL GOVERNANCE AND REGULATORY\nSCALE CODE: 130\nPOSITION ID: 60017526\n \nCLOSING DATE: 09 OCTOBER 2024\n \nReporting to the Head: Legal Services the incumbent is to provide an effective and efficient legal support through the drafting and vetting of Commercial Contracts consistently with the Commercial Services Strategy, including the provision of sound legal advice and support operations to maximise return on investment and ensure business growth.\n \nKEY ACCOUNTABILITIES\n \nDEVELOP AND IMPLEMENT STRATEGY\nAdapt organisational objectives into workable goals for the business unit\nResponsible for the implementation of predetermined objectives related to the drafting of Contracts\nContribute to the development of Commercial Services Strategy\nEstablishing best practices and performance standards for Commercial Services and ensuring implementation thereof\n \nBUSINESS OPERATIONAL EFFICIENCY\nManagement of the Commercial Legal Services team to ensure effective legal service and support throughout the Organisation\nDevelop and review legal documents and standardise templates and contracts for compliance with legal obligations and governance\nQuality assure the legal products of Legal Advisors\nConduct ongoing research, maintaining current knowledge of changes in legal frameworks and developments in the industry regarding Legal aspects\nSupport functional areas of the business by proactively identifying legal risks/issues that could arise and providing of commercial legal advice\nRepresents the Legal department in negotiations with third parties\nManage the more complex negotiations, contract agreements, etc.\nConduct due diligence investigations and provide related legal advice\nMonitoring all commercial legal work performed within the SABC to ensure adherence to set standards\nEnsuring requisite performance and compliance standards in the negotiation, structuring, drafting and/or vetting of non-standard agreements\n \nRISK AND GOVERNANCE MANAGEMENT\nEnsure adherence to the Standard Operating Procedure for Commercial Services;\nManagement of risk related to Commercial Services;\nEnsure adherence to and observance of governance processes related to the drafting and vetting of Commercial Contracts;\nEffectively dealing with regulatory matters relative to the\nCo-operation with Supply Chain Management to ensure Contracts are drafted to protect the interests of the SABC\nApplying, interpreting and advising on legislation to ensure proper corporate governance\n \nSTAKEHOLDER MANAGEMENT\nCo-ordinate, oversee and manage communications with all stakeholders in line with policy and ensure effective client engagement\nCompile high level reports on specific legal transactions and projects\nUnderstand customer needs and revise legal systems accordingly in order to satisfy needs and requirements\n \nLEADERSHIP AND PEOPLE MANAGEMENT\nResponsible for Performance Management in accordance with organizational policy and procedures.\nEnsure adequate staffing for workload, succession planning and effective leadership.\nEffective briefing and communication with departmental staff.\nManage the Personal Development Plans (PDP) for all staff members.\nProvide direction on the retention and attraction of staff.\n \nQUALIFICATIONS AND EXPERIENCE:\nA relevant degree (NQF 7) in law namely, BProc or LLB degree or equivalent\nCandidates with Master’s Degree and/or higher qualification will be preferred\nAdmission as an Attorney or Advocate with pupillage\n6 years’ post admission experience as Legal Advisor in private or public sector\n3 years’ Litigation Management experience\n2 years’ Management or supervisory experience\n \nKNOWLEDGE:\nPolicies and Procedures\nBusiness Environment\nDeal Structuring\nLegal Risk Management\nCorporate and Commercial legal principles\nAbility to juggle multiple deadlines in a fast paced environment\nStrong interpersonal, writing and communication skills\nAttention to detail\nStrong analytical and research skills\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p5b27fd27-2078-4afb-8253-2c447ed4c419"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/sassa.png?1728327377",
            "href": "https://www.govpage.co.za/south-african-social-security-agency-sassa-vacancies-blog/south-african-social-security-agency-sassa-vacancies8256158",
            "title": "SOUTH AFRICAN SOCIAL SECURITY AGENCY (SASSA) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN SOCIAL SECURITY AGENCY (SASSA)\n\nSASSA is a dynamic organisation that provides a range of essential services to a diverse group of South Africans. With offices countrywide, our operational structures aspire to embrace all that is state-of-the-art, offices that are modern and an environment designed to stimulate the worker to achieve, enjoy, progress and prosper. \n ",
                "GENERAL MANAGER: FINANCE (RE- ADVERTISEMENT)\nSalary: R 1,436,022–R 1,716,933 p.a. inclusive of benefits\nMpumalanga Regional Office – (Ref No.: SAS MP06/10/24-10)\nNature of Position: Permanent\n \nRequirements: Candidates should hold an undergraduate qualification at NQF Level 7 as recognized by SAQA in finance; Certificate for entry into the SMS (Senior Management Service) endorsed by the National School of Government; The requirements for application of Senior Management Services (SMS) include the successful completion of an SMS Pre-entry programme (Nyukela) as endorsed by the National School Government (NSG) before appointment; Computer literacy and a valid driver's license are essential and should be indicated on the CV.\n \nExperience: 5 years’ experience in Senior Management level in the various disciplines related to Financial Management.\n \nKnowledge and Skills: Knowledge of Public Finance Management Act (PFMA), Treasury Regulations on public entities and other relevant regulations; ERP knowledge on Oracle or SAP or AccPacc or accrual accounting compliant systems, functional / professional knowledge, planning & organizing, innovation / creativity, policy analysis and development, manage staff, project management, manage finance, strategic thinking and planning.\n \nKey performance: Area The incumbent will oversee and monitor the Regional Office’s budget; Oversee and manage the Regional Office’s financial accounting functions; Manage the Regional Office’s supply chain management services; Provide leadership in order to enhance the Unit performance and outputs of the Unit and Manage resources and matters pertaining to staff.\n \nApplication for the above positions at Mpumalanga Region must be sent to zaneleapplications@sassa.gov.za\nEnquiries: Ms Z Thabethe (013) 754 9337/ 9423\n \n \n \n \n \n \nSENIOR MANAGER: OPERATIONS MANAGEMENT (X2)\nSalary: R 1,216,824 – R 1,433,355 p.a. inclusive of benefits\nLocation: Gauteng Regional Office (Ref No: SAS GP06/10/2024-11)\nLocation: Limpopo Regional Office (Ref No: SAS LP06/10/2024-12)\nNature of Position: Permanent\n \nRequirements: Candidates should hold an undergraduate qualification (NQF level 7) as recognized by SAQA in the relevant field; Certificate for entry into the SMS (Senior Management Service) endorsed by the National School of Government; The requirements for application of Senior Management Services (SMS) include the successful completion of an SMS Pre-entry programme (Nyukela) as endorsed by the National School Government (NSG) before appointment; Computer literacy and a valid driver's license are essential and should be indicated on the CV.\n\n \nExperience: 5 years middle management level experience in the relevant field.\n \nKnowledge and Skills: Knowledge of SASSA's mandate, policies, legislation, Social Security, Poverty Alleviation; Understanding demographics of the province and social-economics realities experience.\n \nAdded Advantage: A post graduate qualification (NQF level 08) in the relevant field will be an added advantage.\n \nKey performance Area: To Manage, monitor, implement, integrate and operationalize SASSA programmes, projects and norms and standards; Manage, develop, monitor, implement and operationalize service delivery initiatives; Implementation of the grant value chain and grants administration processes within all districts and local offices; Provide leadership in order to enhance the Unit performance and outputs of the Unit; Manage resources and matters pertaining to staff and Ensure adherence to Section 57 (Responsibilities of other Officials) of the Public Finance Management Act (PMFA, Chapter 6, Part 3).\n \nApplication for Gauteng Regional Office must be sent to ApplicationsMas@sassa.gov.za\nEnquiries: Ms. P Mothapo on (011) 775 8055/Ms. Mashudu Malivha on 011 241 8563\n \nApplication for Limpopo Regional Office must be sent to ApplicationsLP@sassa.gov.za Enquiries: Ms Manyama ML Tel: 015 291 7411/ 7481",
                "Important notes: Applicants interested in applying for these posts must send their applications (Comprehensive CV and fully completed New Z83 form) quoting the relevant reference number and position name as per the advert. The subject heading of the email must indicate the reference number and name of the position you are applying for. Applicants must ensure that they send their application to a correct inbox/email indicated on each position. Applications send to the incorrect inbox/email will not be considered. Applications must consist of a comprehensive CV (specifying all experience, duties, indicating the respective dates (MM/YY) per position, driver’s license and computer literacy, Identity Number, Race and Gender as well as indicating references with full contact details. Interviews may be conducted via a virtual medium which will be discussed with each shortlisted applicant. Kindly note that copies of qualification, certificate, ID and driver’s license etc, must be submitted upon request. Failure to comply with the above requirements will results in your application been disqualified. All these positions are advertised with the minimum requirements. Appointments will be subjected to compulsory pre-employment screening in the form of qualification, reference, ITC, criminal checks and compulsory competency assessment (where applicable). Candidates will also be subjected to a process of assessments (where required). It is the applicant’s responsibility to have foreign qualifications evaluated by South African Qualifications Authority (SAQA) prior to the selection process and an evaluation report must be attached. The requirements for application of Senior Management Services (SMS) include the successful completion of an SMS Pre-entry programme (Nyukela) as endorsed by the National School Government (NSG) before appointment for all SMS positions. The cost for Nyukela is at the applicant’s own expense. The course is available at the NSG under the name Certificate for entry into SMS and the full details can be obtained by following the below link: https://www.thensg.gov.za/training-course/sms-pre-entryprogramme/. SASSA is under no obligation to fill a post after the advertisement thereof. Please note: All SASSA staff are subjected to compulsory security vetting on appointment. Correspondence will be limited to shortlisted candidates only, should you not be contacted within 3 months after the closing date please consider your application as unsuccessful.\n \nThe Agency is an equal opportunity employer. Therefore, Preference will be given to candidates whose appointment will assist the Agency in achieving its Employment Equity targets in terms of the Agency’s Employment Equity Plan. Person with Disabilities are strongly encouraged to apply\n \nClosing Date: 28 October 2024\n \nIf you have not been contacted within 3 months after the closing date of the advertisement, please accept that your application has been unsuccessful.\n \nVisit us at www.sassa.gov.za or toll free: 0800 60 10 11."
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p561c6fd2-b800-4653-832b-c1e7f7e81c8f"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/transnet_orig.jpeg",
            "href": "https://www.govpage.co.za/transnet-vacancies-blog/transnet-vacancies8133727",
            "title": "TRANSNET VACANCIES",
            "content": [
                " \nTRANSNET\n ",
                "BUSINESS ANALYST\nOperating Division: Transnet Corporate Centre\nEmployee Group: Permanent\nDepartment: ICT, Mobility Services, GRP\nLocation: Johannesburg\nReporting To: Executive Manager\nGrade: F\nReference: req2278\n \nThe closing date is on 14/10/2024. It is the responsibility of the applicant to ensure that HR has received the application before the closing date of the advertisement.\n \nPosition Purpose\nConduct business requirement analysis project in Operational Divisions to detect critical process deficiencies and to recommend solutions to improve the use of information technology, supporting business information requirements.\nPlan and execute the development, maintenance and on-going refinement of the enterprise-wide Business architecture, accommodating the complexities of Transnet business Interact with Operational Division stakeholders to develop Business solutions to meet business needs.\n \nPosition Outputs\n• Conduct analysis of current business environments to identify critical deficiencies and to develop solutions for the improved use of information technology, to support the business’s information requirements using the following techniques: • Workshops • Method/work studies • Six sigma • Lean principles • Simulation models • ARIS and Visio etc.\n1. Conduct business requirements analysis by engaging with the respective business stakeholders from all Operational Divisions 2. Map end-to-end business process flows on ARIS and Visio 3. Define business information flows and landscapes 4. Analyse information sources, purpose, information consolidation and manipulation, identify data or information shortcomings or deficiencies to gain understanding of where and how information is being used, consolidated and manipulated.\n5. Conduct gap analysis to identify deficiencies or problems in the data and information to enable effective solutions to the identified deficiencies. 6. Identify and analyse business drivers and business change drivers to determine business information solutions, information technology requirements and to develop Business architecture requirements.\n7. Develop rigorous models for how the data is to be structured and used to ensure that transaction processing is efficient and effective and that information to support decision-making is readily available. Ensure that these information models are flexible enough to easily adjust to meet changing business needs.\n8. Engage with business project owners to ensure projects fit enterprise information architecture and to determine the necessity of modifications to the application, to accommodate new information requirements or vice versa 9. Define the ways in which data and information are to be used and produced in the organisation, ensuring that information governance and architecture policy and structures are not compromised\n \nQualifications and Experience\n• A 4 year Industrial Engineering degree is a pre-requisite. • 8 years’ experience in Business process improvement projects in Operational and/or Operational Support business environments\n \nCompetencies\nInspirational Leadership Inspiring people: Leads by example. Inspires, motivates and empowers team members to do their best. Business Performance and Delivery Lead business performance: Leads the business to be more efficient and effective Corporate Governance and Compliance Leading governance: Always work in the best interest of the organisation and aligns business practices to the ethical obligations and good corporate governance\n \nEquity Statement\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation/Operating Division.\n \nAPPLY NOW",
                "SNR MANAGER: PROGRAMME MANAGEMENT\nOperating Division: Transnet Corporate Centre\nEmployee Group: Permanent\nDepartment: ICT, End User Computing Services, GRP\nLocation: Johannesburg\nReporting To: GM: Enterprise Technology & PMO Services\nGrade: D\nReference: req2277\n \nThe closing date is on 11/10/2024. It is the responsibility of the applicant to ensure that HR has received the application before the closing date of the advertisement.\n \nPosition Purpose\nThe Programme Manager is responsible for driving programme lifecycle Management within\nthe ICT. Programme Manager is responsible for planning and executing identified\nprogrammes. Programme Manager is responsible for programme alignment to the BRM\n(Benefits realisation management) process.\nProgramme Manager is also responsible for compliance to governance assurance. The Programme Manager will develop, scope and align the programme roadmap to the GICT and Transnet strategy, thereby reducing cost and increasing implementation value add.\n \nPosition Outputs\n1. Develop, prioritise, coordinate, and communicate the portfolio strategy, objectives, goals and processes necessary for implementing the portfolio. 2. Collaborate with teams and stakeholders during project initiation, execution and closure phases providing both checks and guidance with the aim of ensuring smooth delivery. 3. Provide a central point of escalation for major issues as well as supplying / analysing key data and metrics to the central EPMO unit ensuring all key stakeholders interests are reflected and maintained.\n\n4. Ensure effective and efficient project management in the ambit of ICT portfolio. This includes: • Planning, reporting, monitoring and control • Monitoring of overall portfolio as well as project budgets and benefits realisation • Portfolio performance dashboards • Project simulations • Project visibility and control • Portfolio Business change impact\n• Portfolio Business change impact • Advising on structure, composition and delivery models of projects. • Resource Supply and Demand • Proactively and continuously analyse the business risks inherent within the portfolio • Take active ownership in driving the resolution of intra-portfolio risks, issues and dependencies impacting delivery. • Investment management • Ensure during the Origination / definition of business case, that benefits have been sufficiently defined. • Continuous refinement of practices and processes within the Transnet EPMO.\n• Review and provide challenge to project as well as procurement documentation. • Monitoring governance application throughout the project/programme delivery process in accordance with agreed EPMO standards. • Best practice trade sector research, innovation and improvement on existing initiatives in collaboration with Operating Divisions.\n5. Develop and manage the relationship between ICT and other stakeholders (e.g., internal customers, internal strategic portfolio management team), with the goal of defining, planning, building, and assessing the ICT investment portfolio. 6. Responsible for maintaining 3rd party relationships with the vendors for project-related/ delivery issues 7. Proactively provide and collaborate with the Business Architecture division and Origination Team on information concerning specific business opportunities for organisational Process Management, Business Intelligence and Organisational Performance Management, where technology can enhance the value of the business. Proactively identify opportunities not anticipated or requested by the business that will provide a competitive advantage.\n8. Evaluate and assess risk as part of the life-cycle analysis of portfolio components. 9. Use reporting tools to monitor portfolio activities and regularly brief senior ICT, business management and relevant forums on portfolio performance. Proactively identify and present opportunities to Senior ICT and business management for applying developments in technology to the challenges faced by the business.\n10. Provide leadership and effective management to the business development organisation for portfolio related investments. Communicate the infrastructure requirements and resources necessary to execute the ICT portfolio. Ensure Change management activities to support process or technology changes are executed.\n11. Interface with Business Architecture to assist in ensuring timely and effective communication regarding mapping of ICT initiatives to business goals of the ICT organisation and internal customers, including presenting complex information to senior ICT and business management, outlining the specifics within the portfolio with regards to organisational Process Management, Business Intelligence and Organisational Performance Management.\n12. Build relationships and act as primary liaison between the ICT group, lines of business, and other stakeholders during project execution. Work with the ICT organisation and other stakeholders to execute the ICT and business portfolio 13. Maintain an understanding of enterprise business initiatives and objectives, and current trends and developments in the technology field with regards to portfolio management 14. Select a strategic ICT sourcing model in conjunction with the Group Supply Chain Management strategy and objectives.\n \nQualifications and Experience\nq B.A degree or related business degree is required with Prince 2 Practitioner Qualification or PMBOK qualification q 8 – 10 years experience in support services which includes Human Resources and Compliance Management. q 5-8 years Project Management experience q 3-5 Years Programme Management experience q Proven experience in identifying and managing the risks, issues and dependencies related to large, complex programmes. q Experience of managing an EPMO/ Programme function for a major programme of change activity. q Programme / project management: methodologies and processes and knowledge of industry standards, best practices. Matrix management. Skills Required: q Solid project management and financial analysis skills q Exceptional interpersonal skills, including teamwork, facilitation, and negotiation. q Strong leadership skills. q Excellent analytical and project management skills. q Excellent written and verbal communications skills. q Excellent planning and organizational skills. q Ability to balance the long-term (“big picture”) and short-term implications of individual decisions. q Ability to translate business needs into enterprise requirements. q Ability to analyse risk and the financial impact on the enterprise. q Ability to apply multiple solutions to business problems.\n \nCompetencies\nKnowledge: q Sound knowledge of portfolio management q Familiarity with basic information management practices. qBasic knowledge of financial models and budgeting. q Understanding of the political climate of the enterprise and how to navigate the politics. Competencies Required: Anchoring the Transnet Way • Is a conceptual and analytical thinker • Is results focused Is courageous • Is resilient • Is emotionally intelligent • Is an excellent communicator Leading the Transnet Way • Is visionary and inspiring • Is strategic • Is collaborative • Is innovative and entrepreneurial • Has impact and influence • Is a change agent Managing the Transnet Way • Optimises business performance • Manages finances • Manages people & teams • Delights customers • Manages programs, projects & contracts • Manages risk and compliance Sustaining the Transnet Way • Empowers and develops others • Is inquisitive and develops self • Manages and shares information • Role models the culture and values • Embraces diversity • Has the right skills\n \nEquity Statement\nPreference will be given to suitably qualified Applicants who are members of the designated groups in line with the Employment Equity Plan and Targets of the Organisation/Operating Division.\n \nAPPLY NOW"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "p723d012d-0922-4e47-8873-070dcce2fa71"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/joshco_orig.jpg",
            "href": "https://www.govpage.co.za/johannesburg-social-housing-company-joshco-vacancies-blog/johannesburg-social-housing-company-joshco-vacancies1467633",
            "title": "JOHANNESBURG SOCIAL HOUSING COMPANY - JOSHCO VACANCIES",
            "content": [
                " \nJOHANNESBURG SOCIAL HOUSING COMPANY - JOSHCO\n61 Juta Street, Braamfontein, 2094\nPO Box 16021, New Doornfontein, 2028\nTel 0861  JOSHCO - Tel +27 (0) 11 406 7300 - Fax +27 (0) 11 404 3001\nE-mail: info@joshco.co.za\nwww.joshco.co.za\n ",
                "INTERNAL AND EXTERNAL RE-ADVERTISEMENT\n \nThe Johannesburg Social Housing Company SOC Limited (JOSHCO) mandate is to develop and manage affordable rental housing for the lower market as an integral part of efforts to eradicate the housing backlog of the City of Johannesburg. JOSHCO is a registered Social Housing Institution and is accredited by the Social Housing Regulatory Authority (SHRA).\n \nWe invite suitably qualified and experienced persons to apply for the following vacant position.\n \nCHIEF OPERATIONS OFFICER\nEmployment Status : Permanent\nDepartment : Office of the Chief Executive Officer\n \nPurpose of the Job: Reporting to the Chief Executive Officer (CEO), the Chief Operating Officer will be responsible for providing internal leadership to support management, provide a platform for internal collaboration, alignment and organizational capacity-building for housing development, housing management, information, and communication technology (ICT) and stakeholder management functions.\nFurthermore, the role will provide leadership for the design, development, and implementation of the next generation of innovative, flexible, strategic, and values-aligned operational systems to position social housing before the challenges and opportunities of a rapidly evolving social housing rental landscape whilst ensuring that the company complies with all MFMA, Company’s act, Public Accounts Audit Act, SHRA requirements and any other legislative provisions that governs the function of a municipality entity.\n \nRESPONSIBILITIES (BUT NOT LIMITED TO THE FOLLOWING):\n1. Strategic Management:\n• Develop the Housing Development, Housing Management, ICT and Stakeholder Management Strategies.\n• Provide input to advance the organization from a strategic perspective.\n• Develop and translate the strategic plan into the Housing Development, Housing Management, ICT and Stakeholder operational plan\n2 Budgeting\n• Develop Housing Development budget in line with Capex and Operational plan\n• Monitoring and Report on financial performance Housing Development expenditure against the budget\n• Prepare financial feasibility assessment and financial modelling for viability purposes\n• Oversee the application for funding for grants\n3 Property Development & Construction Management\n• Develop an Annual Construction and Property/ Project’s Management Plan\n• Provide technical oversight of the construction of the projects in terms of time, budget and quality\n• Review reports and provide troubleshooting to projects with challenges\n• Oversee the handover and maintenance liability period of the project/s\n4 Housing Management\n• Ensure stock identification and selection include: Tenant audits, stock condition audits, asset status e.g. legal and feasibility studies are conducted\n• Ensure all projects are appropriately packaged including project implementation plans and project budgets for approval by the board\n• Ensure contractual closure for take on of stock by means of Service Level Agreement with e.g. CoJ\n• Oversee tender / bid / proposal process for suppliers\n• Oversee Supplier / Services contract management\n5 Rental Management and Lease Administration\n• Manage the rental of stock including:\nSetting and implementing of appropriate rentals in consultation with finance and the office of the CEO\nManagement of vacancies\nManagement of arrears in the buildings\nImplementation of appropriate arrears management procedures\nSupporting staff to implement the required operational actions to facilitate all activities around rental management\n• Supervise the application of the company’s standard operating procedure (sop) applicable to new tenants.\n• Manage implementation of standards for selecting and recruiting tenants\n• Supervise the maintenance of the tenant database with regard to the number and details of tenant and occupation certificates.\n• Manage the rental subsidy application process\n• Plan and implement marketing actions to ensure that tenancy of units meets budgeted targets\n• Ensure correct take on of new projects/buildings onto the property management database\n6 Building Management\n• Manage the overall financial sustainability of buildings including:\nAchievement of building ROI\nAchievement of targeted occupancy rates\nAchievement of targeted arrears rates\nEnsuring targeted budgets for buildings achieved and the HSVs are able to manage against budget\nMonitoring and reporting on building variances against budget\n• Manage the appointment of service providers for the provision of non-core services in the buildings\n• Facilitate the development and implementation of service level agreements for contract service providers\n• Monitor the performance of service providers in line with the service level agreements and implement the contracts as agreed\n• Manage building maintenance\n• Ensure safety and security measures are in place in all buildings\n• Monitor usage of utilities against budgets\n• Compile monthly report from the reports of various service providers, HSVs, finance etc.\n• Manage social climates in all buildings\n7 ICT Management\n• Define the direction the ICT Division will take to deliver business value to JOSHCO.\n• Take a Strategic Objective to use Information and Communications Technology to enable and support JOSHCO key strategic initiatives and to delivery of a ICT Platform for JOSHCO\n• Provide a statement of strategic direction for ICT within JOSHCO, to obtain agreement from Executive Management to the strategy and acquire the stamp of approval from the Board of Directors for the strategic imperatives\n8 Project Management\n• Monitor delivery of projects to ensure that they achieve original objectives and also tracking and auditing of contract terms such as:\npricing and discounts;\ntimeliness of payments and or receipts;\nPerformance in delivering agreed service level or specification of goods and services; and amendments.\n• Manage accurate and comprehensive documentation including funder, consultant and contractor agreements\n• Create and lead implementation of systems and policies for quality assurance.\n• Development of project finance management tool.\n• Development of a project tracking tool.\n• Conduct ongoing contract management training\n9 People Management\n• Qualified and Competent people are appointed to all vacant positions in the operations department\n• KPA’s of team members are understood and achieved\n• The values of JOSHCO are understood and lived\n• Performance is constantly improved\n• New industry trends are identified are understood and embraced\n10 Stakeholder Management\n• Maintain excellent relations with all stakeholders including funders/financiers, contractors and regulators\n• Negotiate and build fruitful formal and informal partnerships to achieve strategic objectives\n• Create and sustain strategic and productive relationships with key stakeholders\n• Create and maintain professional networks to maintain relations\n• Maintain a productive relationship with suppliers, contractors, and purchasers.\n• Attends and actively contributes to relevant industry-related meetings.\n• Actively contributes to staff meetings and development activities as required.\n11. Risk and Compliance Management\n• Identifies and manages projects risk including escalating high risks to Senior Manager: Business\nPlanning and Risk and CEO.\n• Conduct regular risk assessment and develop risk management plans to mitigate against high-risk events.\n• Create, contribute, and manages implementation of quality assurance systems and processes.\n• Analyze, develop, and implement appropriate risk management strategies.\n• Monitor, manage and ensure compliance with the Construction Safety requirements on sites\n• Report on risk management\n• Oversee the construction progress, productivity and compliance with building and safety codes.\n \nMINIMUM EDUCATIONAL QUALIFICATIONS\n• Minimum Honours degree equivalent in the built environment, Operations, Law or Commerce.\n• A Master’s degree in the Built Environment, or Legal (Commercial/Property Law) or Operations Management will be an added advantage.\n• A Certificate in Municipal Finance or Public finance certification with the ability to acquire within the first 18 months of employment.\n \nSKILLS, KNOWLEDGE, AND EXPERIENCE REQUIRED\n• 5 to 10 years management experience in operations or general management in a government entity, government department or private sector organization.\n• Experience in implementing digitization and information technology programmes is an advantage\n• Extensive knowledge of local management leadership and management at a metropolitan level.\n• Knowledge of the MFMA Treasury Regulations, SHRA, Integrated Development Plan (IDP), KING IV and the Companies Act.\n• Knowledge of all relevant legislation, policies and procedures relating to local government, human settlements, affordable housing and social housing development.\n• Knowledge and understanding of communications and stakeholder management requirements and processes; and must be able to: monitor & evaluate the organizational performance level, ensure compliance with all statutory & regulatory requirements, use performance information to plan, and give effect to the organization’s strategy.\n \nOTHER COMPETENCIES:\n• GENERAL MANAGEMENT SKILLS:\nStrategic Planning, Strategic Management, Strategic Leadership, Communication, Facilitation, Conflict Management, Relationship Management, Project Management, General Management skills, Knowledge of policy and procedure development and implementation, Data Analysis skills, Budgeting and Budget Management skills, Problem-solving skills\n• TECHNICAL KNOWLEDGE AND SKILLS\nSocial Housing Sector Knowledge, Social Housing Sector Legislation, Market Surveys, Contracts, Safety and Security Standards (Basic), Eviction Management, Maintenance Planning & Rent Price Setting\n• ATTRIBUTES\nEmotional intelligence leadership, Assertiveness, Interpersonal skills, Adaptability and flexibility, Situational sensitivity.\n \n \nApplication Procedure:\nPlease take note that only online applications will be considered. Please apply by using the following link below, by either copying the link onto browser or click on the link. Failure to apply using the correct link, will result to any application not considered.\n\n \nhttps://share-eu1.hsforms.com/1i8v-dyv8RJyh-y885vHcXAew554\n \nJOSHCO is an equal opportunity and affirmative action employer, and all appointments will be made in accordance with the Company’s Employment Equity Plan to promote its representivity (race, gender, and disability). Correspondence will only be limited to shortlisted candidates and applicants who have not been contacted within 6 weeks should consider their applications unsuccessful. JOSHCO reserves the right not to make an appointment.\n \nThe Closing date for applications is 24 October 2024 at 16:00 any application received after the closing date will not be considered.",
                "INTERNAL AND EXTERNAL RE-ADVERTISEMENT\n \nThe Johannesburg Social Housing Company SOC Limited (JOSHCO) mandate is to develop and manage affordable rental housing for the lower market as an integral part of efforts to eradicate the housing backlog of the City of Johannesburg. JOSHCO is a registered Social Housing Institution and is accredited by the Social Housing Regulatory Authority (SHRA).\n \nJOSHCO invites suitably qualified and experienced persons to apply for the following vacant position.\n \nCHIEF FINANCIAL OFFICER\nEmployment Status : Permanent\nDepartment : Office of the Chief Executive Officer\n \nPurpose of the Job: This position is responsible to provide strategic and oversight support to the CEO, as Accounting Officer of JOSHCO in the key areas of financial and budgetary management, supply chain and asset management in relation to development of financial management strategies, policies, and systems to ensure a sound and financial stable company.\n \nKey Responsibilities:\nStrategic Management\n• Determine the strategic direction of the financial management function, including revenue, in the overall strategy of the organization.\n• Assess organisational performance against both the annual budget and company’s long-term strategy.\n• Support the Accounting Officer of the organization and the Board in terms of the Municipal Finance Management Act in fulfilling their financial responsibility.\n• Engage the board finance, audit and investment committees around issues, trends and changes in the operating model(s) and operational delivery.\n• Assist in establishing yearly objectives and meeting agendas, and selecting and engaging outside consultants (auditors, investment advisors).\n• Oversee long-term budgetary planning and costs management in alignment with JOSHCO’s strategic plan.\n• Conduct and coordinate Medium-term Expenditure Framework (MTEF) processes, s well as corporate governance.\nFinancial Planning and Analysis\n• Prepare and maintain regular financial planning reports; monthly profit and loss forecast by division (vs. budget).\n• Complete analysis of financial results; Develop recommendations (strategic and tactical).\n• Develop and maintain capital budget (with key inputs from Strategy & Programmes).\n• Assist in development of financial planning and analysis exercises/reports.\nRisk Management\n• Identify financial risks and implement appropriate risk management strategies for the business.\n• Ensure that the JOSHCO is adequately insured and report on risk management.\n• Implement appropriate risk management strategies in finance department.\n• Report on risk management.\nBudgeting and Forecasting\n• Development the medium-term budget that meets the financial strategy of the organisation.\n• Ensure that the budgetary process meets legislative requirements.\n• Present budget for board approval.\n• Coordinate and oversee the development and monitoring of overall organisational capital and operating budgets.\nRevenue Management & Enhancement\n• Identify possible sources of funding;\n• Provide an integrated billing system;\n• Ensuring effective revenue collection and management.\nFinancial Management\n• Oversee the management of internal and external audits, inclusive of stakeholder engagement and resolution of audit findings.\n• Monitor financial performance through tracking performance of agreed financial indicators.\n• Oversee the management of internal and external audits, inclusive of stakeholder engagement and resolution of audit findings.\n• Reconcile rent roll schedule from service provider, capture on the system.\n• Ensure legislative compliance for payment of government duties.\n• Ensure that all audit queries are resolved.\n• Ensure proper preparation for annual audit.\n• Oversee the approval and processing of revenue, department budgets, maintenance of accounts and ledgers, ensuring compliance with relevant legislation.\n• Oversee the preparation of standard and ad hoc financial reports required for responsible fiscal management, including budget analysis, cash flows and forecasts.\n• Develop and ensure implementation of initiatives to increase revenue collection.\n• Ensure appropriate Supply Chain Management Systems which are fair, equitable, transparent, competitive and cost effective.\n \nMinimum job requirements, interested applicants must be in possession of:\n• A Valid Grade 12 certificate.\n• Minimum B Compt (Hons)/B Com Accounting (Hons) or equivalent.\n• Professional certification as a Chartered Accountant with the South African Institute of Chartered Accountants.\n• Minimum 7 - 10 years in financial accounting or a related field, of which 5 years should be in management.\n• Master’s in business administration or leadership (MBA or MBL) will be advantageous.\n• Certificate in Municipal Finance Management or Certificate Program in Municipal or the ability to acquire it within the first 18 months of employment.\n• Development (CPMD) in line with Minimum regulations on competency level of 2007 will be advantageous.\n• Previous experience in managing a Finance Department is essential.\n \nSkills and competencies- The ideal applicant must possess the following skills and competencies:\nGeneric skills: Planning, Leadership, Communication, Facilitation, Conflict Management, Ethical, General Management Skills, Financial Data Analysis skills, Budgeting and Budget skills and Problem- Solving skills.\nTechnical Knowledge and Skills: Asset Management, Default Management (Complex), Development, repayment policies (Complex), Lease agreements (Complex), Contracts Management (Complex), Housing Sector Legislation (Complex), Rent Price Setting, Municipal Finance Management Act, Supply Chain management, Income Tax Act\nAttributes: Emotional Intelligence, Interpersonal Skills, Assertiveness, Attention to detail, Adaptability, Flexibility, Situational Sensitivity.\n \nApplication Procedure:\nPlease take note that only online applications will be considered. Please apply by using the following link by either copying the link onto browser or click on the link. Failure to apply using the correct link will result to an application not considered.\n \nhttps://share-eu1.hsforms.com/12idWlZ0kQuKnbu7YN8jFZgew554\n \nJOSHCO is an equal opportunity and affirmative action employer, and all appointments will be made in accordance with the Company’s Employment Equity Plan to promote its representivity (race, gender, and disability). Correspondence will only be limited to shortlisted candidates and applicants who have not been contacted within 6 weeks should consider their applications unsuccessful. JOSHCO reserves the right not to make an appointment.\n \nThe Closing date for applications is 24 October 2024 at 16:00 any application received after the closing date will not be considered.\n \n \nExecutive Directors: Ms. Nokwazi Mtshali (Acting CEO & ED), Ms. Nontobeko Ndimande (CFO & ED), Mr. Theodore Dhlamini (Chairperson & NED), Ms. Madonna Rangaka (Company Secretary), Ms. Thandeka Tshabalala (NED), Mr. Musa Shibambo (NED), Dr. Thulani Mdadane, (NED), Ms. Tabisa Poswa (NED), Mr. Zamikhaya Xalisa (NED), Mr. Albert Baloyi (NED), Mr. Lawrance Ndlovu (NED), Mr. Ntokozo Mjiyako (NED) Ms. Bayiphiwe Simelane (NED), Mr. Jason Sobekwa (NED), Registration Number: 2003/008063/30"
            ],
            "postedDate": "7/10/2024",
            "iframe": "",
            "uuid": "pc867e995-04d3-4036-8dd7-78cc511d9fbe"
        }
    ],
    "departments": {
        "south african revenue services (sars) vacancies": "https://www.govpage.co.za/south-african-revenue-services-sars-vacancies-blog/south-african-revenue-services-sars-vacancies3613978",
        "commission for conciliation, mediation and arbitration (ccma) vacancies": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies5893514",
        "eskom vacancies": "https://www.govpage.co.za/eskom-vacancies-blog/eskom-vacancies3598072",
        "housing development agency (hda) vacancies": "https://www.govpage.co.za/housing-development-agency-hda-vacancies-blog/housing-development-agency-hda-vacancies3372423",
        "human science research council (hsrc) vacancies": "https://www.govpage.co.za/human-science-research-council-hsrc-vacancies-blog/human-science-research-council-hsrc-vacancies8118939",
        "industrial development corporation (idc) vacancies": "https://www.govpage.co.za/industrial-development-corporation-idc-vacancies-blog/industrial-development-corporation-idc-vacancies8552547",
        "legal aid vacancies": "https://www.govpage.co.za/legal-aid-vacancies-blog/legal-aid-vacancies7275915",
        "mintek vacancies": "https://www.govpage.co.za/mintek-vacancies-blog/mintek-vacancies1115078",
        "national empowerment fund (nef) vacancies": "https://www.govpage.co.za/national-empowerment-fund-nef-vacancies-blog/national-empowerment-fund-nef-vacancies1722424",
        "national gambling board of south africa (ngb) vacancies": "https://www.govpage.co.za/national-gambling-board-of-south-africa-ngb-vacancies-blog/national-gambling-board-of-south-africa-ngb-vacancies8692436",
        "national home builders registration council (nhbrc) vacancies": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies7321646",
        "road accident fund (raf) vacancies": "https://www.govpage.co.za/road-accident-fund-raf-vacancies-blog/road-accident-fund-raf-vacancies8918443",
        "south african broadcasting corporation (sabc) vacancies": "https://www.govpage.co.za/south-african-broadcasting-corporation-sabc-vacancies-blog/south-african-broadcasting-corporation-sabc-vacancies7653123",
        "south african social security agency (sassa) vacancies": "https://www.govpage.co.za/south-african-social-security-agency-sassa-vacancies-blog/south-african-social-security-agency-sassa-vacancies8256158",
        "transnet vacancies": "https://www.govpage.co.za/transnet-vacancies-blog/transnet-vacancies8133727",
        "johannesburg social housing company - joshco vacancies": "https://www.govpage.co.za/johannesburg-social-housing-company-joshco-vacancies-blog/johannesburg-social-housing-company-joshco-vacancies1467633"
    }
}