{
    "title": "govpage-public-sector",
    "blogPosts": [
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/north-west-office-of-the-premier_orig.png",
            "href": "https://www.govpage.co.za/north-west-office-of-the-premier-vacancies-blog/north-west-office-of-the-premier-vacancies1158580",
            "title": "NORTH WEST OFFICE OF THE PREMIER VACANCIES",
            "content": [
                " \nNORTH WEST OFFICE OF THE PREMIER\n2nd Floor, Ga-Rona, Building, Private Bag X129, MMABATHO\n \nHUMAN RESOURCES MANAGEMENT\n \nAPPLICATIONS: Applications must be submitted online, or hand delivered at the Directorate of Human Resource Management, Second Floor, Ga-rona Building, Mmabatho. All attachments for online must including the Z83 and CV only be in PDF format only as one document, indicated the correct job title and the reference number of the post on the subject line of your e-mail. Use the correct e-mail address associated with the post. Failure to do so, your application will be disqualified. \n \nCLOSING DATE: 04 OCTOBER 2024 \n ",
                " \n \nAll applications must indicate the correct reference number. The Office of the Premier is an equal employment opportunity and affirmative action employer, and it is committed to the achievement and maintenance of diversity and equity in employment, especially in respect of race, gender and disability. In terms of the employment equity plan for the Office, preference will be given to People with Disabilities, Youth, and Females for these posts. Applications must be accompanied by fully completed New Z83 form (81/971431) obtainable from any Public Service Department. Sections A, B, C and D are compulsory; Sections E, F and G do not need to be completed if a detailed CV providing the required information is attached. However, the question related to conditions that prevent re-appointment under Part F is compulsory. Applicants are not required to submit copies of qualifications and other relevant documents on application but must submit ONLY Z83 and detailed Curriculum Vitae clearly indicating positions held, period in the position and key responsibilities with three contactable referees. The communication from the HR department regarding the requirements for certified documents will be limited to shortlisted candidates. Therefore, only shortlisted candidates for the post will be required to submit certified documents on or before the day of the interview following communication from HR. Failure to submit the requested documents will result in your application not being considered. Shortlisted candidates will be subjected to practical exercise and integrity assessment. Incomplete Z83, Late and faxed applications will not be considered. Communication will be limited to shortlisted candidates only. The successful candidates for the advertised positions will be required to undergo personnel suitability checks, which includes criminal records, citizenship, financial checks, qualifications, and previous employment (Reference checks). It is the responsibility of the applicant to make sure that the South African Qualifications Authority evaluates foreign qualifications, and the evaluation certificate will be required on or before the day of the interview following communication from HR. If you do not hear from the Office, three months from the date of the advertisement consider your application unsuccessful. Shortlisted candidates for senior management posts will be subjected to a technical assessment and the selected interviewed candidates will be subjected to two-day competency assessments. SMS posts in the Public Service no appointment shall be affected without the recommended candidate producing a Certificate of completion for the Nyukela Programme (SMS Pre-Entry Programme) offered by the National School of Government which can be accessed via this link: https://www.thensg.gov.za.  \n \n \n ",
                " \n \n \n \n \nCHIEF DIRECTOR: GOVERNMENT INFORMATION TECHNOLOGY OFFICER\nSalary : R1 436 022.00 per annum (all-inclusive package Level 14) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/11 \n \nJob Purpose: To manage provincial government information technology services in the three spheres of government in the NWPG \n \nRequirements: Three-year tertiary qualification in Information Technology at NQF level 7 and/ or equivalent qualifications (NQF level and credits), technical information technology qualifications will serve as an added advantage. Ten years extensive and vast experience in Information and Communication Technology of which 5 years must have been as Chief Information Officer and/ or Government Information Technology Officer. \n \nKnowledge, Skills and Competencies: Excellent knowledge of ICT systems and ICT infrastructure with a background in designing, developing and implementing IT systems. Must be able to show a solid understanding of data analysis, budgeting and business operations. Must be able to demonstrate excellent organizational and leadership skills. Strategic Capability and leadership; People Management and Empowerment; Programme and Project Management; Financial Management Change Management; Knowledge Management; Service delivery innovation (SDI), Problem Solving and Analysis; Client Orientation and Customer Focus; Communication. \n \nDuties: The management and development of Infrastructure solutions, server and network administration; Ensure the facilitation of the implementation of and adherence to the policies and strategies as contained in the different plans, policies, etc. Development of information and technology systems infrastructure architecture and conduct investigations into the maintenance of existing technologies, availability, needs and demand of new technologies. Rationalise unnecessary duplication and redundancy of information and technologies in the department. Ensure the promotion of common solutions for common requirements across the department. Ensure the Promotion of the utilisation of technology as a key enabler for the future in delivering information and Services and promote its use in the re-engineering / transformation of government service delivery. Oversee the provision of ICT customer relations services; Ensure the Change Management of the culture of the department to embrace an enterprise-wide information management and information technology approach. The visibility, strong and continuous support of senior managers responsible for ICT customer relations. Ensuring the development and training of the members in the department in relevant information technology matters. Oversee the provision and maintenance of information technology governance, planning and risk management; Oversee the implementation of corporate governance and management of enterprise architecture. Oversee the conducting of strategic and tactical (business) planning of the Information Technology unit. \n \nEnquiries: Mr. G.P Moholo, Tel: (018) 388 3752 \n \nE-Mail: ooprecruitment1@nwpg.gov.za\n \n \n \n \n \nDIRECTOR: YOUTH ENTERPRISE SERVICES\nSalary : R1 216 824.00 per annum (all-inclusive package Level 13) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/12 \n \nJob Purpose: To manage and oversee the coordination and mainstreaming of youth development programmes in the province \n \nRequirements: Three-year tertiary qualification in Public Management & Administration, Social Sciences and/or Development Studies at NQF level 7 and /or equivalent qualifications (NQF level and credits). Minimum of 5 years’ applicable experience in the relevant field of which 6 to 7 years should be at middle management. Driver’s Licence \n \nKnowledge, Skills and Competencies: Relevant government legislation, policies and strategic frameworks; PFMA, LRA and PSA. Strategic capability and leadership, Programme and Project Management, Financial Management, Change Management, Knowledge Management, Problem Solving and Analysis, People Management and Empowerment, Client Orientation and Customer Focus and Communication. \n \nDuties: Duties: Coordinate the development of and monitoring the implementation of Provincial Youth Action Plan in line with the Provincial & National Priorities. Promote the mainstreaming of youth development in government programmes. Establishment and maintenance of partnerships with relevant stakeholders. Monitor the sector specific youth catalytic programmes and projects. Management of the Directorate’s resources. \n \nEnquiries: MS. C.N Modise Tel: 018 388 1596 \n \nE-Mail: ooprecruitment2@nwpg.gov.za\n \n \n \n \n \nDIRECTOR: OLDER PERSONS AND PERSONS WITH DISABILITIES \nSalary : R1 216 824.00 per annum (all-inclusive package Level 13) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/13 \n \nJob Purpose: To manage and oversee the coordination and mainstreaming of Rights of Persons with Disabilities and of Older Persons in government programmes \n \nRequirements: Three-year tertiary qualification in Public Management & Administration, Social Sciences and/or Development Studies at NQF level 7 and /or equivalent qualifications (NQF level and credits). Minimum of 5 years’ applicable experience in the relevant field of which 6 to 7 years should be at middle management. Driver’s Licence \n \nKnowledge, Skills and Competencies: Relevant government legislation, policies, strategic frameworks including the relevant international and regional instruments, agreement and protocols; PFMA, LRA and PSA. Strategic capability and leadership, Programme and project management, financial management, Change management, Knowledge management, Problem solving and analysis, People Management and Empowerment, Client orientation and customer focus and Communication \n \nDuties: The coordination and development of the Provincial Action Plans for Persons with Disabilities and Older Persons in line with the Provincial & National Priorities. The mainstreaming of the rights of persons with disabilities and of older persons in government programmes. The Provincial Performance Monitoring and Evaluation of the Provincial Action Plans for Persons with Disabilities and Older Persons. Programs for the Rights of Persons with Disabilities and Older persons. Establishment and maintenance of partnerships with relevant stakeholders. Establishment and maintenance of partnerships with relevant stakeholders. Monitor the sector specific catalytic programmes and projects to older persons and persons with disabilities. Management of the Directorate’s resources \n \nEnquiries: Ms. C.N Modise Tel: (018) 388 1596 \n \nE-Mail: ooprecruitment3@nwpg.gov.za\n \n \n \n \n \nDirector: E-Governance \nSalary : R1 216 824.00 per annum (all-inclusive package Level 13) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/14 \n \nJob Purpose: To provide and maintain IT Governance, Planning, Risk and Quality Management \n \nRequirements: An appropriate tertiary qualification in Information Technology / Systems / Computer Science or equivalent at an NQF level 7 (NQF level 7 as recognised by SAQA) and COBIT certification. 6-7 years’ experience in Governance Risk and Compliance of ICT of which 5 years must be middle management experience. \n \nKnowledge, Skills and Competencies: Knowledge of ICT Governance Frameworks such as CoBIT and Corporate Governance of the ICT Policy Framework (CGICTPF), Knowledge of Enterprise Architecture Frameworks such as Government Wide Enterprise Architecture (GWEA) and the Open Group Architecture Forum (TOGAF), Knowledge management, Service delivery innovation, Knowledge of economic and social development. Strategic capability and leadership, Programme and project management, financial management, change management, Problem solving and analysis, People Management and Empowerment, Client orientation and customer focus and Communication. \n \nDuties: Implement the corporate governance of ICT and management of the enterprise architecture. Maintenance and development of IT Frameworks, policies, procedures, and standards. Monitor and report on the implementation of CGICTPF to the program manager for the North Provincial departments, and report on the Level of IT Governance capability / maturity achieved. Develop and manage the NWPG Enterprise Architecture capability. Manage the Strategic and tactical (business) planning of the Information Technology Unit and review of the Provincial IT Plan. IT Quality Management and maintenance of process standards. Develop and report on the implementation of the Post Audit IT Action Plan to the Program Manager for monitoring. Develop, manage, and maintain the IT Risk Register. Manage the engagements with IT Supplier/Vendors to establish sound relations and to monitor performance. Monitor and review the SLAs with Departments and ensure that service level meetings are conducted. Overseeing the development, implementation, and maintenance of software solutions or systems (internally developed) including SharePoint environment for the provincial departments. Manage and provide business and system analysis services to the provincial departments. Manage the development of the business functional requirements, systems specifications, business cases and user requirement specifications. Manage all aspects of the departmental IT programmes and projects against the agreed baseline (time, cost, and quality). Managing the directorate’s resources efficiently, effectively, economically and in accordance with the relevant principles and policies. \n \nEnquiries: Mr. G.P Moholo, Tel: (018) 388 3752 \n \nE-Mail: ooprecruitment1@nwpg.gov.za\n \n \n \n \n ",
                " \n \n \n \n \nDIRECTOR: FORENSIC COORDINATION\nSalary : R1 216 824.00 per annum (all-inclusive package Level 13) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/15 \n \nPurpose: To strategically manage and conduct forensic coordination in the Office of the Premier \n \nRequirements: Three- year Diploma/Degree in Commerce/Law/Auditing/Forensics and/ or equivalent qualification (NQF level and Credits). 6-7 years’ experience of which five (5) years must be at middle management. \n \nKnowledge, Skills and Competencies: Knowledge of national, provincial and departmental legislation, policies and procedures. Extensive knowledge of fact-finding techniques and investigative procedures applicable to forensic Auditors/Investigators. Knowledge of fraud risk assessment and forensic audit planning techniques. Knowledge of South African Legal System. Knowledge of Inter-governmental relations. Knowledge of HR and administrative systems and processes. Knowledge of financial management prescripts and processes. Strategic capability and leadership, Programme and project management, financial management, Change management, Knowledge management, Problem solving and analysis, People Management and Empowerment, Client orientation and customer focus and Communication \n \nDuties: Manage forensic coordination strategies. Manage forensic services methodology. Marketing forensic services and role in Provincial strategic processes. Monitor case/project planning and execution. Manage the provision of reports and monitor progress in forensic coordination and performance and human resource management \n \nEnquiries: Enquiries: Mr. I Tselangoe Tel: (018) 388 4276 \n \nE-Mail: ooprecruitment5@nwpg.gov.za\n \n \n \n \n \nDirector: Performance Monitoring and Reporting \nSalary : R1 216 824.00 per annum (all-inclusive package Level 13) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/16 \n \nPurpose: To manage the Provincial Monitoring, reporting and Evaluation System \n \nRequirements: Three-year bachelor’s degree in public administration at NQF level 07 and/or equivalent qualification (NQF Level and credits). 6-7 years’ experience of which five (5) years must be at middle management within the monitoring, reporting and evaluation environment. Driver’s license \n \nKnowledge, Skills and Competencies: Knowledge of Government Legislation, Local Government prescripts, PFMA, LRA, PSA and PSR. Strategic capability and leadership skills; People Management and Empowerment skills; Programme and project management Skills; Financial Management skills; Change Management and Knowledge Management skills. Computer skills. \n \nDuties: Institutionalize performance monitoring in the province. Monitor performance reporting in the province. Monitor the implementation of infrastructure projects. Coordinate the implementation of Management Performance Assessment tool (MPAT) self-assessment and improvement. Develop and manage implementation of province wide monitoring and evaluation, frameworks, guidelines and policies, Develop M&E plan that translates PGDS/provincial priorities into measurable indicators and activities. Facilitate/coordinate reporting against provincial priorities, development indicators and Departmental and SOE APP’s, On-site verification and monitoring of interventions linked to priorities and Manage and coordinate Cluster Programs \n \nEnquiries: Mr. B.P Maboe Tel: (018) 388 4042 \n \nE-Mail: ooprecruitment6@nwpg.gov.za\n \n \n \n \n \nDIRECTOR: ICT INFRASTRUCTURE\nSalary : R1 216 824.00 per annum (all-inclusive package Level 13) \nCentre : Mmabatho \nRef No : NWP/OOP/2023/17 \n \nPurpose: To manage the development of infrastructure solutions, Server and Network \n \nRequirements: Three-year tertiary qualification at NQF level 07 and/or equivalent qualification (NQF Level and credits) with relevant technical certifications. 5-10 years’ experience of which five (5) years must be at middle management level. \n \nKnowledge, Skills and Competencies: Strategic capability and leadership; People Management and Empowerment; Programme and project management; Financial Management; Change Management; Knowledge Management. Information management practices; Understanding of development thinking and practice; Monitoring and Evaluation systems and practices; Statistical information Practices. Leadership and monitoring, advanced computer and analytical skills, report writing, communication and facilitation skills, Project management skills. Experience in monitoring of data and information, systems and records, information analysis skills, information and computer modelling, statistical information presentation. \n \nDuties: Management, administration and support of Provincial server environment. Management and support of Provincial Network Systems. The Administration of Information Technology Security. The management of maintenance of database and administration system. The administration of storage backup environment. \n \nEnquiries: Mr. G.P Moholo, Tel: (018) 388 3752 \n \nE-Mail: ooprecruitment1@nwpg.gov.za\n \n \n \n \n \nSENIOR STATE LAW ADVISOR (LP09 SPECIALIST LEGISLATION AND LITIGATION)\nSalary : R1 132 806 per annum (OSD all-Inclusive package) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/18 \n \nPurpose: To administer and provide sound legal services in the Office of the Premier and Provincial Departments. \n \nRequirements: LLB or equivalent qualifications at NQF level 7. 5 years or more post experience in legislative drafting and litigation. Experience in Public Service and relevant prescripts, legal research and communication skills. Supervisory position held in the last five years. A valid driver’s licence. \n \nKnowledge, Skills and Competencies: Knowledge of Public Service Prescripts and legislative environment. Research and presentation skills, Communication skills both verbally and writing, ability to work independently and as part of a team. Computer literacy (MS Word, PowerPoint and Excel). Time management Skills, ability to work under pressure, travel when required and be eloquent, assertive and discipline. \n \nDuties: Drafting, editing and certification of legislation. Provide litigation support and management to Provincial Departments. Provide general legal advice on matters affecting the office and other departments. Liaise with State Attorney. Provision of legal opinion and general legal advice. The performance of monitoring and evaluation of legislation and litigation pattern by Provincial Departments.\n \nEnquiries: Mr. GOB Ratshikana Tel: (018) 888 3058 \n \nE-Mail: ooprecruitment8@nwpg.gov.za\n \n \n \n \n \nDEPUTY DIRECTOR: INTERNAL CONTROL \nSalary : R811 560.00 per annum (all-inclusive package Level 11) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/19 \n \nPurpose: To manage and facilitate the provision of Internal Control Services. \n \nRequirements: Three-year auditing tertiary qualification at NQF level 7 (NQF level and credits) as accredited by SAQA. 6-7 years’ experience of which three (3) years thereof should be at Assistant Director level as Internal Control manager. Certified internal Auditor with proof of registration / active membership with relevant professional bodies, i.e. IIA SA & Auditing experience with completed articles will serve as an added advantage. Code 8 driver’s license. \n \nKnowledge, Skills and Competencies: Knowledge of PFMA, Knowledge of Treasury Regulations, Knowledge of Internal Control Standards, Performance Information Framework, Knowledge of Public Service Regulations, Knowledge of supply chain management framework policy and any latest developments in this area. Strong business acumen, Management skills, Computer skills, Writing skills, basic accounting and Auditing skills. \n \nDuties: Develop internal control charter and internal control standards. Coordinate the development of internal control processes in all key areas, standard operating procedures and policies to ensure compliance in the Office. Coordinate the development of post audit action plans for Internal and External audit assignments. Develop and manage a loss control system. \n \nEnquiries: Ms. T.M. Mooketsi Tel: (018) 888 4277 \n \nE-Mail: ooprecruitment9@nwpg.gov.za\n \n \n \n \n ",
                " \n \n \n \n \nDEPUTY DIRECTOR: FORENSIC COORDINATION \nSalary : R766 584.00 per annum (all-inclusive package Level 11) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/20 \n \nPurpose: To provide and conduct forensic coordination in the Office of the Premier \n \nRequirements: Three- year Diploma/Degree in Commerce/Law/Auditing/Forensics and/ or equivalent qualification at NQF level 7 (NQF level and Credits). 6-7 years’ experience of which three (3) years must be at Assistant Director Level. A Valid driver’s license. \n \nKnowledge, Skills and Competencies: Knowledge of national, provincial and departmental legislation, policies and procedures. Knowledge of fact-finding techniques and investigative procedures applicable to forensic auditors/Investigators. Knowledge of fraud risk assessment and forensic audit planning techniques. Knowledge of South African Legal System. Knowledge of Inter-governmental relations. Knowledge of HR and administrative systems and processes. Knowledge of financial management prescripts and processes. Research and legal writing skills, Good Forensic and interviewing skills, Excellent communication skills (verbal and written), Good Interpersonal relations skills, Good analytical and Problem solving skills, Presentation skills, Planning organizing and people management skills, Conflict resolution skills, Good Reporting skills, Policy formulation skills and Computer literacy skills \n \nDuties: Conduct Forensic Coordination Methodology. Manage the successful investigation and prosecution of cases of fraud, theft and corruption. Conduct Coordination in the investigation of cases. Provide Reports and monitor progress in Forensic Coordination. Monitor Project Management in Forensic Investigation. Form liaison with other state law enforcement agencies in order to identify trends of fraud and corruption in the province. Coordinate prosecutions, misconduct enquiries and recovery in liaison with state law enforcement agencies. Monitor project management of forensic investigations performed by appointed service providers. Perform where required certain pre-investigation reviews establishing determined facts before a full investigation process is initiated.\n \nEnquiries: Mr. I Tselangoe Tel: 018 388 4276 \n \nE-Mail: ooprecruitment10@nwpg.gov.za\n \n \n \n \n \nDEPUTY DIRECTOR: ORGANISATIONAL DEVELOPMENT \nSalary : R849 702.00 per annum (all-inclusive package Level 11) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/21 \n \nJob Purpose: To develop Human Resource Strategies and ensure alignment of the organizational structure to the \nDepartmental Strategic Plan. \n \nRequirements: Appropriate three- year tertiary qualification at NQF level 7 and / or equivalent qualification (NQF level and credits).6-7 years’ experience applicable to the relevant discipline of which 3 years should be at Assistant Director Level. \n\n \nKnowledge, Skills and Competencies: Knowledge of Organisational development; Form design and control; Job evaluation system; Procedure and methods study; Compilation of management report; HR planning; Prescripts; Public Service Act and Public Service Regulations. Good Communication skills; Report writing skills; Planning and Organising; Facilitation skills; Coordination Skills; Conflict resolution; Problem solving skills; Project Management; Leadership and Presentation, Ability to interpret and apply policy; Policy formulation; Analytical and innovative thinking and Research skills. \n \nDuties: The management of Organisational design services; Manage the process management and Improvement; Coordinate and facilitate the job evaluation function; Coordinate and Facilitate the assessment of functionality and capacity of the department to deliver on the mandate; Coordinate and analyse office accommodation need; The management and facilitation of the implementation of Service Delivery Programmes; Develop the operational plan in line with the strategic objectives of the sub-directorate; Management of Human Resources. Generic Objectives: Strategic Leadership; Policies and Strategies. \n \nEnquiries: Ms. M.M.Tembe Tel: Tel: (018) 388 3085 \n \nE-Mail: ooprecruitment11@nwpg.gov.za\n \n \n \n \n \nDEPUTY DIRECTOR: MEDIA LIAISON AND FEATURE WRITING\nSalary : R849 702.00 per annum (all-inclusive package Level 11) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/22 \n \nJob Purpose: To provide media liaison management support services in the Office of the Premier \n \nRequirements: Three-year tertiary qualification in communication at NQF level 7 and / or equivalent qualification (NQF level and credits). 6-7 years’ experience applicable to the relevant discipline of which 3 years should be at Assistant Director Level. \n \nKnowledge, Skills and Competencies: Knowledge of media liaison; Understanding of Government policies, procedures and programmes. Public Service Regulations and Acts; Communicators’ code of good conduct; Communication Policies and Strategies. Public Finance Management Act. Media plans formulations; Management people, project, and information; Problem solving; Writing and Editing skills; Presentation and Computer literacy. \n \nDuties: Develop Media Plans for Office of the Premier activities and coordinate their implementation. Develop content for media advisories, media releases and media statements. Coordinate the hosting of Office of the Premier media briefings. Develop content for electronic and print media advertisements. Write feature articles for the media and government publications. Maintain an updated media database. Develop content for Office of the Premier social media accounts. Monitor implementation of the Provincial social media Policy by all provincial departments and municipalities. Produce and submit monthly and quarterly performance reports. Manage staff performance and assets allocated. \n \nEnquiries: Ms. B Mohlakoana Tel: (018) 388 3705 \n \nE-Mail: ooprecruitment12@nwpg.gov.za  \n \n \n \n \n \nDEPUTY DIRECTOR: ICT PLANNING AND ENTERPRISE ARCHITECTURE\nSalary : R849 702.00 per annum (all-inclusive package Level 11) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/23 \n \nRequirements: A bachelor’s degree in information technology at NQF level 7and/ or equivalent (NQF level and credits). 6-7 years’ experience in information technology planning of which three (3) years must be at management level. \n \nKnowledge, Skills and Competencies: Enterprise Architecture frameworks, especially Togaf 9.1, COBIT 5, DPSA Prescripts, and ICT International best practices. Advanced Computer literacy in Excel, Word, Power point, Report writing skills, Problem solving skills and Interpersonal relationship skills. \n \nDuties: Development, coordinate implementation and monitoring of strategic and tactical IT plan in the Northwest Provincial Administration. The development of strategic and tactical IT plans for GITO. The development and management of an Enterprise Architecture capability for the Northwest Provincial Administration. To ensure that all the components of the organization, including business strategies, business processes, data architectures, and system architectures, are integrated, secure, and efficient. Coordinate and Consolidate reports. Management of staff. \n \nEnquiries: Ms. B.V Bantsijang Tel: (018) 388 5612 \n \nE-Mail: ooprecruitment13@nwpg.gov.za  \n \n \n \n \n \nDEPUTY DIRECTOR: INVESTIGATION (X 2) \nSalary : R849 702.00 per annum (all-inclusive package Level 11) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/24 \n \nJob Purpose: To provide and coordinate comprehensive investigation management services in the NWPG. \n \nRequirements: - Bachelor’s degrees in LLB, Bcom, Forensic accounting, Criminal justice, or appropriate tertiary qualification at NQF level 7 and/ or equivalent qualifications (NQF level and credits). 6-7 years relevant experience of which 3 should be at Assistant Director level. Professional certification such as Certified Fraud Examiner (CFE) or equivalent will be an additional advantage. \n \nKnowledge, Skills and Competencies: Must have an extensive knowledge of Public Service prescripts., PFMA and Treasury Regulations and Knowledge of relevant legislation and regulatory frameworks, Strong analytical and problem-solving skills. Excellent written and verbal communication skills. Ability to work independently and as part of a team .High level of integrity and ethical standards. Proficiency in using investigation tools and software. Attention to detail and accuracy. Ability to handle sensitive and confidential information. Strong organizational and time management skills. Ability to work under pressure and meet deadlines. Good interpersonal, communication and presentation skills, be willing to travel extensively. Have a valid driver’s license. \n \nDuties: To conduct investigations on allegations of fraud, corruption, financial mal administration. Collect, preserve, and analyze evidence in accordance with legal and procedural requirements. Prepare detailed investigation reports and present findings to relevant authorities. Collaborate with other law enforcement agencies and other stakeholders to ensure effective resolution of cases. Provide expert testimony in disciplinary hearings and court proceedings as required. Develop and implement fraud prevention strategies and training programs. Maintain accurate records and ensure the integrity of the investigation process. Develop and maintain database management system. \n \nEnquiries: Ms. S. Mphehlo Tel: (018) 388 4039 \n \nE-Mail: ooprecruitment14@nwpg.gov.za\n \n \n \n \n ",
                "ASSISTANT DIRECTOR: INVESTIGATION(X2) \nSalary : R444 036.00 per annum (Level 09) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/25 \n \nJob Purpose: To provide and coordinate comprehensive investigation management services in the NWPG. \n \nRequirements: Bachelor’s degrees: LLB, B com, Forensic accounting, Criminal justice or appropriate tertiary qualification at NQF level 7 and/ or equivalent qualifications (NQF level and credits). 3 - 5 years’ experience applicable to the relevant discipline of which 2 years should be at supervisory level. Professional certification such as Certified Fraud Examiner (CFE) or equivalent will be additional advantage. \n \nKnowledge, Skills and Competencies: Must have knowledge of Public Service prescripts, PFMA and Treasury Regulations and knowledge of relevant legislation and regulatory frameworks. Ability to conduct awareness training. Report writing Skills. Communication skills both verbally and writing, ability to work independently and as part of a team. High level of integrity and ethical standards. Computer literacy. Time management Skills. Ability to work under pressure, be willing to travel extensively. Have a valid driver’s license. \n \nDuties: To conduct investigations on allegations of fraud, corruption, financial maladministration. Liaise with other law enforcement agencies. Compile comprehensive reports with recommendations. Monitor the implementation of the recommendations by the respective clients. Compile performance reports. Maintain accurate records and ensure the integrity of the investigation process.\n \nEnquiries: Ms. S. Mphehlo Tel: (018) 388 4039 \n \nE-Mail: ooprecruitment15@nwpg.gov.za\n \n \n \n \n \nASSISTANT DIRECTOR: INTERNAL CONTROL (X2) \nSalary : R444 036.00 per annum (Level 09) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/26 \n \nJob Purpose: To provide Internal Control and Compliance services in the Office of The Premier. \n \nRequirements: Three-year auditing tertiary qualification at NQF level 6 (NQF level and credits). 3-5 years’ applicable experience in internal control of which 2 years must be at supervisory level. \n \nKnowledge, Skills and Competencies: Knowledge of PFMA, Knowledge of Treasury Regulations, Knowledge of Internal Control Standards, Performance Information Framework, Knowledge of Public Service Regulations, Knowledge of supply chain management framework policy and any latest developments in this area. Good Communication skills, Computer skills, writing skills, basic accounting skills and Auditing skills \n \nDuties: Monitoring the implementation of internal control standards and processes, standard operating procedures, policies, prescribed frameworks and administrative controls to ensure compliance. Manage processes to detect, prevent and report fraud allegations and losses, fruitless, wasteful, and irregular expenditure. Monitor implementation of post audit action plan for Internal and External audits assignments. Develop systems to safeguard financial and non-financial records as prescribed. \n \nEnquiries: Ms. T.M. Mooketsi Tel: (018) 888 4277 \n \nE-Mail: ooprecruitment16@nwpg.gov.za\n \n \n \n \n \nASSISTANT DIRECTOR: MANAGEMENT ACCOUNTING \nSalary : R444 036.00 per annum (Level 09) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/27 \n \nJob Purpose: To facilitate financial planning, monitoring and reporting process \n \nRequirements: Three-year diploma/degree in Financial Management / Public Finance / Economics at NQF level 7 or equivalent qualification in the relevant field (NQF level and credits). 3-5 years’ applicable experience to the relevant field of which 2 years must be at supervisory level. \n \nKnowledge, Skills and Competencies: Understanding and application of the following prescripts: Public Finance Management Act, Treasury Regulation, Knowledge of Public Services Act and Regulations, GRAP, Annual Financial Statement Guidelines (MCS & AMD), National Treasury Practice Notes, Provincial MTEF guidelines, Budget Circulars, Computer literacy skills in Excel, Word and PowerPoint and Reporting skills. Numeric Skills, ability of paying attention to detail, Ability to perform routine tasks, Financial Good People Skills, Problem Solving, Communication (written and verbal). \n \nDuties: Facilitate financial management policies, processes and procedure. Conduct medium- and long-term financial planning in line with the MTEF processes. Compilation of budget estimates, monthly forecasting, project planning and produce adjusted cash flow. Monitor and report on expenditure trends. Facilitate the provision revenue services. Maintain departmental budget process; Analyze and consolidate inputs received from the respective programme’s MTEF budget, adjustment estimates and rollover of funds. Identify departmental priorities and projects in terms of the annual performance plan and conduct analysis thereof. Capture MTEF budget on budget database and in BAS. Capture adjustment estimates. Conduct project plan appraisals. Prepare report required for monitoring of the departmental budget; Analyze and consolidate departmental annual cash flow projections. Analyze and consolidate departmental IYM report including variance explanations. Manage budget and expenditure misallocations. Ensure that approved shifts and virements are captured accurately in BAS, IYM and expenditure reports. Prepare budget oversight and related reports. Prepare appropriation statements as input to the financial statements. Monitor and report on project progress. Provide budgetary support service to the department; Provide departmental budgetary support, analysis, advice and guidance. Analyze and respond to budget related enquiries. Facilitate budget bilaterals and training on budget related issues. Ensure timeously development of job description and implementation of Work Plans and Personal Development Plans (PDP’s) for all the sub-ordinates. Manage daily employee performance and ensure timely Performance Assessments of all subordinates. Ensure management and safekeeping of assets in the official’s area of responsibility. \n \nEnquiries: Mr. N Rapoo Tel: (018) 888 2516 \n \nE-Mail: ooprecruitment17@nwpg.gov.za\n \n \n \n \n \nINFORMATION SECURITY OFFICER: ICT SECURITY\nSalary : R 376 413.00 per annum (Level 08) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/28 \n \nPurpose: To Implement and Administer ICT Security within the North West Provincial Government network \n \nRequirements: Three-year tertiary qualification at NQF level 6 in Information systems, Technology and computer Science or equivalent qualification (NQF and credits). 2- 4 years’ experience applicable to the relevant discipline of which 1 year should be at supervisory level. \n \nKnowledge, Skills and Competencies: Knowledge of Security Standards and ICT environment Mainframe security. Advanced computer literacy skills; Reporting Skills; Coordination; Problem Solving; Project Management; ability to interpret and apply policy; Analytical and innovative thinking; Research \n \nDuties: The Administration and Monitoring of ICT Security Policy. The monitoring of Information Security. The controlling of physical security in the Information Technology environment. The Administration and Monitoring of the security programme. \n \nEnquiries: Ms. B.V Bantsijang Tel: (018) 388 5612 \n \nE-Mail: ooprecruitment18@nwpg.gov.za",
                "SENIOR MAINFRAME OPERATOR\nSalary : R 376 413.00 per annum (Level 08) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/29 \n \nJob Purpose: To provide and monitor storage backup environment in the NWPG \n \nRequirements: Three-year appropriate tertiary qualification at NQF level 6 and/ or equivalent qualifications (NQF level and credits). 2-4 years’ experience applicable to the relevant discipline of which 1 year should be at supervisory level. \n \nKnowledge, Skills and Competencies: Knowledge of information and communication technology, Infrastructure technologies, Configurations Software requirements, Network operating systems, Memory management and integration, Knowledge of methods, tools, equipment and material used in server equipment testing, repair and maintenance. Good Communication skills, good telephone etiquette, Report writing skills, Computer skills. Problem solving skills, Project management, Leadership and presentation \n \nDuties: To render mainframe operations and storage environment. Provide salary reports and documents distribution. Rendering of system availability. Implementation of procedures to improve mainframe performance. The provision of backup and restores. \n \nEnquiries: Mr. D.S Mtotoba Tel: (018) 388 4149 \nE-Mail: ooprecruitment19@nwpg.gov.za\n \n \n \n \n \nPERSONAL ASSISTANT: CHIEF DIRECTOR: GITO \nSalary : R308 154.00 per annum (Level 7) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/31 \n \nJob Purpose: To render a secretariat support service to Chief Director: Government Information Technology Officer. \n \nRequirements: Three-year appropriate tertiary qualification at NQF level 6 and/ or equivalent qualifications. 2-3 years’ experience applicable to the relevant discipline. \n \nKnowledge, Skills and Competencies: Knowledge of Prescripts / Policies. Knowledge of finical administration. Knowledge of computer. Good Communication skills. Good telephone etiquette. Report writing skills. Computer skills and Problem-solving skills. \n \nDuties: Provides a secretariat / receptionist support service to the manager. Render administrative support services. Provides support to manager regarding meetings. Support the manager with the administration of the manager’s budget. Keep abreast with regard to the prescripts/ policies & procedures applicable to the work terrain. \n \nEnquiries: Ms. B.V Bantsijang Tel: (018) 388 5612 \n \nE-Mail: ooprecruitment21@nwpg.gov.za\n \n \n \n \n \nSECRETARY: MANAGEMENT ACCOUNTING\nSalary : R216 417.00 per annum (Level 5)) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/32 \n \nJob Purpose: To provide secretarial services to the Director Management Accounting \n \nRequirements: Matric and 1-2-year National Higher Certificate in Office Administration/ Secretarial at NQF level 5 or equivalent qualification.0-2 year’s relevant experience in office administration and/or secretarial field. \n \nKnowledge, Skills and Competencies: Understanding of government procurement procedures, Secretarial administrative and organisational knowledge and understanding and Computer application knowledge. Administrative and organisational skills, Document management, Oral and written communication skills, Procurement of goods and services, typing, bookkeeping and filling skills and Time management. \n \nDuties: Provides Secretarial support services to the Director; Incoming mail received, recorded manually and filed within 1 day, Outgoing mail recorded, filed and dispatched within 1 day and manage the diary of the Director by updating Director’s diary every day and send email as reminder to Director. Provide clerical support services to the Director; Manage meeting logistics by sending out meeting schedules, quarterly locate and book venues within 2 weeks, send out invitations before the meeting and take minutes of meetings and distribute minutes within 1 week of meeting for input. Provide support to the Director regarding meetings, Arrange accommodation for the Director, Complete S&T claims for the Director, manage the reception area and procurement of goods and services in the Directorate \n \nEnquiries: Mr. N Rapoo Tel: (018) 888 2516 \n \nE-Mail: ooprecruitment22@nwpg.gov.za\n \n \n \n \n \n \nSECRETARY: PROVINCIAL COUNCIL ON AIDS \nSalary : R216 417.00 per annum (Level 5) \nCentre : Mmabatho \nRef No : NWP/OOP/2024/33 \nJob Purpose: To render secretarial support service to the Director. \n \nRequirements: 1-2 years National Higher Certificate in a relevant discipline at NQF level 5 and/ or equivalent qualifications (NQF level and credits). 0-2 years’ experience applicable to the relevant discipline \n \nKnowledge, Skills, Competencies Knowledge: Knowledge of Secretarial services, typing, reporting writing and office management and Knowledge of prescripts public service regulations and PFMA, supply chain management. Planning and organisation, Communication skills, Ability to operate computer, Ability to type and Interpersonal relations \n \nDuties: Provide a secretarial / receptionist support service to the manager; receive telephone calls and refers the calls to the correct role players if not meant for the relevant manager. Record appointments and events in the diary of the director. Type documents for the director and other staff within the unit on a word processor and Operate office equipment like fax machines and photocopiers. Provide clerical support services to the director; Attend to corporate administration functions and loading of reports. Liaise with travel agencies to make travel arrangements and make follow-ups. Arrange meetings and events for the director and staff in the unit. Scrutinize routine submission / report and take notes or recommendations to the director. Attend to corporate administrative functions and loading of report. Process travel and subsistence claims for the director. Processes all invoices that emanates from the activities of the work of the director. Records minutes of the meeting of the director. Drafts routines correspondence and reports. Receives records and distribute all incoming and outgoing documents. Handles the procurement standard items like stationary, refreshments and other activities and collect all relevant documents to enable the director to prepare for meetings. Provide support to manager regarding meetings; Scrutinizes documents to determine actions / documents / other documents required for meetings. Collect and compile all necessary documents for the manager to inform him / her on the content. Records minutes / decisions and communicate to relevant role players, follow up on progress made. Prepare briefing notes for the manager as required and coordinate logistics arrangements for meetings when required. Knowledge of the procedures and processes that apply in the office of the Director. \n \nEnquiries: MS. C.N Modise Tel: 018 388 5078 \n \nE-Mail: ooprecruitment23@nwpg.gov.za"
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pb93ba3a8-be35-4e5b-8af5-08b888241c14"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/north-west-economic-development-environment-conservation-and-tourism_orig.jpg",
            "href": "https://www.govpage.co.za/north-west-department-of-economic-development-environment-conservation-and-tourism-vacancies-blog/north-west-department-of-economic-development-environment-conservation-and-tourism-vacancies8686000",
            "title": "NORTH WEST DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT, CONSERVATION AND TOURISM VACANCIES",
            "content": [
                " \nNORTH WEST DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT, CONSERVATION AND TOURISM\n ",
                "CHIEF DIRECTOR: ECONOMIC PLANNING \nSalary: R1 436 022.00 per annum (Salary level 14 All-inclusive Remuneration Package): 60% or 70% of the inclusive salary package must go into the basic salary. \n• REF: 02/DEDECT/2024/NW \n• Centre: Mahikeng \n \nRequirements: • Relevant and appropriate recognised Bachelor’s Degree NQF level 7 in the field of Business Economics or Economics • Additional Postgraduate qualification(s) in the Economics field of study will be an added advantage • Extensive experience in the field of economic development, export and investment promotion • Knowledge and understanding of the economic development sector, as well as, industry development • Experience of conducting economic development research • Minimum of five (5) years’ experience in economic development related working field at Senior Management Service (SMS) level in the Public Service or equivalent to SMS level in the Private Sector • A valid driver’s license. \n \nCompetencies: • An in-depth knowledge and insight of South African economic policy, strategy and legislation applicable to economic planning • Advanced knowledge and understanding of the North West economy • Extensive knowledge of the National Development Plan (NDP), Industrial Policy Action Plan (IPAP), National Spatial Economic Development Perspective (NSDP), Provincial Growth and Development Strategy (PGDS) and extensive knowledge of Global, National and Regional Economies • A deep understanding of national, provincial economic and sector development policies, as well as, their implementation plans • Knowledge and understanding of the regulatory framework for the Public Service like the Constitution of the Republic of South Africa, Public Service Act, Knowledge of the Public Finance Management Act (PFMA) and the Public Service legislative framework broadly • Treasury Regulations, Public Service Regulations, Basic Conditions of Employment Act, Occupational Health and Safety Act, Labour Relations Act • Good stakeholder coordination and engagement, sound research, knowledge management, and strategic, leadership, problem solving, analysis and empowerment capabilities • Knowledge and understanding of the Public Sector Employee Performance, Management and Development System, knowledge of Security Management Act, Bill of Rights, Community Outreach, and Public participation • Knowledge of monitoring and implementation of Government Programmes and proper co-ordination across National, Provincial and local government spheres • Ability to communicate at all levels with relevant stakeholders including: Provincial Departments, Senior Management, Private Sector Organisations, Media, International Organisations and the General Public • Candidate must demonstrate excellent skills in: Business planning, Economic Modelling, strategy development, financial management, computer literacy, policy and research, Programme and Project management, report writing and presentations. \n \nDuties: • Perform functions as a Chief Economist • Develop and implement interventions and strategies to stimulate economic growth and development through industry development, trade and investment promotion • Facilitate and co-ordinate the development of the major Provincial economic sectors (agro processing, manufacturing, mining beneficiation, tourism and green economy) • Facilitate the support of industries in order to contribute to the acceleration of economic growth rate • Address the millennium development goals, national and provincial goals of job creation and the constitutional mandate • Facilitate and undertake research that will inform the development and review of economic development plans, policies and strategies in alignment with national and provincial priorities • Conduct research and feasibility studies on prospective projects in terms of, inter alia, technical, socio-economic, environmental and financial management and market processes to aid decision-making about the type of project support and links to sector development • Manage the implementation of broad economic strategies and other imperative initiatives to transform the provincial economy e.g. Special Economic Zones (SEZ), Black industrialists and Industrial parks • Develop and implement key economic sectors strategies that influence provincial economy growth and development • Facilitate and manage creation of an enabling environment for key Provincial industries that have the potential to significantly contribute to job creation, skills development, establishment and growth of small medium and large business and support BBBEE through rural and township economy within the four districts of the Province • To enhance the competitiveness of the province’s priority economic sectors and ensure that they can compete within a global, continental and international scale • Manage strategic projects and partnership/service level agreements with key stakeholders in provincial prioritised economic sectors and ensure that are successful completed within budgetary timelines and performance requirements • Manage the performance of the Chief Directorate. \n \nEnquiries: Mr. M. R. S. Senqhi, Tel. (018) 388 5920/5921 \n \n \n \n \nDIRECTOR: ECONOMIC PLANNING \nSalary: R1 216 824.00 per annum (Salary level 13 All-inclusive Remuneration Package): 60% or 70% of the inclusive salary package must go into the basic salary. \n• REF: 03/DEDECT/2024/NW \n• Centre: Mafikeng \n \nRequirements: • An appropriate Bachelors’ Degree in Economics/Planning/Public Policy Management/Development Studies or related field of study • Post-Graduate qualifications in Economics or related field of study will serve as an added advantage • A minimum of 5 years’ relevant managerial experience at Deputy Director level in the relevant field • Must be in possession of a valid driver’s license. \n \nCompetencies: • An in-depth knowledge and insight of South African economic policy, strategy and legislation applicable to economic planning • Advanced knowledge and understanding of the North West economy Extensive knowledge of the National Development Plan (NDP), Industrial Policy Action Plan (IPAP), National Spatial Economic Development Perspective (NSDP), Provincial Growth and Development Strategy (PGDS) and extensive knowledge of Global, National and Regional Economies • A deep understanding of national, provincial economic and sector development policies, as well as, their implementation plans • Knowledge and understanding of the regulatory framework for the Public Service like the Constitution of the Republic of South Africa, Public Service Act, Public Finance Management Act (PFMA), Treasury Regulations, Public Service Regulations, Basic Conditions of Employment Act, Occupational Health and Safety Act, Labour Relations Act • Good stakeholder coordination and engagement, sound research, knowledge management, and strategic, leadership, problem solving, analysis and empowerment capabilities • Knowledge and understanding of the Public Sector Employee Performance, Management and Development System, knowledge of Security Management Act, Bill of Rights, Community Outreach, and Public participation • Knowledge of monitoring and implementation of Government Programmes and proper coordination across National, Provincial and local government spheres • Ability to communicate at all levels with relevant stakeholders including: Provincial Departments, Senior Management, Private Sector Organisations, Media, International Organisations and the General Public • Candidate must demonstrate excellent skills in: Business planning, Economic Modelling, strategy development, financial management, computer literacy, policy and research, Programme and Project management, report writing and presentations. \n \nDuties: • Provide guidance and leadership in economic research and development in the North West Province • Facilitate the development of Provincial Economic policy and strategies • Facilitate and co-ordinate the development and implementation of effective knowledge management systems in the Department • Coordinate the development and implementation of policies • Provide a strategic direction in the institutionalisation of District Operations Management Functions • Co-ordinate and develop Annual Performance and Operational Plans of the Directorate • Co-ordinate the planning and implementation of strategies and policies aimed at improving service delivery • Provide oversight into economic planning at district operations • Oversee the management of human and financial resources of the Directorate • Facilitate the team participation in District Operations, Implement change management to improve the performance of the Directorate • Plan and report to various stakeholders amongst others Legislature Committees, Audit and Risk Management Committees of the Department • Co-ordinate and report on all Directorate programmes and projects. \n \nEnquiries: Mr. M. R. S. Senqhi, Tel. (018) 388 5920/5921 \n \n \n \n \n \nDIRECTOR: STRATEGIC PLANNING, MONITORING, EVALUATION AND TRANSFORMATION \nSalary: R1 216 824.00 per annum (Salary level 13 All-inclusive Remuneration Package): 60% or 70% of the inclusive salary package must go into the basic salary. \n• REF: 04/DEDECT/2024/NW \n• Centre: Mafikeng \n \nRequirements: • A Bachelor’s degree (NQF level 7) in Public Administration/Public Management or related Bachelor’s degree • Post graduate qualifications on these fields will be advantageous • Minimum of 5 years’ relevant experience in middle management position • Proven experience in the development of procedures for data collection and analysis • Knowledge and experience in monitoring and evaluation tools and systems • Must be in possession of a valid driver’s licence. \n \nCompetencies: • Knowledge of the Public Finance Management Act (PFMA) • Knowledge of National and Provincial trends/priorities • Knowledge of the Medium Term Strategic Framework • Extensive knowledge of the Public Service Act and Public Service Regulations and the Public service legislature framework broadly • Knowledge on the development of Government policies • Problem solving; communication; writing; analytical; facilitation; presentation and project management skills • Knowledge in Stakeholder and Relationship management • Knowledge and understanding of Government planning processes and cycle as well as National Treasury Regulations • Knowledge Guidelines and Frameworks on strategic planning and management of performance information • Understanding of the audit processes and how they relate to planning and reporting compliance and improvement • Ability to network and undertake rapid analysis in order to strengthen and deepen operational and institutional planning at departmental level with National and Provincial counterparts and entities, quality assurance is critical in the development of plans and reports • Computer literacy (MS Word, Excel, Outlook and PowerPoint). \n \nDuties: • Provide leadership in the development and review of the Strategic Plan • Annual Performance Plan and Operational Plans of the Department • Facilitate approval and tabling of the Strategic Plan and Annual Performance Plan • Manage and co-ordinate strategic planning services • Manage and coordinate the performance, monitoring, evaluation and reporting processes within the Department • Manage the design and implementation of change management initiatives • Facilitate the development and implementation of service delivery improvement plans and initiatives • Facilitate the implementation of diversity management programmes • Manage all the performance planning and performance reporting activities of the Department. \n \nEnquiries: Mr. M. R. S. Senqhi, Tel. (018) 388 5920/5921 \n \n \n \nDIRECTOR: ENTITY OVERSIGHT AND INTERFACE\nSalary: R1 216 824.00 per annum (Salary level 13 All-inclusive Remuneration Package): 60% or 70% of the inclusive salary package must go into the basic salary. \n• REF: 05/DEDECT/2024/NW \n• Centre: Mafikeng \n \nRequirements: • A Bachelor’s degree (NQF Level 7) in Business Management/Public Management/ Accounting/Finance/Economics • Post-graduate qualifications on these fields will be advantageous • Minimum 5 years’ relevant work experience in a middle management position • Practical exposure to corporate governance processes and government planning and reporting mechanisms • Must be in possession of a valid driver’s licence. \n \nCompetencies: • Extensive knowledge of the Public Finance Management Act (PFMA) and the Public Service Legislative Framework broadly • Extensive knowledge of the Public Service Act and Public Service Regulations • Knowledge on the development of Government policies • Problem solving • Communication • Writing • Analytical • Facilitation • Presentation and project management skills • Knowledge in Stakeholder and relationship management • Computer literacy. \n \nDuties: • Review of the Corporate Governance • Implement the Public Finance Management Act • Review established governance structures in Public Entities and implement systems to deliver the required outputs • Initiate trends for good governance practices in the Public Entities • Advise the Executive Authority on governance matters relating to Public Entities. Facilitate the conclusion and signing of shareholder compact/ SLA between Executive Authority and Entities and monitor the implementation process • Provide Public Entity’s governance and regulatory compliance framework shareholder oversight support • Co-ordinate the appointment of members of the public entity’s board • Financial Analysis and reporting: Evaluate Strategic Plans/Annual Performance Plans and establish indicators for Public Entities reporting to the Executive Authority • Frequent analysis of Public Entities quarterly reports and their expenditure trends • Monitor financial management and performance in public entities in terms of PFMA and Treasury Regulation • Review of Annual Reports of Public Entities reporting to the Executive Authority • Oversee and monitor the performance of entities in line with the set objectives and programmes • Co-ordinate the process for amendment, approval and tabling of the strategic plans, annual performance plans and annual reports • Budget Analysis, review of annual budget/grant allocations: Review and assess Public Entities Medium Term Expenditure Framework and budget allocations and make recommendations • Review, research, analysis of fiscal implications and engagements and submissions on public entities legislation, regulation, policy proposals, and service delivery trends • Prepare submissions and engage the Chief Financial Officer (CFO) on short falls and financial improvement of the Public Entities • Internal and external communication: Facilitate stakeholder interface, including meetings between the department and public entity as well meeting between the Executive Authority and the Board • Engage internal and external Public Entities for stakeholder liaison in order to obtain information, inputs and recommendations • Provide advice to Head of Department (HoD) and Executive Authority relating to Executive Council, Portfolio Committee and Legislature correspondence pertaining to Public Entities. \n\n \nEnquiries: Mr. M. R. S. Senqhi, Tel. (018) 388 5920/5921 \n \n \nDirections to Applicants: \nThe North West Department of Economic Development, Conservation, Tourism and Environment is an Equal Opportunity, Affirmative Action Employer and is committed to the achievement and maintenance of diversity and equity in employment, especially in respect of race, gender and disability. White males and females are encouraged to apply. \n \nGENERAL NOTES: Applications must be submitted on a newly prescribed Z83 Form, obtainable from any Public Service Department, which must be signed and dated (an unsigned and not dated Z83 form will disqualify an application) and must be accompanied by a recently up-dated, comprehensive CV, including the details of at least three contactable referees (should be people who recently worked with the applicant). Non-RSA Citizens/ Permanent Resident Permit Holders must attach a copy of their Permanent Residence Permits to their applications. Should you be in possession of a foreign qualification, it must be accompanied by an evaluation certificate from the South African Qualifications Authority (SAQA). \n \nIt is the applicant’s responsibility to have foreign qualifications evaluated by the South African Qualification Authority (SAQA). Failure to submit all the requested documents will result in the application not being considered. Correspondence will be limited to short-listed candidates only. If you have not been contacted within six (6) months after the closing date of this advertisement, please accept that your application was unsuccessful. Suitable candidates will be subjected to personnel suitability checks (criminal record check, citizenship verification, financial/asset record check, qualification/study verification and previous employment verification). \n \nSuccessful candidates will also be subjected to security clearance processes. The Department reserves the right not to make appointment(s) to the advertised post(s).No faxed, e-mailed and late applications will be considered. All shortlisted candidates for SMS posts will be subjected to a technical exercise that intends to test relevant technical elements of the job, the logistics of which will be communicated by the department. Following the interview and technical exercise, the Selection committee will recommend candidates to attend a generic managerial competency assessment (in compliance with DPSA Directive on the implementation of competency-based assessments). The competency assessment will be testing generic managerial competencies using the Service Providers mandated by the DPSA. Successful completion of the Nyukela Public Service (SMS Pre-Entry Certificate) is required prior to finalisation of an appointment into any SMS posts. For more details on the pre-entry course visit: https://www.thensq.gov.za/training-course/sms-pre-entry-programme.\n \nAPPLICATIONS: Completed application forms and the Comprehensive CV quoting the relevant reference number, may either be hand-delivered to Department of Economic Development, Environment, Conservation and Tourism, NWDC Building, Cnr University Drive and Provident Street, Mmabatho, 2735",
                " \n \n \n \n \nHEAD OF DEPARTMENT (HOD): \nDEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT, CONSERVATION AND TOURISM (DEDECT) \n(5-year fixed term contract) (SL 15) \nRe-Advertisement\nSalary: R 1 741 770.00 per annum (All-inclusive remuneration package consists of a basic salary, the State’s contribution to the Government Employee’s Pension Fund and a flexible portion that may be structured i.r.o. the applicable rules) plus non-pensionable Head of Department’s allowance equal to 10% of the all-inclusive remuneration package. \n•Ref. No. NWP/OOP/2024/13 \n•Centre: Mmabatho \n \nRequirements: •An appropriate Bachelor’s degree (NQF level 7) and a post-graduate qualification (NQF 8) as recognised by SAQA. •A minimum of eight (8) years’ experience at Senior Managerial Level of which at least three (3) must be with an organ of state •The office reserves the right to introduce other objective requirement/s should a need arise. • Applicants who do not possess (SMS) Pre-entry Certificate shall be considered for shortlisting and interviews, but the successful candidate shall not be appointed before successfully obtaining the certificate (SMS Pre-Entry/Programme) offered by the National School of Government • Information can be accessed via this link:  https://www.thensg.gov.za/training-course/sms-pre-entry-programme.\n \nCore management competencies: • Strategic capability and leadership skills • Client Orientation and Customer Focus. • Financial Management • People Management and Empowerment • Communication • Project and Programme Management. • Change Management, Knowledge Management and Service Delivery, Client Orientation and Customer Focus, Problem-Solving and Analysis, Knowledge of MS Word, MS Excel and MS PowerPoint. \n \nDuties: •Provide effective, efficient management and administration in the Department. Provide strategic direction and leadership to the Department • Ensure effective utilisation and training of staff • Maintain sound labour relations and discipline of staff • Ensure proper use, care and maintenance of state assets and resources • Render sound financial management in the Department, including serving as an Accounting Officer of the Department • Implement all laws and policies applicable to the Department, any other function that may in law be entrusted, assigned, or delegated to an Accounting Officer and or Head of Department. \n \nNOTE: Applicants who previously applied for this post are encouraged to re-apply. \n \nEnquiries: B. Malwane, tel. (018) 388 3710 and 083 628 5501 \n \n \nGeneral Instructions: \nThe Office is an equal opportunity, affirmative action employer. It is our intention to promote gender and disability in the HoD echelons through the filling of this post. Candidates whose transfer/promotion/appointment will promote aforementioned will receive preference. The Department reserves the right not to make any appointments to the advertised posts. \n \nThe Applicant must fully complete all fields on the New Amended Z83 Form (81/971431) as prescribed with effect from 01 January 2021, which must be signed, initialled on every page. The new Z83 Form obtainable from any Public Service Department or on the Department of Public Service and Administration (DPSA) website link: http://www.dpsa.gov.za/newsroom/psvc/ and must be accompanied by a recently updated and Comprehensive/Detailed Curriculum Vitae with competencies and experience, including three (3) names of contactable referees. Applicants are not required to submit copies of qualifications and other relevant documents on application. The communication from the HR department regarding the requirements for certified documents will be limited to shortlisted candidates. Therefore only shortlisted candidates for the post will be required to submit certified documents on or before the day of the interview following communication from HR. Failure to submit the requested documents will result in your application not being considered. Shortlisted candidates for senior management posts will be subjected to a technical assessment and the selected interviewed candidates will be subjected to a two-day competency assessment. \n \nPlease note: It is a responsibility of a person in possession of a foreign qualification to furnish the Department with an evaluation certificate from South African Qualifications Authority (SAQA). Applications with incorrect information and/or those received after the closing date indicated below will, as a rule, not be accepted. Due to the large number of applications we envisage to receive, applications will not be acknowledged. You may, however, contact the relevant enquiry persons to confirm if your application has been received. If you do not receive any response from us within 90 days of the closing date, please accept that your application was unsuccessful. \n \nApplications must be forwarded for attention: The Director-General, Office of the Premier, Private Bag X129, Mmabatho, 2735 or hand delivered at the Directorate of Human Resource Practices and Administration, Ground Floor, Ga-rona Building or can be emailed to recruitment3@nwpg.gov.za\n \nClosing date: 27 September 2024 \n(Applications must have reached the Office by 16h30 pm on the closing date, otherwise they will not be considered)."
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "p3732c7c5-7a50-47ea-bf9d-802b029d1f5a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ccma_orig.jpg",
            "href": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies9069209",
            "title": "COMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA) VACANCIES",
            "content": [
                " \nCOMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA)\n ",
                " \n \n \nSENIOR INTERNAL AUDITOR – NATIONAL OFFICE\nRef: SIA09-24\nPost level: P07\nThe Internal Audit department has a vacancy for a Senior Internal Auditor at the National Office.\n \nPurpose\nTo plan, execute and report on audits as per the Annual Audit Plan to determine whether the business unit / departmental activities are in compliance with CCMA’s policies and procedures, CCMA objectives and applicable legislations.  To supervise the Internal Auditors to ensure that audits are carried out as per the Annual Audit Plan.\n \nKey Performance Areas: –\nAudit Planning\nAudit Execution\nAudit Reporting\nCustomer Feedback Coordination\nGeneral Audit Support\nTeam Supervision\n \nKey Requirements:\nB Com / National Diploma in Internal Auditing or Equivalent\nMinimum 5 years’ experience in Internal Auditing\nKnowledge of executing Annual Financial Statements and Strategic Audits\nMember of Institute of Internal Auditors\nMust be studying towards or have Certified Internal Auditor (CIA) certification. CA will be advantageous.\nInternal Auditing technical and behavioural training\nKnowledge of Barnowl Audit Software",
                " \n\n\nNOTE FOR ALL APPLICANTS:    \nStrictly apply via the link provided: https://forms.office.com/r/CwGCNabYaM\nIn your online application for appointment, kindly ensure that you disclose all relevant material information to assist the panel in considering your application.\nDetailed CV, copies of qualifications, driver’s license & ID document must be uploaded. Failure to complete the online form in full or not provide relevant information will automatically disqualify your application.\n\n*Only One (1) online application should be submitted.\nNo emailed or hand-delivered applications will be accepted. Non-adherence to the stated procedures in applying as well as incomplete application will result in the disqualification of the application.\n \nClosing date: 16 September 2024\n \nN.B Incomplete and late applications will automatically be disqualified.\n \nIf we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The CCMA reserves the right not to make an appointment. It is the intention of the CCMA to promote representivity in respect of race, gender and disability through the filling of the posts. Preference will be given to candidate from the designated groups.\n \nPeople with disabilities are encouraged to apply."
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pc1847395-8b90-4455-b417-352d279f6198"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/nemisa_orig.jpg",
            "href": "https://www.govpage.co.za/national-electronic-media-institute-of-south-africa-nemisa-vacancies-blog/national-electronic-media-institute-of-south-africa-nemisa-vacancies2080761",
            "title": "NATIONAL ELECTRONIC MEDIA INSTITUTE OF SOUTH AFRICA (NEMISA) VACANCIES",
            "content": [
                " \nNATIONAL ELECTRONIC MEDIA INSTITUTE OF SOUTH AFRICA (NEMISA)\n ",
                " \nTEMPORARY HUMAN RESOURCES OFFICER (THREE MONTHS)\n ",
                " \nRECEPTIONIST (NON-PERMANENT) – 3 MONTHS CONTRACT\n "
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "p690f1593-7d35-4e62-a97d-784aaef04fff"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/nhls_orig.png",
            "href": "https://www.govpage.co.za/national-health-laboratory-services-nhls-vacancies-blog/national-health-laboratory-services-nhls-vacancies1424356",
            "title": "NATIONAL HEALTH LABORATORY SERVICES (NHLS) VACANCIES",
            "content": [],
            "postedDate": "10/9/2024",
            "iframe": null,
            "uuid": "pb0460526-d81c-42b9-a085-f91062b1b630"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ports-reglator-of-south-africa_orig.jpg",
            "href": "https://www.govpage.co.za/ports-regulator-of-south-africa-vacancies-blog/ports-regulator-of-south-africa-vacancies1131757",
            "title": "PORTS REGULATOR OF SOUTH AFRICA VACANCIES",
            "content": [
                " \nPORTS REGULATOR OF SOUTH AFRICA\n ",
                " \nSPECIALIST: ECONOMIC REGULATION\n ",
                " \nSPECIALIST: MONITORING AND COMPLIANCE\n "
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pe118fcc7-bf24-418b-807a-194c23dae224"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/psira_orig.jpg",
            "href": "https://www.govpage.co.za/private-security-industry-regulatory-authority-psira-vacancies-blog/private-security-industry-regulatory-authority-psira-vacancies8193362",
            "title": "PRIVATE SECURITY INDUSTRY REGULATORY AUTHORITY (PSIRA) VACANCIES",
            "content": [
                " \nPRIVATE SECURITY INDUSTRY REGULATORY AUTHORITY (PSIRA)\n \nThe Private Security Industry Regulatory Authority (PSiRA) with its head office in Eco Park - Centurion is the statutory body regulating the private security industry in South Africa. PSiRA is looking for dynamic experienced and suitably qualified professionals to take up these challenging positions. It is the intention of the Authority to promote representative through the filling of these positions.\n ",
                " \n \nCOMMITTEES COORDINATOR\nSalary: R 724 287 basic salary P/A plus benefits (Centurion)\n \nRequirements: Recognised Degree/ National Diploma in Law and/or corporate governance qualification coupled with at least 3 years’ experience working with Board/Council Committees ● CIS qualification or registration for same will be an added advantage. \n \nEssential criteria: Interpretation of statutes ● Ability to work under pressure ● Document Control or Record Management● Client & service orientated ● Excellent verbal and written communication skills (to all levels & personalities) ● Excellent people/interpersonal skills (incl. diplomacy & problem solving) ● Advanced computer literacy in MS Office packages - Word, Excel, PowerPoint. ● Excellent planning and organising skills ● Excellent reporting skills ● Strong analytical and problem-solving skills ● Excellent negotiation skills ● Supervisory skills ● Advanced writing skills. \n \nKey Performance Areas: Provide Council Committees support as per King Report on Corporate Governance: Provide secretariat, legal and administrative support to Council Committees to ensure their effective and efficient functioning ● Schedule and administer arrangements for Council Committee meetings, circulate meeting agendas, and preparation and compilation of Committee meeting packs ● Assist with the coordination and facilitation of induction of new committee members and governance developmental training ● Attend the Council committees meetings in order to ensure that the legal requirements are fulfilled and decisions are legally sound and rational, accurate records, minutes are kept and provide such advice and information as is necessary ● Governance and Statutory Responsibilities: Ensure that the Council committees’ charters and terms of reference are kept up to date ● Ensure that the minutes of the Council Subcommittees are signed and kept safe ● Ensure proper record keeping, including disclosures of interests and performance assessments of Committees and individual members ● Administrative Responsibilities: Provide administrative support to Committee Chairpersons including, amongst others document sourcing and/or preparation, document delivery and collection and arrange meetings, travel, and accommodation logistics ● Maintain and update Committees’ membership records as and when required, and monitor the filing, security and availability of the Committees’ records ● Preparation and circulation of Committee meeting agenda packs, action lists and minutes ● Communicate Committee decisions and requests to relevant staff, and monitor and report on the implementation of decisions ● Assist with the preparation of Committee reports as may be required ● Receive, process and ensure payment of Committee members’ claims for meetings and travel, and update members’ payment records; and Maintain in-house documents in accordance with the existing practices.\n \nCLOSING DATE: 17 SEPTEMBER 2024\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nSUPPLY CHAIN MANAGEMENT SPECIALIST\nAll-Inclusive package of R 1 111 724 per annum (Centurion)\n \nRequirements: Degree/National Diploma in Supply Chain Management/Logistics or Finance coupled with 5 to 6 years’ experience in Supply Chain Management environment, of which two (2) years should be at Team Leader/Supervisor level ●Recognition of Prior Learning (RPL) and applicable knowledge and experience on the Job may be considered during the selection process. \n \nEssential Criteria: The Constitution, PFMA, PPPFA, Treasury regulations as well as general understanding of BBBEE Act requirement in line with procurement compliance ●Comprehensive knowledge and understanding of SCM best practices. Comprehensive understanding of legislation/prescripts. \n \nKey Performance Areas: Project Management: Demonstrable capability of leading and driving project-based exercises to completion● Procurement and demand plan management: Conducts in-depth market research and analysis of historical expenditure all procurement related activities● Lead the pivotal operations of driving cost-effective procurement practices, fostering supplier relationships, and ensures supply chain integrity● Align procurement plan with project plans to enable execution in line with appropriate procurement strategies and approvals● Liaise with suppliers and provide support as required to all stakeholders during the project life cycle● Facilitate of negotiations process with potential service providers to ensure value for money in obtained in procurement process● Monitor commodity markets, pricing trends, and supply availability● Reporting on other methods of procurement ●Travel Management: Execution of travel related processes and procedures by facilitating day-to-day arrangements for all travel related activities, including flight arrangements, visa applications, vendor negotiations and contracts ● Contract Management: Provide oversight of the contract management process, as well as the development of specific standards for bidding and submission, contract negotiation, and document management● Ensuring that suppliers deliver against contractual SLAs and requirements of business units in achieving objectives● Managing escalations/disputes between Suppliers and Business users ● Supplier Development: Manage supplier relationships, including research, vetting, and performance evaluation ● On-board new clients with efficient sourcing, purchasing, and management of goods and services that meet the company's requirements and standards● Manages data, business partnerships and project opportunities required to meet metrics for success● Cultivate and manage relationships with suppliers and logistics companies to negotiate contracts and terms that benefit the organisation● Identify cost-saving opportunities while maintaining quality standards and ensuring timely delivery● Evaluate supplier performance and implement improvements or changes as necessary● Employee management: ? Lead, develop, and manage the human capital and ensure sound financial management of the unit.\n \nCLOSING DATE: 17 SEPTEMBER 2024\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                "ACCOUNTANT: FINANCIAL REPORTING & ASSETS MANAGEMENT \n\nSalary: R 724 287 basic salary P/A plus benefits (Centurion)\n \nRequirements: Degree or National Diploma in Accounting coupled with 5 to 6 years’ experience in the Accounting or Finance environment, of which two (2) years should be at the Team Leader or Supervisor level● Recognition of Prior Learning (RPL) and applicable knowledge and experience on the job may be considered during the selection process. \n \nEssential Criteria: ● Strong understanding of GRAP and PFMA regulations and their application in financial reporting● Proficiency in processing journal entries, managing accruals, trade payables, and preparing financial reconciliations ●Excellent attention to detail, with strong analytical and problem-solving skills ● Good communication skills, both verbal and written, with the ability to effectively interact with team members and other departments ● Ability to manage multiple tasks and meet deadlines in a fast-paced environment● Experience in document management and compliance with regulatory standards. \n \nKey Performance Areas: Assist in the preparation of financial statements, ensuring compliance with GRAP and PFMA ● Identify and resolve discrepancies in financial records, ensuring accuracy and reliability of financial information ● Process accruals for suppliers and manage the journal entries after approval from the Manager: Reporting & Assets Management ●Handle the processing of all recurring monthly journals, as well as the preparation of year-end and reallocation journals ● Manage and maintain accurate records of fixed assets, including acquisitions, disposals, and depreciation ●Conduct periodic analysis of asset data to identify and rectify discrepancies or irregularities ● Support the implementation of asset management policies and ensure that assets are properly accounted for according to Accounting standards ● Ensure all financial processes and records comply with auditing standards and regulatory requirements● Participate in the reconciliation of Balance Sheet accounts, ensuring accuracy and completeness ● Maintain process compliance by ensuring that all financial operations align with internal controls and policies ● Prepare and manage documentation for audits, ensuring timely and accurate submission of reports ● Assist in the resolution of audit queries, providing necessary information and documentation to internal and external auditors ● Support team productivity by ensuring timely completion of tasks and adherence to performance metrics ●Foster positive relationships with internal stakeholders by delivering high-quality financial reports and addressing queries promptly.\n \nCLOSING DATE: 17 SEPTEMBER 2024\n \nPLEASE APPLY HERE",
                "MANAGER: FINANCIAL REPORTING & ASSET MANAGEMENT \nAll-inclusive package of R 1 111 724 per annum (Centurion)\n \nRequirements: Degree or National Diploma in Accounting or Management Accounting, coupled with 6 to 8 years of experience in financial reporting and asset management within a large to medium-sized organizational environment (preferably in the public sector) of which two (02) years should be at the Team Leader or Supervisor level● Recognition of Prior Learning (RPL) and relevant knowledge and experience on the job may be considered during the selection process● Articles or professional accounting qualifications would be an added advantage. \n \nEssential Criteria: In-depth knowledge of GRAP/IFRS, King III/IV, PFMA, National Treasury Regulations, and the Preferential Procurement Policy Framework Act ●High proficiency with spreadsheet and accounting software programs ●Strong analytical and problem-solving skills, with the ability to conduct root cause analysis and identify opportunities for improvement ● Excellent verbal, written, and interpersonal communication skills ●Proven ability to lead and develop a finance team, with a focus on achieving accuracy, efficiency, and compliance. \n \nKey Performance Areas: Finance and bookkeeping: Coordinate the management of the trial balance to ensure that all items are correctly allocated● Preparation of the annual financial statements● Implementation of systems of internal controls ●Manage the asset life cycle and ensure adherence to budget provisions in liaison with the respective stakeholders● Review insurance and public liability claims, consolidate and present findings and trends to the Senior Manager ●Establish and maintain robust internal controls to safeguard company assets and ensure accurate financial reporting● Ensure that assets are accurately accounted for in accordance with the applicable GRAP accounting standards● Coordinating the preparation and submission of financial reports according to treasury regulations and guidelines ● Participate in the audit process to ensure that PSiRA receives an unqualified audit report● Ensure that internal and external audit queries are resolved timely and that information is provided ● Ability to promote teamwork ●Ability to take key decisions in complex situations and stand by decision/s taken.\n \nCLOSING DATE: 17 SEPTEMBER 2024\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "p48351bcf-a9a1-45cb-a68f-a0e6869841b9"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/quality-council-for-trades-occupations-qcto_orig.png",
            "href": "https://www.govpage.co.za/quality-council-for-trades-occupations-qcto-vacancies-blog/quality-council-for-trades-occupations-qcto-vacancies4467529",
            "title": "QUALITY COUNCIL FOR TRADES & OCCUPATIONS (QCTO) VACANCIES",
            "content": [
                " \nQUALITY COUNCIL FOR TRADES & OCCUPATIONS (QCTO)\n \n\nA UNIQUE OPPORTUNITY TO CONTRIBUTE TO NATION BUILDING\n\nThe vision of the Quality Council for Trades and Occupations (QCTO) is to qualify a skilled and capable workforce.\n\n\nThe QCTO is a Council established under the Skills Development Act for standards generation and quality assurance for all occupational qualifications.\n ",
                "The QCTO is looking for a highly motivated, competent, and professional individual to fill the following position:\n \nSYSTEMS DEVELOPER\nSalary Level\nR1,003,890.00 - R1,182,534.00\nLocation\nPretoria - GP ZA (Primary)\n \nJob Description\nA position exists at the QCTO for a Software Developer to build a software system to automate handling Learner information and results, NLRD uploads for historically registered qualifications, and other development work as assigned.\n \nKey functions:\nMaintain and improve the performance of existing software\nDesign, develop new systems and update software database\nRecommend improvements to existing software programs as necessary\nDevelop, maintain and run complex update procedures on databases from external sources\nDevelop, maintain and run complex extract procedures on databases and existing applications(MIS) to provide to users\nMaintain Participate in the design of complex, high-quality applications and relational database\nDevelop applications and components\nKnowledge of Software Integration\nProvide user support and technical consulting on QCTO’s Projects\nParticipate in gathering and analysis of user requirements\nTest and maintain complex software applications to ensure robust functionality and optimisation\n \nJob Requirements\nRequirements:\nA recognised three (3) year Degree in Computer Science, Information Technology or related field (minimum NQF Level 7) registered with occupational qualifications sub-framework (SAQA).\nAt least 6 years’ experience in programming with a primary emphasis on C#\nRelevant working experience with C#, ASP.NET, MVC, JavaScript, SharePoint\nExperience working with relational databases such as MSSQL or Oracle and a good working knowledge of SQL\nExperience in the Power Suite (PowerApps/Automate/BI) or willingness to undergo training is strongly recommended.\nExperience in mobile platform development will be an added advantage\n \nKnowledge in:\nMust have knowledge of Public Service and QCTO mandates and strategies. Relevant government legislation, QCTO business strategies and goals.\nQCTO business processes and value chain.\nSystem development, design principles, functionality and security management.\nTechnology infrastructure networking. User needs analysis, requirements, testing and work process automation.\n \nSkills required:\nMust have skills in Project and programme management.\nTechnology-related change management.\nBudgeting and financial management.\nProblem solving and analysis.\n Communication, Stakeholder engagement and management.\nSoftware performance.\nDatabase performance.\n Network design.\n Vendor relationships\nGood communication\n Presentation, analytical, planning, organising, problem-solving, customer interaction.\nAbility to work independently and multi-task effectively.\nA dynamic, energetic, self-starter, innovative and results-driven team player.\nAbility to train people, demonstrated understanding of projects from the perspective of both client and business.\nAbility to work under pressure and meet deadlines.\nWillingness to work long hours.\nAbility to remain abreast of trends and developments in web accessibility technologies.",
                "Closing Date: 27/9/2024\n \nQCTO is an equal opportunity employer committed to the principles of Employment Equity. We aim to promote equity through filling all numeric targets as contained in the Employment Equity Plan. To facilitate this process successfully, an indication of race, gender, and disability status is required. Preference will be given to underrepresented groups as per the QCTO Employment Equity targets. Women and people with disabilities are encouraged to apply.\n\nAPPLY TO THIS JOB"
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pcea0ea66-d0f7-4cdd-83c3-21d0d0ff510b"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sabc_orig.jpg",
            "href": "https://www.govpage.co.za/south-african-broadcasting-corporation-sabc-vacancies-blog/south-african-broadcasting-corporation-sabc-vacancies6858703",
            "title": "SOUTH AFRICAN BROADCASTING CORPORATION (SABC) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN BROADCASTING CORPORATION (SABC)\n \nAs we provide excellent and promising opportunities for individuals aspiring for development and advancement in Media careers, we're searching for people with the highest caliber to join SABC's workforce. If you wish to explore new career opportunities and your qualifications and experience match our requirements step forward and apply to join SABC.\n ",
                " \n \nRE-ADVERTISEMENT \n \nMANAGER : DIGITAL MARKETING  \nREPORT LINE: GROUP EXECUTIVE CORPORATE AFFAIRS & MARKETING\nDIVISION: CORPORATE AFFAIRS AND MARKETING\nSCALE CODE: 130\nPOSITION: 60017603\n \nCLOSING DATE: 16 October 2024\n \nMAIN PURPOSE OF POSITION \nReporting to GE Corporate Affairs and Marketing, the incumbent is responsible for planning, developing, implementing and managing the overall digital marketing strategy for the SABC in order to increase brand awareness, improve marketing and communication efforts and increase sale.  In addition, the role is responsible for keeping all internal digital teams abreast of technological developments in order to establish best practice for SABC digital marketing management.\n \nKEY ACCOUNTABILITIES\n \nDEVELOP AND IMPLEMENT STRATEGY\nProvide support and input in the development and implementation of the Corporate Affairs and Marketing strategy.\nDevelop Digital Marketing strategy in line with the Corporate Affairs and Marketing strategy.\nProvide strategic direction to SABC brands in terms of defining objectives, strategy and development of business strategies to be implemented on digital media platforms\nCascade Digital Marketing strategy across all SABC platforms\nReview and Report on the achievement of business units’ objectives\n \nBUSINESS OPERATIONAL EFFICIENCY\nBuild, plan and implement the overall digital marketing strategy\nDevelop and manage a CRM strategy for the SABC group\nDevelop and implement a paid media strategy for all digital campaigns\nManage all digital media buying activities for the\nManage uniformity across the rest of the digital teams within the sub-brands\nStay up to date with the latest technology and best practices\nManage and oversee different digital marketing channels including website performance, social platforms, ecommerce platforms, etc\nOversee all the company's social media accounts\nMeasure and manage online content\nTrack SEO and Google Analytics data and make complex analysis\nBuild an inbound marketing plan\nMeasure ROI and KPIs\nPrepare and manage digital marketing budget\nAnticipate sales performance trends\nLead digital marketing team\nResearch competition, investigate benchmarks and provide suggestions for improvement\n \nGOVERNANCE RISK AND COMPLIANCE\nDevelop and review internal control measures to ensure good governance.\nMonitor and report on the operational risk and compliance.\nImplement internal control measures to ensure good governance and compliance.\nOversee the management of digital stakeholder management risks to protect organisational integrity, create value, prevent financial loss and ensure compliance with applicable policies and legislations.\nMonitor compliance in line with OHS Act.\nMonitor execution of internal risk audits and address gaps and\n \nFINANCIAL MANAGEMENT\nOversee unit operational expenditure against approved budget and introduce corrective measures to ensure financial discipline and accountability.\nEnsure that the operational budget is managed in such a way as to assure no wasteful expenditure.\n \nSTAKEHOLDER MANAGEMENT\nBuild strong relationships with the SABCs digital stakeholders\nFoster relationships with key external stakeholders such as agencies, and other digital service providers\nPosition the SABC as the preferred digital media partner for commercial transactions across South Africa’s diverse market segments.\nLEADERSHIP AND PEOPLE MANAGEMENT\nEffective implementation of Performance Management System in accordance with organisational policy and procedures.\nEnsure adequate staffing for workload, succession planning and effective leadership.\nEffective briefing and communication with departmental staff.\nCareer Development Plans (CDP) for all staff members.\nProvide direction on the retention and attraction of staff.\nEnsure efficient management of staff, including succession planning and effective leadership.\nContract and Manage Performance Management System in accordance with organizational policy and procedures within the unit.\nManage all information sources and create good relationships with key business decision makers.\nCareer Development Plans (CDP) for all staff members..\n \nQUALIFICATIONS AND EXPERIENCE:\nBachelor’s degree in Marketing, digital marketing, Digital technologies, or a related field.\n7+ years marketing experience, with at least 3 years in middle-management\nRelevant Digital Marketing certifications\nDetailed knowledge of SEO Google Analytics and CRM software and web traffic metrics\n3 years of experience in developing and implementing digital marketing strategies\nGood knowledge of all different digital marketing channels\nGood knowledge and experience with online marketing tools and best practices\nFamiliarity with web design\nCritical thinker and problem-solving skills\nTeam player\nGood time-management skills\nGreat interpersonal and communication skills\n \nADVANTAGE:\nBroadcasting/Media/FMCG experience\nAdditional languages – South African and/or other African languages\n \n KNOWLEDGE:\nStrategic thinking\nSEO\nGoogle Analytics\nCRM software\nPFMA\nAnalytics\nProject Management\nBudget Management\nStakeholder management\nUnderstanding of applicable legislative frameworks and regulations – POPIA\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \n \nSALES ACCOUNT EXECUTIVE: ENTERPRISE AND CORPORATE X2\nDIVISION: SALES\nSCALE CODE: 402\nPOSITION ID: 60020169 & 60021282                \nLOCATION: JOHANNESBURG\nREPORTING LINE: SALES MANAGER: INLAND / SALES HEAD: COASTAL\n \nClosing date: 15 September 2024\n \nMAIN PURPOSE OF THE POSITION\nThe core function of this role is to sell audio/ visual / solutions within the SABC eco-system. The role primarily consists of managing and overseeing a portfolio of advertiser’s accounts and agencies. Accountability includes but not limited to being a liaison for clients and ensuring customer satisfaction by proactively addressing clients’ needs and facilitating the entire sale process. The role also entails growing new client bases and contributing to an increase in current sales levels to ensure achievement of revenue targets.\n \nKEY ACCOUNTABILITIES\nAchieve set targets by client within the given portfolio:\nIdentify and exploit new business opportunities.\nDevelop tailor-made sales opportunities and deals.\nPrepare and negotiate all sales deals including renewals and renegotiations within the    parameters of the governance prescripts.\nOffer a 360-degree solution across all platforms to address client’s needs.\nPackage and sell sponsorable programmes on respective platforms.\nDevelop innovative sponsorship opportunities.\nEducate client on all organisational platforms on a regular basis.\nFacilitate and understand analysis of competitive market in order to identify revenue opportunities.\nConduct need analyses of all client’s in portfolio in order to understand needs, identify opportunities.\nAction a client brief and produce relevant media solutions not limited to a specific platform.\nSource and evaluate lost /dropped business to determine reasons in order to re-establish business.\nFacilitate and understand information to ensure thorough knowledge of own platforms.\nLiaise with Product Managers regarding potential sponsorships opportunities within programmes.\nAccurate and consistent usage of all sales management systems e.g CRM & SAP to manage the sales processes end to end.\nCompile the quarterly reviews and negotiation documentation, on client history in preparation for reviews or negotiations.\nPlanning and Optimisation for clients upon request on available industry related planning and buying tools.\nProvide feedback to Senior Management & Client monthly with regards to tracking of commitments\nUpdate clients through proposals and presentations regarding opportunities.\nFollow up on all correspondence from clients and adherence to deadlines.\nCompile all Submissions and Term Sheets within respective portfolios as well as manage the long form contract process.\nUpdate electronic contracts register/commitment book monthly.\nSound administration as well as weekly and monthly status reporting.\nConduct a minimum number of client visits as agreed with respective line Manager\nDevelop and maintain effective working relationships with internal and external clients.\nMaintain after sales service by following up to ensure client satisfaction and future business within an agreed time frame directed by senior management.\nPrepare the Deal Evaluation, business case and secure approval.\n \nQUALIFICATIONS AND EXPERIENCE\nA relevant degree or diploma, (Sales/ Communication/ Marketing/other relevant preferable); and/ or\nSupplementary Media, Digital, Sales, and other relevant training courses and certificates; and\n6-8 years of sales/ sales management experience, (media sales preferable)\nProven track record in media sales\nKnowledge and experience in integrated / digital sales solutions would be advantageous.\nValid driver’s license & own transport.\n \nKNOWLEDGE AND RELATED SKILLS\nUnderstanding of broadcasting policies\nUnderstanding of the organisational brands\nKnowledge of industry systems\nProblem solving\nConflict Management\nPlanning and organisation\nWork under pressure and multi-task\nComputer skills – MS Word, Excel, PowerPoint, Internet, Outlook\nExcellent administrative skills\nConceptualization skills\nNegotiation skills\nPresentation skills\nExcellent time management skills\nGood interpersonal skills\nWorking on site predominantly\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \n \nPRODUCER\nDIVISION: Sport - Video Entertainment\nREPORT LINE: Executive Producer - Sport\nSCALE CODE: 403\nPOSITION ID: 60019649\nCLOSING DATE: 11 SEPTEMBER 2024\n \nMAIN PURPOSE OF POSITION\nTo plan, co-ordinate and produce live and magazine sport content / events of high quality in accordance with SABC editorial guidelines and standards.\n \nKEY ACCOUNTABILITIES:\nPrepare production and broadcast plans\nConceptualise programme ideas with production teams.\nOversee the process of production from inception to delivery.\nRecces and sport facilities visits.\nArrange and oversee production planning sessions.\nFacilitate and coordinate running orders.\nProduce, edit inserts, package and finalise programmes\nLead production process and oversee the logistical and admin through delegation duties.\nBrief and debrief editorial, production and technical meetings (on air talent).\nOversee on the schedule, work and freelance payments.\nProvide report after production highlighting challenges and achievements.\nAttend all meetings with the production team.\nCommunicate with other producers, Operations/logistics, marketing, scheduling and director productions.\nCommunicate with internal and external stakeholder.\nAdhere to SABC policies, broadcasting standard, editorial code etc.\nExecute necessary administrative procedures effectively for the smooth running of the production.\n \nREQUIREMENTS\nDegree or Diploma in Journalism or sport management or equivalent qualification\n          (NQF 6 /NQF 7)\n2- 3 years working experience in broadcasting environment.\nKnowledge of other editing software.\nUnderstanding of different sporting code/specs.\nUnderstanding of broadcasting formats\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                " \n \n \n \n \n \nASSIGNMENT EDITOR: CHANNEL AFRICA\nDIVISION: RADIO\nREPORT LINE: EDITOR: NEWS & CURRENT AFFAIRS\nSAP POSITION ID: 60023059\nSCALE CODE: 300\n \nClosing Date: 11 September 2024\n \nMain purpose of position\nTo provide a newsgathering service that identifies and breaks news stories, by directing the assigning, briefing and debriefing of reporters. \n \nKey Accountabilities\nContinually identify or initiate key news stories.\nCost-effectively manage and utilise the editorial budget.\nPlan, organise and co-ordinate the daily news diary.\nMonitor the production, editorial content and progress of stories.\nEnsure stories are ready for news bulletins in accordance with agreed deadlines\nClearly and specifically brief and debrief journalists/teams on story editorial content.\nAssign journalists according to their skills, strengths and competence\nEncourage use of online media to break and update stories.\nIdentify and recruit talented radio news reporters.\nGuide, develop, coach and mentor news reporters (assess developmental needs).\nManage and improve performance of radio news reporters\nAct as gatekeeper by providing quality control function for focus, script and sound.\nAttend and brief editorial meetings on planned stories.\nQuality check correspondent packages against assignments.\nAdhere to changes to schedule and time of broadcast.\nLiaise and co-ordinate in time with technical producers for all live crossings.\nPre-approve story lines for live studio crossings.\nAttend to internal and external customers/clients queries/ complaints.\nNetwork with other newsmakers and sources of news.\nCommunicate with other news outlets inside and outside the SABC.\nDetermine and service customers/clients’ needs.\nContract with team on the SABC’s Performance Management System in accordance with the organizational policy and procedures.\nAllocate responsibilities and schedule team in a fair and transparent manner.\nCoach, mentor and develop the team.\nProvide input in the retention and attraction of staff.\nManage employee relations to ensure conducive and productive working environment.\nOversee the implementation of organisational development initiatives were required i.e. Wellness, Employment Equity, Career Progression, Talent Management, and Human Capital Planning etc.\n \nRequirements:\nDegree or National diploma in Journalism or related qualification (NQF level 6)\n 3-5 years’ experience in news broadcasting environment.\nKnowledge and understanding of broadcasting standards, Policies and SOP’s.\nAdvanced understanding of SABC radio broadcasting operations.\nGood understanding of equipment and facilities within the radio broadcasting environment.\nGood sense of news and socio-political issues in Africa.\nExcellent English communication (including writing) skills.\nProblem solving skills.\nKnowledge and understanding of transmission value chain\nKnowledge and understanding of play-out and recording systems e.g. Dalet or Dira!\nKnowledge and understanding of different types of productions e.g. Informal Knowledge Building versus Sport versus Current affairs.\n \nPLEASE APPLY HERE\n \n \n \n \n \n ",
                "RE-ADVERTISEMENT\n \nSAP ABAP DEVELOPER\nDIVISION: FINANCE\nSCALE CODE: 900       \nREPORT LINE: HEAD ERP COE\nPOSITION ID: 60021013\n \nCLOSING DATE: 11 SEPTEMBER 2024\n \n2-year Fixed Term Contract\n \nMAIN PURPOSE OF THE POSITION\nDevelop and implement SAP enhancements and new functionalities in line with business requirements and best practice.\n \nKEY ACCOUNTABILITIES\nResponsible for the SAP Netweaver applications development in ECC, BW, and Enterprise Portal / UI5 Portal.\nDesign, build and test custom SAP technical solutions based on business requirements using ABAP OO, SAP UI5, SAP Fiori, SAP Web Dynpro and Dialog programmes.\nFull life-cycle SAP implementation including all custom reporting, interfaces, enhancements, forms, workflows (RICEFW) and portal configuration.\nInterface development and support using HTTP, XML, SOAP, Web Services, RFC, IDOCS and ABAP.\nCode, test and document ABAP enhancements for all SAP modules.\nSupport of development requirements in the following SAP modules: FI, HCM (incl. payroll), MM, SD, PS, PM, Travel, CO, any other SAP module implemented at the SABC.\nResponsible for troubleshooting and debugging of the SAP system.\nFacilitate continuous business improvement.\nFacilitate design sessions with SAP Functional Leads and business process owners in order to ensure best practice enhancements/implementations.\nEnsure proper technical impact assessment of all risks and issues and changes to scope, requirements or design. Provide advice on any avoidance, mitigation or remedial actions required.\nEnsure that development projects take full account of and correctly interface with existing systems, infrastructure and enterprise architecture.\nEnsure that all aspects of the developed software meet requirements and are in line with the agreed design e.g. data, user experience, architecture, security, quality & operations.\nEnsure adherence to internal development standards as well as global best practices.\nProvide documentation to manage handover activities so that software can transition smoothly from development into test and production environments.\nAdhere to the team’s quality objectives. Monitor and take responsibility for unit test coverage and completion to minimise defects in subsequent testing / production.\nCommit to the delivery of high-quality solutions. Ensure that development is carried out in accordance with agreed quality standards and procedures and that all new development goes through an appropriate testing process.\nFocus on customers and their requirements. Establish and maintain effective working relationships with customers, colleagues, senior management and software users to enhance design, development, deployment and maintenance activities.\nProactively keep abreast of industry developments, skills and technologies and share information, ideas and best practice with other development team members and ERP COE to improve skills and avoid single points of failure.\n \nQUALIFICATIONS AND EXPERIENCE\nProgramming diploma / degree or relevant qualification (NQF level 6/7\nMinimum of 10 years’ SAP ABAP development experience of which a minimum of 3 years should have been in a support or consulting environment\nExperience in SAP Fiori implementation - advantage\nCompleted SAP ABAP Academy – advantage\nCertification in other SAP modules – advantage\nGood understanding of key business processes and integration points – advantage\n \nPLEASE APPLY HERE",
                "AUDIO VISUAL IMAGING PRODUCER (UKHOZI FM)\nDIVISION: RADIO         \nREPORT LINE: PROGRAMME MANAGER\nSAP POSITION ID: 60017965\nSCALE CODE: 403\nRE-ADVERTISEMENT \n \nCLOSING DATE: 11 SEPTEMBER 2024\n \nMain purpose of position\nTo conceptualize, produce and deliver high quality Seasonal, Generic, Programme Specific and Campaign Specific multi-platform Imaging Material & Promos in line with the station’s sound and feel, programme briefs, campaign briefs and programming & marketing strategies.\n \nKey Accountabilities\nConceptualize, script, and produce cutting edge, top notch, break through generic, seasonal and thematic Station Imaging (jingles, promos, liners).\nPrepare/compile briefs for station’s brand and imaging campaigns.\nIdentify and utilize relevant voice overs in order to produce station imaging.\nReceive bookings and prepare for recordings, ensuring all equipment, facilities and resources are available for production, according to production specifications\nAssist in the planning, preparation, logistical arrangements and production of station promos\nEffective recording of productions, ensuring the optimal mix of all the sound for broadcast, recording and sound reinforcement, in order to optimally deliver on the production needs and requirements.\nContinually monitor the technical quality of recording, ensuring optimal quality of broadcast and adherence to broadcasting standards\nTimeous and accurate administration of production procedures, ensuring adherence to operational standards.\nEffective monitoring of technical quality and reporting of faults, in order to resolve any technical problems.\nEnsure effective informal and on-the-job training, to ensure a competent staff compliment.\nAdvise and assist on appropriate aspects, limitations, alternatives and utilisation of equipment to minimise mistakes and optimise and enhance product.\nProvide advice on aspects of quality control, in order to ensure the quality of broadcasts\nAssess and evaluate new equipment and provide feedback on suitability.\nEffective execution of daily administrative tasks to assist with the effective functionality of the section.\nExecute administrative procedures necessary for the smooth running of the business unit.\nEnsure timeous studio bookings to ensure delivery of promo materials according to agreed timelines.\nCreate and manage production schedules for recording of promos, liners and other imaging elements.\nProvide weekly and monthly imaging Reports, highlighting key milestones, challenges and achievements.\nCommunicate with internal and external stakeholders regularly to ensure timeous delivery of Imaging and promo materials as per brief.\nMaintain close working relationships with producers and production teams to ensure optimal delivery of generic and programme specific imaging.\nFacilitate and manage meetings with my production teams to go through creative briefs and generate creative concepts, angles and ideas for various show promos and Imaging.\nEngage with internal content contributors (News & CAFF, Sport and Commercial Enterprises) and go through various plans for the monthly content plans for imaging and promo alignment.\nProvide recordings as per brief from Sales for client campaigns.\nProvide post audio recordings or montages for client campaigns.\nCommunicate and schedule recordings with station voices.\n \nRequirements:\nNational Diploma or Degree in Sound Engineering or related discipline. (NQF level 6)\n4 years’ experience in broadcasting environment of which 2 years should be on radio technical production. \nProficiency in recording and editing software (i.e. pro tools, audacity, adobe etc).\nAbove average experience and knowledge of broadcasting production technology and digital media application\nAbove average proficiency of the English language (spoken and written) is essential\nAbility and willingness to work under pressure and on short notice\nGood research skills and ability to apply research information\nKnowledge of popular music and current affairs will be an advantage\nCandidate must have good command of IsiZulu both written and spoken\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "p1b42660a-d121-47b4-af8c-07a354f5b41a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/samsa_orig.png",
            "href": "https://www.govpage.co.za/south-african-maritime-safety-authority-samsa-vacancies-blog/south-african-maritime-safety-authority-samsa-vacancies1469358",
            "title": "SOUTH AFRICAN MARITIME SAFETY AUTHORITY (SAMSA) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN MARITIME SAFETY AUTHORITY (SAMSA)\n ",
                "DEPUTY REGISTRAR OF SEAFARERS GRADE: D1\nThe position reports to the Registrar of Seafarers.\nLOCATION: HEAD OFFICE, PRETORIA\n \nJOB PURPOSE\nTo support the Registrar in maintaining the register or registers of all certificates of competency, certificates of proficiency, certificates if equivalency and endorsements specified in STCW/F Convention, Regulations 3 and II/1 to II/6, IV/2 and Merchant Shipping (Certification, Training and Manning) Regulations 2021 and the Merchant shipping (National Small Vessel Safety) Regulations of 2007, as amended, Seafarer’s identity Documents Convention (Revised) 2003 (No.185).\n \nKEY PERFORMANCE AREAS\nTo assist the Registrar with certificates of competency, proficiency, endorsements, certificates of equivalency and ensure that they are issued in accordance with the Act and reflect the competencies of the seafarers.\nEnsure that Registers are secured, backed-up and updated continually.\nAdvice and assist with Investigation of fraudulent certificates of competency, proficiency, and endorsements.\nAdvise and assists the Registrar on matters dealing with changes and improvements in operating procedures, in corrective or preventive action. Coordinate the implementation of operation changes and procedures.\nEnsure that the services provided conform to the written operation procedures.\nDevelops and recommends operating/administrative/procedural changes.\nAssist in the formulation and implementation of departmental policies, practices and programs coordination and make recommendations to increase effectiveness and efficiency within the department.\nEnsure that all findings related to any Audit is properly and timeously closed out and identify the root causes of any findings to prevent any reoccurrence.\nCoordinate the work activities of any assigned employees, prioritizes and coordinates work assignments, reviews for accuracy and recommends improvements in workflow, procedures.\nAssist in the formulation and implementation of departmental policies, practices and programs coordination and make recommendations to increase effectiveness and efficiency within the department.\nEnsure that all findings related to any Audit is properly and timeously closed out and identify the root causes of any findings to prevent any reoccurrence.\nCoordinate the work activities of any assigned employees, prioritizes and coordinates work assignments, reviews for accuracy and recommends improvements in workflow, procedures.\nManage the Registry team on day-to-day, creating succession to key roles and enhancing departmental capability.\nLead the development of internal training and development programs.\nCultivate productive working relationships through the promotion of cross functional collaboration and teamwork.\nProvide clear direction on shared and departmental goals, including key performance indicators - translating and prioritising each through performance management.\nResolve employee grievances withing a specified timeframe.\nAddress poor behaviour through the Disciplinary and Grievance procedures with the guidance of Human Capital.\nCultivate positive behaviour in accordance with SAMSA Values.\n \nMINIMUM REQUIREMENTS\n\nQualifications\nDiploma/Degree in Maritime Studies\nSTCW Certificate of Competence an advantage at operational or management level.\n \nKnowledge and Experience\nPrevious supervisory experience preferably in a related field\nThree (3) years of experience at supervisory/management level\nThree (3) years’ experience in the Maritime Industry and dealing with seafarer-related matters.\n \nCompetencies\nHigh levels of competence on the skills below is a requirement:\nSound knowledge of Maritime Legislations and IMO Conventions and Protocols as amended wrt seafarers and fishers.\nTechnical knowledge of the following acts and regulations:\nSAMSA Act, 1998 (Act No. 5 of 1998) as amended.\nProtection of Personal Information Act.\nMerchant Shipping Act, 1951 (Act No 57 of 1951) as amended.\nPromotion of administrative justice Act 3 of 2000.\nMerchant Shipping (Certification, Manning, and Training) Regulations 2021, as amended.\nMerchant Shipping (National Small Vessel Safety) Regulations 2007, as amended.\nMaritime Labour Convention 2006.\nSeafarer’s identity Documents Convention (Revised) 2003 (No.185).\nPractical knowledge of quality assurance.\nSkilled at supervising a multidisciplinary team including standards & compliance, qualification & licensing, port regulatory & emergency response, enforcement & compliance, maritime security/safety, quality assurance and corporate service.\nWell-developed written and oral communication skills, interpersonal skills, and the ability to communicate effectively.\nPlanning and organisation skills.\nSound analytical and problem-solving skills.\nResearch skills.\nConflict management.\nComputer Literacy (MS Word, MS Excel, MS Power point, BI software).\nPractical knowledge in shipping.\n \nShould you meet the requirements as set out above, please e-mail your CV to Zanele Zwane at: recruitment@samsa.org.za\n \nAs we are committed to Employment Equity in our employment practices, it is our intention to appoint individuals with the aim of meeting our Equity objectives. Preference will be given to African Males, Indian Males and White Females to achieve the objectives of Employment Equity.\n \nCLOSING DATE: 16 SEPTEMBER 2024\n \nPlease note: SAMSA reserves the right not to make an appointment to any advertised position. No late applications will be considered. Psychometric and other assessments may be used as part of the selection process and all shortlisted candidates will be required to be available for the tests. If you have not been contacted within 1 month of the closing date as mentioned above, kindly deem your application unsuccessful.",
                "JUNIOR NAVAL ARCHITECT\nTYPE: Permanent \nGRADE: C4 OFFICE: Durban Office\n \nJOB PURPOSE\nThe purpose of this role is to scrutinize and approve ship’s stability information submitted by ship owners, to assign or check calculations to determine statutory freeboards in accordance with legislation, to calculate or check calculations to determine a ship’s tonnage in accordance with legislation and conventions, to generate policy by way of marine notices, circulars and provide guidance to surveyors by way of guidance notes and instructions.\n \nKEY PERFORMANCE AREAS\nRegistration & Licensing of ships: Determine and define the principal dimensions, tonnages and technical specifications/ characteristics of a vessel for approval by the Naval Architect, for the process of ship registration and licencing of vessels.\nNaval Architecture: Assess and comment on technical plans of vessels for the approval of the Naval Architect Vessel Plan Approvals.\nLegislation/Regulations: Identify shortcomings in existing legislation and generate proposed amendments of existing or the drafting of new legislation from a technical perspective. Draft Marine Notices, Circulars, guidance documents and procedures in support of existing legislation for the approval of the Naval Architect.\nAdministration: Assist in archiving and knowledge management. Attend committee meetings to contribute to technical and operational outcomes as requested by the Naval Architect.\nCasualty Investigations: Under the direction of the Naval Architect, assist surveyors with investigations into casualties of a specific technical nature where a naval architectural input is required.\n \nMINIMUM REQUIREMENTS\nBachelor of Science in Mechanical Engineering with MSc in Naval Architecture or Bachelor of Science in Naval Architecture\nPreference will be given to candidates registered with ECSA and SAIMENA\n3-5 Years of experience within the Maritime sector will be an added advantage.\n \n \nShould you meet the requirements as set out above, please e-mail your CV to Sithembile Lupindo at recruitment3@samsa.org.za\n\n \nAs we are committed to Employment Equity in our employment practices, it is our intention to appoint individuals with the aim of meeting our Equity objectives. Preference will be given to previously disadvantaged candidates to achieve the objectives of Employment Equity.\n \nCLOSING DATE: 18 September 2024\n \nPlease note: SAMSA reserves the right not to make an appointment to any advertised position. No late applications will be considered. Psychometric and other assessments may be used as part of the selection process and all shortlisted candidates will be required to be available for the tests. If you have not been contacted within 1 month of the closing date as mentioned above, kindly deem your application unsuccessful."
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pbd524b95-ee29-4bca-97b9-046923fdaf9b"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sasria_orig.png",
            "href": "https://www.govpage.co.za/south-african-special-risk-insurance-association-sasria-vacancies-blog/south-african-special-risk-insurance-association-sasria-vacancies3940642",
            "title": "SOUTH AFRICAN SPECIAL RISK INSURANCE ASSOCIATION (SASRIA) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN SPECIAL RISK INSURANCE ASSOCIATION (SASRIA)\n ",
                "INVESTMENT ANALYST\n \nDetails\nClosing Date 2024/09/20\nReference Number SAS240909-2\nJob Title Investment Analyst\nJob Type Permanent\nDivision Finance\nDepartment Investment Managements\nEE Occupational Levels Level 4 & 5: Skilled, Technical and Academically Qualified\nLocation - Town / City Sandton\nLocation – Province Gauteng\nLocation – Country South Africa\n \nJob Advert Summary\nThe Investment Analysts will assist the Senior Investment Manager in the implementation of the investment policy and investment strategy.\nPrepare investment performance monitoring and reporting.\nPrepare quarterly investment packs for Investment Steering Committee and Investment Committee.\nAssist with asset manager selection, appointment and monitoring.\nMonitoring and reconciling of Sasria’s investment accounting data.\nConduct asset manager due diligence exercises and reporting.\nAssist Sasria with ESG incorporation, responsible investment, and reporting.\nAssisting with Investment Statutory Reporting and Financials.\n \nMinimum Requirements\n \nMinimum Qualifications:\nRelevant B degree qualification (B Com/ BAcc)\nAdvantageous if the qualification is relevant to investments\n \nMinimum Experience:\nMinimum 2 years in an investment environment.\nPlease note that preference will be given to people with disabilities.\n \nDuties and Responsibilities\n \n1. Operational\nCompile data received from asset managers for reporting to Senior Investment Manager.\nReconcile data received from Asset managers vs what is received from the bank.\nMonitoring of post-trade mandate compliance.\nAssist in the preparation of investment commentary for monthly reporting to internal stakeholders.\nProvide investment portfolio information to the Senior Investment Manager for the actuarial team.\nPopulate data received from Actuarial department on market performance indicators on a monthly basis for investment workings.\nAssist in the preparation of monthly investment reports.\nAssist Investment Manager in the preparation of investment performance packs for Investment Steering Committee and Investment Committee.\nMaintain relationships with service providers for outsourced functions such as asset managers, asset consultants, investment administrators.\nResolving any investment related queries with, asset Managers, asset consultants, investment administrators.\nConsolidating, monitoring, and analysing investment data.\nReporting on Sasria’s investment portfolio and performance and Identification of investment risks and opportunities.\nAssisting the Head of investments with ad-hoc activities.\nMonitoring and Reporting of Investment Performance Reporting using StatPro Revolution.\nMonitoring of financial markets using Bloomberg.\n \n2. Financial & Statutory Reporting\nDaily Compilation of Asset managers data and calculation of Assets Under Management (AUM).\nMonthly and Quarterly investment reconciliations.\nMonth end Investment journals.\nMonthly invoices\nCompliance and Variance/Cash report\n \nPolicy\nWe are committed to Employment Equity when recruiting internally and externally. It is company policy to promote from within wherever possible. Therefore, please be aware that internal candidates will be considered first before reviewing external applicants, provided that this supports achievement of our Employment Equity goals.\n \nPLEASE APPLY HERE",
                "PROCESS ENGINEER\n \nDetails\nClosing Date 2024/09/20\nReference Number SAS240909-1\nJob Title Process Engineer\nJob Type Permanent\nDivision Business Change and Technology\nDepartment Applications\nEE Occupational Levels Level 6: Specialists\nLocation - Town / City Johannesburg\nLocation – Province Gauteng\nLocation – Country South Africa\n \nJob Advert Summary\nThe suitably qualified individual is required to oversee the design and implementation of our organisation processes, ensure optimal integration of processes, people and technology by interactively analysing, researching, designing, recommending and implementing innovative and efficient business processes.\n \nMinimum Requirements\n \nQualifications\nBachelor’s Degree in Business Management, Information Technology or Engineering \nPost graduate qualification is advantageous\n \nExperience\n5+ years relevant experience in processing systems, processes, procedures in a financial services/ insurance environment.\n \nDuties and Responsibilities\n \nProcess Engineering\n• Assess, configure, analyse, and document business processes. \n• Research best practices and innovative solutions. \n• Develop and monitor metrics to monitor and improve. \n• Identify and recommend opportunities for process improvement. \n• Facilitate process improvement initiatives. \n• Identify and manage process-related risks and controls. \n• Participate in technical solutioning and design.\n• Perform quality assurance on solution components developed.\n\n• Support deployment of solutions to development, test, and production environments. \n• Develop and maintain the necessary documentation for the solutions deployed. \n• Support technology implementation of both inhouse and/or external projects.\n• Ensure quality assurance of process projects. \n• Drive process improvement and innovation. \n• Process standardisation.\n• Facilitate the development of procedures. \n \n \nPolicy\nWe are committed to Employment Equity when recruiting internally and externally. It is company policy to promote from within wherever possible. Therefore, please be aware that internal candidates will be considered first before reviewing external applicants, provided that this supports achievement of our Employment Equity goals.\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pecd4a140-ae6f-4f05-9b57-6e807498012a"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/saws_orig.jpg",
            "href": "https://www.govpage.co.za/south-african-weather-service-saws-vacancies-blog/south-african-weather-service-saws-vacancies6553400",
            "title": "SOUTH AFRICAN WEATHER SERVICE (SAWS) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN WEATHER SERVICE (SAWS)\n \nPrivate Bag X097, Pretoria, 0001 • Tel: + 27 (0) 12 367 6000 • www.weathersa.co.za • USSD: *120*7297#\n \nThe South African Weather Service (SAWS) is a Section 3(a) public entity under the Ministry of Environment, Forestry and Fisheries (DEFF) and is governed by a Board. The organisation is an authoritative voice for weather and climate related services in South Africa and is a member of the World Meteorological Organisation (WMO) to fulfil a range of international obligations of the government. South African Weather Service (SAWS) strives to be a Weather and Climate Centre of Excellence providing innovative solutions to ensure a weather-smart region, sustainable development and economic growth.\n ",
                " \n \nThe South African Weather Service (SAWS) is therefore seeking to appoint an efficient and enthusiastic person to undertake the role of:\n \nCHIEF METEOROLOGICAL TECHNICIAN\nSalary: Negotiable\nCentre: Bethlehem Office (Ref. WS07/092024)\n \nKey Performance Areas:\n• Provide supervisory and technical oversight of Meteorological Observations activities performed within the Office.\n• Ensures that all systems and processes involved in Meteorological Observations are performed according to prescribed criteria and that all staff involved are informed of the most current methods and equipment that is employed for these purposes.\n• Provide training of staff on the operations of network nodes and instrumentation with the aim of enabling competence in routine maintenance and use.\n• Develop and maintain documents to support activities mentioned above and maintain the necessary records to prove system adherence and compliance with documented requirements.\n• Responsible for the installation, maintenance and repair of meteorological equipment, including upgrades, in line with applicable international and national standards.\n \nObservation:\n• Perform routine weather observation duties that include:-\n• Visual weather observation and compile routine reports,\n• Providing special reports for changes in weather.\n• Providing observation reports timeously as per schedule or as per the timeliness of the client’s request\n• Downloading of remote observation station data\n• Collection and quality control of manual rainfall station\n• Supervise and perform quality control of AWS and ARS data and transmission thereof to central data base\n• Ensure planned inspection and cleaning of Solys and Biomet stations is carried out timeously.\n• Prepare and submit monthly status reports on Research equipment, e.g Solys, Biomet, etc Second level quality control of data on Quality control done by meteorological Technicians\n• Upkeep of the infrastructure maintenance plan and ensure adherence within stipulated timeframes.\n• Perform routine and ad hoc maintenance of SAWS Observations infrastructure (Thorough understanding of Automatic Weather Stations is required)\n• Keep up breast with the latest developments in weather observational equipment and technologies.\n \nInternal and External Customer Relations:\n• Liaise with clients as per office plan.\n• Represent SAWS at Stakeholder meetings as per plan.\n• Financial and General Administration:\n• Assist in the control of acquired stock levels required for operational activities.\n• Assist in the effective use of assets and key infrastructure.\n• Perform routine office administration practices including lodging claims, leave processing, overtime, transport admiration, periodic reporting, administration of registers etc.\n• Training, Development and Knowledge Management\n• Assist in all training activities related to weather observation within the office.\n• Provide mentorship, skills transfer and training to meteorological technicians.\n \nTotal Quality Management\n• Apply prevention and corrective action procedures on all findings related to weather observation.\n• Promote a quality culture amongst the staff within the office.\n• Promote the SAWS Quality Policy and integrate into day-to-day activities of the office\n• Provide assistance during audits of the Regional office as required.\n• Perform regular inspections to ensure all work done is according to documented requirements.\n• Ensure that the work environment complies with legislative requirements relations to OHS.\n \nMinimum Requirements and Attributes:\n• A Grade 12 Certificate with Maths and Science.\n• Weather Observers certificate and a valid AMO competency certificate.\n• Five years’ experience in a weather observation environment and preferably as a Senior Meteorological Technician.\n• Ability to read, analyse and interpret written request for weather data and information.\n• Ability to lead and work in a team.\n• Knowledge of international standards such as WMO and ICAO.\n• Advanced knowledge of all observation tools.\n• A valid code 08 driver’s license or higher.\n \nPlease Note:\nEnquiries for the above-mentioned positions must be directed to: Mr. Denny Maluleke, at Tel. (012) 367 6091.\n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above position and upload your (Comprehensive CV with certified copies of qualifications). \n \nClosing Date: 13 September 2024 \n \nNote: Recruitment Agency applicant submissions will not be considered \n \nThis is an EE position and preference will be given to African Males and Females, Coloured Males/Females and Indian Males/Females. Correspondence will be limited to short listed candidates only. Candidates who have not been contacted within 3 months after the closing date of this advertisement, please accept that your application was unsuccessful. The organisation reserves the right not to fill this position. The South African Weather Service is an equal opportunity employer. Record Reference       HCM-ADVERT-CMT2024\n \n \n \n \n ",
                " \n \n \n \n \nThe South African Weather Service (SAWS) is therefore seeking to appoint an efficient and enthusiastic person to undertake the role of: \n \nFORECASTER (LEVEL 9) - DRR \nSalary total package: Negotiable \nCentre: Head office, Centurion (Ref. WS05/092024) \n \nJob summary: \nThe forecaster is a shift-worker primarily responsible for forecasting and monitoring of weather, producing of weather forecasting products as well as severe weather warnings. \n \nForecasting and Warning Services: \nGenerate and quality control public weather forecasts according to pre-determined time scales. These include commercial products and services. \nCommunicate public weather forecasts and severe weather warnings in different media platforms. \n \nInternal and External Customer Relations: \nLiaise with clients as per office plan. \nRepresent SAWS at Stakeholder meetings. \nPromote the awareness of SAWS products and services to all stakeholders. \n \nAdministration:\n• Perform routine office administration practices including periodic reporting, leave processing, administration of registers, transport administration, etc.\n• Assist in the control of acquired stock levels required for operational activities.\n• Assist in the effective use of assets and key infrastructure.\nTraining, Development and Knowledge Management:\n• Assist in all training activities related to weather forecasting within the office.\n• Provide mentorship and training to junior personnel.\n• Conduct case-studies and other research to enhance the accuracy and quality of the products and services offered.\n \nTotal Quality Management:\n• Develop and review meteorological processes and procedures.\n• Promote the SAWS Quality Policy and intergrade it into the day-to-day activities of the office.\n• Provide assistance during audits of the office as required.\n• Perform regular inspections to ensure all work done is according to documented requirements.\n• Ensure that the work environment complies with legislative requirements in relation to Occupational Health and Safety.\n• Promote a quality culture amongst the staff within the office.\n \nMinimum Requirements and Attributes:\n• BSc Honours Degree in Meteorology or equivalent\n• 3 years Weather Forecasting experience.\n• Ability to analyse and interpret weather charts, surface observations, upper air observations, weather codes, weather satellite and radar imageries.\n• Ability to analyse Numerical Weather Prediction and Ensemble Prediction System products to produce weather forecasts and warnings.\n• Comprehensive understanding of Impact-based forecasting.\n• Excellent communication skills (written and verbal).\n• Ability to work well under pressure.\n• Clear understanding of SAWS policies\n• Willingness to work shifts, weekends, and public holidays.\n• Excellent corporate communications skills (written and verbal)\n• Computer Skills (Ms Word, Excel, PowerPoint)\n• Be able to respond well to pressure.\n• A valid Code EB or Code 08 driver’s license (without endorsements).\n• Have own reliable transport.\n \n \nPlease Note: \nEnquiries for the above-mentioned positions must be directed to: Ms Thembisa Bixa, at Tel. (012) 367 6091. \n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above position and upload your (Comprehensive CV with certified copies of qualifications). \n \nClosing Date: 20 September 2024 \n \nNote: Recruitment Agency applicant submissions will not be considered \n \nPreference will be given to People living with disabilities in line with SAWS EE targets. This is an EE position and preference will be given to females, Africans, Indians and Coloureds (AIC). Correspondence will be limited to short listed candidates only. Candidates who have not been contacted within 3 months after the closing date of this advertisement, please accept that your application was unsuccessful. The organisation reserves the right not to fill this position. The South African Weather Service is an equal opportunity employer. \n \nRecord Reference HCM-ADVERT-FORECASTER2024\n \n \n \n \n ",
                " \n \n \n \n \nThe South African Weather Service (SAWS) is therefore seeking to appoint an efficient and enthusiastic person to undertake the role of:\n \nMETEOROLOGICAL TECHNICIAN\nSalary: Negotiable\nCentre: Cape Town Weather Office\n(Ref: WS03/092024)\n \nObservation:\n• Perform routine weather observation duties that include: -\nVisual weather observation and compile routine reports,\nProviding special reports for changes in weather.\nProviding observation reports timeously as per schedule or as per the timeliness of the client’s requests\nDownloading of remote observation station data\nCollection and quality control of manual rainfall station\nQuality control of AWS and ARS data and transmission thereof to central data base\n• Perform routine and adhoc maintenance of SAWS Observations infrastructure (Thorough understanding of Automatic Weather Stations is required)\n \nInternal and External Customer Relations:\n• Liaise with clients as per office plan.\n• Represent SAWS at Stakeholder meetings as per plan.\n \nTotal Quality Management\n• Apply prevention and corrective action procedures on all findings related to weather observation.\n• Promote a quality culture amongst the staff within the office.\n• Promote the SAWS Quality Policy and intergrade it into the day-to-day activities of the office\n• Provide assistance during audits of the regional office as required.\n• Perform regular inspections to ensure all work done is according to documented requirements.\n\n• Ensure that the work environment complies with legislative requirements relations to OHS.\n \nMinimum Requirements and Attributes:\n• A Grade 12 Certificate with Maths and Science.\n• Weather Observers certificate.\n• Ability to obtain a competent Aviation Meteorological Observation (AMO) certificate within 6 months of employment.\n• Ability to read, analyse and interpret written request for weather data and information.\n• Knowledge of international standards such as WMO and ICAO. Advanced knowledge of observation tools.\n• A valid code 08 driver’s license or be in a position to obtain a valid driver’s license within 3 months of employment.\n \n \nPlease Note: \nEnquiries for the above-mentioned positions must be directed to: Ms. Nokubonga Mkhize, at Tel. (012) 367 6091. \n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above position and upload your (Comprehensive CV with certified copies of qualifications). \n \nClosing Date: 13 September 2024 \n \nNote: Recruitment Agency applicant submissions will not be considered \n \nPreference will be given to People living with disabilities in line with SAWS EE targets. This is an EE position and preference will be given to females and males, Africans, Indians and Coloureds (AIC). Correspondence will be limited to short listed candidates only. Candidates who have not been contacted within 3 months after the closing date of this advertisement, please accept that your application was unsuccessful. The organisation reserves the right not to fill this position. South African Weather Service is an equal opportunity employer. \n \nRecord Reference HCM-ADVERT-MT09/2024\n \n \n \n \n \n ",
                " \n \n \n \n \n \nThe South African Weather Service (SAWS) is therefore seeking to appoint an efficient and enthusiastic person to undertake the role of:\n \nMETEOROLOGICAL TECHNICIAN\nSalary: Negotiable\nCentre: De Aar Weather Office\n(Ref: WS02/092024)\n \nObservation:\n• Perform routine weather observation duties that include: -\nVisual weather observation and compile routine reports,\nProviding special reports for changes in weather.\nProviding observation reports timeously as per schedule or as per the timeliness of the client’s requests\nDownloading of remote observation station data\nCollection and quality control of manual rainfall station\nQuality control of AWS and ARS data and transmission thereof to central data base\n• Perform routine and adhoc maintenance of SAWS Observations infrastructure (Thorough understanding of Automatic Weather Stations is required)\n \nInternal and External Customer Relations:\n• Liaise with clients as per office plan.\n• Represent SAWS at Stakeholder meetings as per plan.\n \nTotal Quality Management\n• Apply prevention and corrective action procedures on all findings related to weather observation.\n• Promote a quality culture amongst the staff within the office.\n• Promote the SAWS Quality Policy and intergrade it into the day-to-day activities of the office\n• Provide assistance during audits of the regional office as required.\n• Perform regular inspections to ensure all work done is according to documented requirements.\n• Ensure that the work environment complies with legislative requirements relations to OHS.\n \nMinimum Requirements and Attributes:\n• A Grade 12 Certificate with Maths and Science.\n• Weather Observers certificate.\n• Ability to obtain a competent Aviation Meteorological Observation (AMO) certificate within 6 months of employment.\n• Ability to read, analyse and interpret written request for weather data and information.\n• Knowledge of international standards such as WMO and ICAO. Advanced knowledge of observation tools.\n• A valid code 08 driver’s license or be in a position to obtain a valid driver’s license within 3 months of employment.\n \n \nPlease Note: \nEnquiries for the above-mentioned positions must be directed to: Ms. Nokubonga Mkhize, at Tel. (012) 367 6091. \n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above position and upload your (Comprehensive CV with certified copies of qualifications). \n \nClosing Date: 13 September 2024 \n \nNote: Recruitment Agency applicant submissions will not be considered \n \nPreference will be given to People living with disabilities in line with SAWS EE targets. This is an EE position and preference will be given to females and males, Africans, Indians and Coloureds (AIC). Correspondence will be limited to short listed candidates only. Candidates who have not been contacted within 3 months after the closing date of this advertisement, please accept that your application was unsuccessful. The organisation reserves the right not to fill this position. South African Weather Service is an equal opportunity employer. \n \nRecord Reference HCM-ADVERT-MT09/2024\n \n \n \n \n \n ",
                "The South African Weather Service (SAWS) is therefore seeking to appoint an efficient and enthusiastic person to undertake the role of:\n \nSENIOR FORECASTER – DRR X2\nSalary total package: Negotiable\nCentre: Head office, Centurion (Ref. WS06/092024)\n \nJob summary:\n• The Senior Forecaster is a shift-worker primarily responsible for forecasting and monitoring of weather, producing of weather forecasting products as well as severe weather warnings.\n• S/He is also required to provide a supervisory and technical oversight of weather forecasting activities performed in the office and in regional forecasting offices.\n \nForecasting and Warning Services:\n• Supervise, generate and quality control public and marine weather forecasts according to pre-determined time scales. These include commercial products and services.\n• Communicate public weather forecasts and severe weather warnings in different media platforms.\n \nInternal and External Customer Relations:\n• Liaise with clients as per office plan.\n• Represent SAWS at Stakeholder meetings.\n• Promote the awareness of SAWS products and services to all stakeholders.\n \nAdministration:\n• Perform routine office administration practices including periodic reporting, leave processing, administration of registers, transport administration, etc.\n• Assist in the control of acquired stock levels required for operational activities.\n• Assist in the effective use of assets and key infrastructure.\n• Perform supervisory duties.\n \nTraining, Development and Knowledge Management:\n• Assist in all training activities related to weather forecasting within the office.\n• Provide mentorship and training to junior personnel.\n• Conduct case-studies and other research to enhance the accuracy and quality of the products and services offered.\n \nTotal Quality Management:\n• Develop and review meteorological processes and procedures.\n• Promote the SAWS Quality Policy and intergrade it into the day-to-day activities of the office.\n• Provide assistance during audits of the office as required.\n• Perform regular inspections to ensure all work done is according to documented requirements.\n• Ensure that the work environment complies with legislative requirements in relation to Occupational Health and Safety.\n• Promote a quality culture amongst the staff within the office.\n \nMinimum Requirements and Attributes:\n• BSc Honours Degree in Meteorology or equivalent\n• 5 years Weather Forecasting experience.\n• Ability to analyse and interpret weather charts, surface observations, upper air observations, weather codes, weather satellite and radar imageries.\n• Ability to analyse Numerical Weather Prediction and Ensemble Prediction System products to produce weather forecasts and warnings.\n• Comprehensive understanding of Impact-based forecasting.\n• Excellent communication skills (written and verbal).\n• Ability to work well under pressure.\n• Clear understanding of SAWS policies\n• Basic understanding of Public Finance and Management Act\n• Willingness to work shifts, weekends, and public holidays.\n• Excellent corporate communications skills (written and verbal)\n• Computer Skills (Ms Word, Excel, PowerPoint)\n• Be able to respond well to pressure.\n• Have own reliable transport.\n• A valid Code EB or Code 08 driver’s license (without endorsements).\n \n \nPlease Note: \nEnquiries for the above-mentioned positions must be directed to: Ms Thembisa Bixa, at Tel. (012) 367 6091. \n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above position and upload your (Comprehensive CV with certified copies of qualifications). \n \nClosing Date: 20 September 2024 \n \nNote: Recruitment Agency applicant submissions will not be considered \n \nPreference will be given to People living with disabilities in line with SAWS EE targets. This is an EE position and preference will be given to females, Africans, Indians and Coloureds (AIC). Correspondence will be limited to short listed candidates only. Candidates who have not been contacted within 3 months after the closing date of this advertisement, please accept that your application was unsuccessful. The organisation reserves the right not to fill this position. The South African Weather Service is an equal opportunity employer. \n \nRecord Reference HCM-ADVERT-SNR FORECASTER2024",
                "The South African Weather Service (SAWS) is therefore seeking to appoint an efficient and enthusiastic person to undertake the role of:\n \nSENIOR METEOROLOGICAL TECHNICIAN\nSalary: Negotiable\nCentre: Cape Town Weather Office (Ref: WS01/092024)\n \nJob summary:\nThe Senior Meteorological Technician provides technical leadership in the operations of Meteorological Observations performed within the abovementioned region.\n \nObservation:\n• Perform routine weather observation duties that include:-\nVisual weather observation and compile routine reports,\nProviding special reports for changes in weather.\nProviding observation reports timeously as per schedule or as per the timeliness of the clients request\nDownloading of remote observation station data\nCollection and quality control of manual rainfall station\nQuality control of AWS and ARS data and transmission thereof to central data base.\n• Perform routine and adhoc maintenance of SAWS Observations infrastructure (Thorough understanding of Automatic Weather Stations is required).\n \nInternal and External Customer Relations:\n• Liaise with clients as per office plan.\n• Represent SAWS at Stakeholder meetings as per plan.\n \nTraining, Development and Knowledge Management\n• Assist in all training activities related to weather observation within the office.\n• Provide mentorship and training to meteorological technician.\n \nTotal Quality Management\n• Apply prevention and corrective action procedures on all findings related to weather observation.\n• Promote a quality culture amongst the staff within the office.\n• Promote the SAWS Quality Policy and intergrade it into the day-to-day activities of the office\n• Provide assistance during audits of the regional office as required.\n• Perform regular inspections to ensure all work done is according to documented requirements.\n• Ensure that the work environment complies with legislative requirements relations to OHS.\n \nMinimum Requirements and Attributes:\n• A Grade 12 Certificate with Maths and Science.\n• Weather Observers certificate and an AMO competency certificate.\n• Two years’ experience in observation as a Meteorological Technician.\n• Ability to read, analyse and interpret written request for weather data and information.\n• Knowledge of South African Weather Service policies and procedures.\n• Knowledge of international standards such as WMO and ICAO, Advanced knowledge of observation tools.\n• A valid code 08 driver’s license or higher.\n \n \nPlease Note:\nEnquiries for the above-mentioned positions must be directed to: Ms. Nokubonga Mkhize, at Tel. (012) 367 6059.\n \nRegister as user on our website using this link: https://www.weathersa.co.za/home/vacancies to apply for the above position and upload your (Comprehensive CV with certified copies of qualifications).\n \nClosing Date: 13 September 2024\n \nNote: Recruitment Agency applicant submissions will not be considered\n \nThis is an EE position and preference will be given to African females and males, Coloured females and males, Indian females and males. Correspondence will be limited to short listed candidates only. Candidates who have not been contacted within 3 months after the closing date of this advertisement, please accept that your application was unsuccessful. The organisation reserves the right not to fill this position. The South African Weather Service is an equal opportunity employer.\n \nRecord Reference HCM-ADVERT-SMT2024"
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pc466fb0b-12e5-4f50-95e6-f17ec6d3b0bd"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/special-investigating-unit-siu_orig.png",
            "href": "https://www.govpage.co.za/special-investigating-unit-siu-vacancies-blog/special-investigating-unit-siu-vacancies9046357",
            "title": "SPECIAL INVESTIGATING UNIT (SIU) VACANCIES",
            "content": [
                " \nSPECIAL INVESTIGATING UNIT (SIU)\n ",
                "SENIOR PRACTITIONER: EXTERNAL COMMUNICATIONS X1 (SIU24/02/013)\n \nOverview\nReference SIU24/02/013\nSalary ZAR574,463 - ZAR781,364/annum + incl. Medical Aid Allowance\nJob Location - South Africa -- Tshwane Metro -- Pretoria\nJob Type Permanent\nClosing date 13 Sep 2024 21:59\n \nMain purpose: To provide coordinated, consistent communication services that ensure smooth relations with the media, as well as contact the public through established SIU platforms.\n \nMinimum qualification and experience: Bachelor’s Degree or National Diploma in Communication, Journalism, Media Studies or Media Relations (NQF 6/7). Three years’ experience in Communications.\n \nKey performance areas (Include but not limited to): Support services to the spokesperson. Manage external communication. Branding support.\n \nTechnical skills: Excellent grammar skills. Excellent communication skills (oral and written). Team player. Time-management skills. Computer skills (MS suited. Research skills.\n \nRequired knowledge and Behavioural (include but not limited to): Knowledge of Government Communication and information systems. Knowledge of South Africa’s legal system. Accuracy. Attention to detail. Commitment. Resilience. Judgement and decision making. Analytical skills. Innovative. Creativity.\n \n \nPLEASE NOTE:\nThe appointment of candidates will be at the Unit’s sole discretion and the Unit reserves the right not to make an appointment.\nThe SIU is an Anti-Corruption Investigating Unit and requires applicants to make a full and frank disclosure in their application form.\nFraudulent qualifications or documentation will automatically disqualify candidates.\nAll candidates will be subjected to integrity screening procedures and a favourable end report is essential.\nOther critical positions may be subjected to vetting procedures after appointments.\nCorrespondence will be limited to shortlisted candidates only. Please be advised that applications received mean that processing may take some time. Candidates who have not been contacted within three (3) months of the closing date should consider their applications unsuccessful.\nPOPIA disclaimer: In line with the Protection of Personal Information Act, 4 of 2013 by applying for this position it is accepted that you have consented to your personal information being used and kept for the purposes of processing your application. The SIU will ensure the protection and safeguarding of personal information and all information collected will not be shared with any third parties or be used for purposes other than for the purpose it was intended.\nThe SIU is committed to equality, employment equity and diversity.  Preference will be given to persons from designated groups in particular Africans and people with disabilities in line with the SIU Employment Equity Plan.\nThe salary offered will be in line with SIU approved salary scales, which may change subject to relevant approvals and annual increases.\nLate applications will not be considered after the closing date.\n\nAPPLY",
                "JUNIOR FINANCIAL ACCOUNTANT: AOD X1 (SIU23/11/002)\n \nOverview\nReference SIU23/11/002\nSalary ZAR574,463 - ZAR781,364/annum + incl. Medical Aid Allowance\n\nJob Location - South Africa -- Tshwane Metro -- Pretoria\nJob Type Permanent\nClosing date 13 Sep 2024 21:59\n \nMain purpose: Management of revenue and debtors’ book in line with policies, procedures, SOPS and all legislative requirements within the SIU.  \n \nMinimum qualification and experience: B Degree or Diploma in Accounting (NQF 6/7). Three years’ experience in revenue/debtors’ management and general financial and management accounting in a supervisory level.\n \nKey performance areas (Include but not limited to): Extensive knowledge of revenue and debt management, Acknowledgement of Debt (AOD), supervision of sub-ordinates and reporting.  \n \nTechnical skills: Analytical. Communication. Interpersonal. Planning and organising. Time management. Attention to details.\n \nRequired knowledge and Behavioural (include but not limited to): Knowledge of financial legislation and regulations governing the public sector (i.e PFMA, Treasury Regulations). Knowledge of IFRS and GRAP statements. Knowledge of accounting systems. Intermediate MS Office proficiency. Attention to detail. Accuracy. Deadline driven. Integrity / Honesty. Work under pressure. Reliable. Team Player.\n \nPLEASE NOTE:\nThe appointment of candidates will be at the Unit’s sole discretion and the Unit reserves the right not to make an appointment.\nThe SIU is an Anti-Corruption Investigating Unit and requires applicants to make a full and frank disclosure in their application form.\nFraudulent qualifications or documentations will automatically disqualify candidates.\nAll candidates will be subjected to integrity screening procedures and a favourable end report is essential.\nOther critical positions may be subjected to vetting procedures after appointments.\nCorrespondence will be limited to shortlisted candidates only. Please be advised that applications received means that processing may take some time. Candidates who have not been contacted within three (3) months of the closing date should consider their applications unsuccessful.\nPOPIA disclaimer: In line with Protection of Personal Information Act, 4 of 2013 by applying for this position it is accepted that you have consented to your personal information being used and kept for the purposes of processing your application. The SIU will ensure the protection and safeguarding of personal information and all information collected will not be shared with any third parties or be used for the purposes other than for the purpose it was intended.\nThe SIU is committed to equality, employment equity and diversity.  Preference will be given to persons from designated group in particular Africans and people with disabilities in line with the SIU Employment Equity Plan.\nThe salary offered will be in line with SIU approved salary scales, which may change subject to relevant approvals and annual increases.\nLate applications will not be considered after the closing date.\n\nAPPLY"
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "p38731085-b5e2-47b2-a074-f55fed0e1cde"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sita_orig.jpg",
            "href": "https://www.govpage.co.za/state-information-technology-agency-sita-vacancies-blog/state-information-technology-agency-sita-vacancies2649809",
            "title": "STATE INFORMATION TECHNOLOGY AGENCY (SITA) VACANCIES",
            "content": [
                " \nSTATE INFORMATION TECHNOLOGY AGENCY (SITA)\n ",
                "VACANCY - 1877 \nRE ADVERTISEMENT \nREFERENCE NR : VAC00836/23 \nJOB TITLE : Senior Software Developer \nJOB LEVEL : D2 \nSALARY : R 651 627 - R 977 440 \nREPORT TO : Technical Manager \nDIVISION : ADM: Exec Apps Development & Maintain \nDEPT : ADM: AM: Digital Services \nLOCATION : SITA Centurion \nPOSITION STATUS : 12 months Fixed term contract (Internal & External) \n \nPurpose of the job \nTo lead the design, implementation, debugging, documentation, release and maintenance of software-based solutions, write code and enhance software/systems in accordance with ICT standards and the enterprise architecture for Government. \n \nKey Responsibility Areas \nLead the design and development of new features for the software systems, and improvement of the existing ones; \nImplementation, debugging, documentation and release of the software solutions; \nProvide maintenance and enhancement support of the existing systems; \nPerform software systems coding assignments; and \nSupervision of the Software development team. \n \nQualifications and Experience \nMinimum: 3 years National Diploma/ Bachelor's degree in ICT (Computer Science, Information Systems, Technology and Engineering) or related field. \nExperience: 6-7 years’ experience with full software development lifecycle (SLDC), including solution development, operational responsibility in a large corporate/public sector organisation. The experience must include: Good solid programming Skills and understanding of the LIMS Basic language and Oracle database is essential and required. Experience in Database will be an advantage. Experience in solution analysis, and development for the development, implementation and maintenance/enhancements of systems within the corporate/public sector, including: Successfully developed and implemented applications Software development team leadership competency Software development deliverable effort planning, estimations and execution management Developed efficient and effective IT solutions to diverse and complex business problems. Extensive experience with a wide variety of database management systems and maintenance. Extensive experience with a wide variety of programming languages and technologies. Extensive experience with working on multiple tasks and report status. Experience in interacting with customers. \n \nExperience with the following technology stack: \nC#\nMVC\nASP.NET\nASP.NET Razor \nSQL Server 2016 Development \nWCF\nSQL Reporting Services \nAgile Methodology \nJavaScript\nAjax,\nJQuery\n \nTechnical Competencies Description \nSolid understanding of computer science including algorithms, data structures, operating systems and databases. ICT Governance and Compliance Governance e.g. Cobit and ITIL. Strong knowledge to design test plans according to the software requirements specification. Broad and extensive knowledge of the software development process and its technologies. Extensive knowledge of design techniques, tools, and principles involved in the production of software requirements specifications, models and designs. Strong knowledge of user interfaces. Strong knowledge of solution Integration strategies and tools. Working knowledge of Cloud Computing. Strong knowledge source control and version control tools like Git and SVN. Working knowledge of virtualisation and containerisation (Docker, Kubernetes). Working knowledge of DevOps (Continuous Integration, Continuous Delivery, Continuous Testing, Continuous Monitoring Infrastructure as Code, Config Management). Working knowledge of Agile Methodologies (Feature-Driven Development, Test-Driven Development, Scrum, Extreme Programming). Extensive background in coding. Extensive knowledge of software testing techniques and tools. Extensive knowledge of software team leadership IT Quality Management e.g. ISO9001 and CMMI IT Security ICT Standards COTS (Commercial of  the Shelf) Products OSS (Open Source Software) Products IT Strategies and Architectures. Strong knowledge of data integration tools Execution of Architecture methods and practices e.g. TOGAF and GWEA. \nTechnical competencies: Application Development, Application Maintenance and Support, Database Administration. \nLeadership competencies: Customer Experience, Collaboration, Communicating and Influencing, and Honesty, Integrity, Fairness, Outcomes driven, Innovation, Planning and Organising, Creative Problem Solving, Bimodal IT Practice, Managing People and Driving Performance, Decision-making, Responding to Change and Pressure, and Strategic Thinking \nOther Special Requirements  N/A. \n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process \n1. Register using your ID and personal information \n2. Use received one-time pin to complete the registration \n3. Log in using your username and password \n4. Click on “Employment & Labour \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 19 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on Employment Equity Plan. Correspondence will be limited to short listed candidates only. Preference will be given to members of designated groups. \nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant`s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves a right not to make an appointment. \nAppointment is subject to getting a positive security clearance, the signing of a balance score card contract, verification of the applicants documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered. \nCV’s sent to incorrect email address will not be considered \n \n \n \n \n \n ",
                " \n \n \n \n \n \nVACANCY -1880 \nREFERENCE NR : VAC00647/25 \nJOB TITLE : Senior Software Developer \nJOB LEVEL : D2 \nSALARY : R 651 627 - R 977 440 \nREPORT TO : Technical Manager \nDIVISION : Application Maintenance & Development \nDEPARTMENT : AM: Digital Services \nLOCATION : SITA Centurion \nPOSITION STATUS : 36 - Months - Fixed Term Contract (Internal & External) \n \nPurpose of the job \nTo lead the design, implementation, debugging, documentation, release and maintenance of software-based solutions, write code and enhance software/systems in accordance with ICT standards and the enterprise architecture for Government. \n \nKey Responsibility Area \n• Lead the design and development of new features for the software systems, and improvement of the existing ones. \n• Implementation, debugging, documentation and release of the software solutions.\n• Provide maintenance and enhancement support of the existing systems. \n• Perform software systems coding assignments. \n• Supervision of the Software development team. \n \nQualifications and Experience \nMinimum: 3-year National Diploma/ Bachelor's degree in ICT (Computer Science, Information Systems, Technology and Engineering) or related field. \nExperience: 6 - 7 years’ experience with full software development lifecycle (SLDC), including Solution development, operational responsibility in a large corporate/public sector organisation. The experience must include: Experience in solution analysis, and development for the development, implementation and maintenance/enhancements of systems within the corporate/public sector, including: Successfully developed and implemented applications. Software development team leadership competency. Software development deliverable effort planning, estimations and execution. Management. Developed efficient and effective IT solutions to diverse and complex business problems. Extensive experience with a wide variety of database management systems and maintenance. Extensive experience with a wide variety of programming languages and technologies. Extensive experience with working on multiple tasks and report status. Experience in interacting with customers. \n \nTechnical Competencies Description \nComprehensive knowledge and experience with.NET Framework, one or more of the major programming languages, C#, ASP.NET MVC HTML. Comprehensive knowledge and experience with one or more of the major database systems, MySQL, MsSQL. Comprehensive knowledge with Mobile development with experience in Xamarin. Extensive knowledge in DevOps. Comprehensive Teamworking experience. Strong knowledge of source control and version control tools. \n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 17 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \n● If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n● Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n● It is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n● Only candidates who meet the requirements should apply. \n● SITA reserves the right not to make an appointment. \n● The appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \n● Correspondence will be entered to with shortlisted candidates only. \n● CV`s from Recruitment Agencies will not be considered. \n \n \n \n \n ",
                " \n \n \n \n \n \n \n \nVACANCY\n \nRE ADVERTISEMENT \nREFERENCE NR : VAC00962/24 \nJOB TITLE : Professional: Governance and Business Support Services JOB LEVEL : E1 \nSALARY : R1 254 685 - R1 882 027 \nREPORT TO : Executive: Service Management DIVISION : Service Management \nDEPT : Information Security Services \nLOCATION : SITA Erasmuskloof \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nResponsible for ensuring that Service Management initiatives and projects are managed efficiently and effectively, with the aim of improving the overall management of IT Service services while minimizing the risks to the organisation. The incumbent will also be responsible for ensuring that SITA delivers the services as agreed with their clients while delivering value from investments made. \n \nKey Responsibility Areas \nManage and Implement the Governance and Business Support policies and procedures for Service Management processes to ensure continuous IT Improvement to business without interfering with the daily operations. \nOverall responsibility of on time delivery, within budget and quality of the service management projects including proposal development projects \nAdvise stakeholders about IT Governance and Business support processes to ensure successful delivery of services to enhance the existing Service Management Portfolio \nManaging contract creation, execution, renewal and analysis to maximize operational and financial performance of the contracted party, all while reducing financial risk for SITA \nResponsible for providing leadership direction for the Governance & Business Support Services within defined SITA boundaries \nAccountable for ITIL Life Cycle Management relevant to service delivery services, SLA / OLA and underpinning contract requirements and highlight areas of performance risks in order to provide excellent service delivery \nFinancial and business management \nHuman Capital Management. \n \nQualifications and Experience \nRequired Qualification: Bachelor’s degree in information technology / B Tech in Information Technology / B Degree in Business Management or related field. \nCertifications: ITIL v3 or v4 Certification, COBIT Certification ISO/ IEC 20 000 Certification, PMBOK or PRINCE2 or both. \n \nExperience: 8 + years working of ICT experience with IT Service Management / IT Operations / Infrastructure / Service Management with 4 years in a management role. Experience should include: - Overseeing medium to large- scale information technology projects driven by project management frameworks. Managing departmental budgets and overall departmental financials, contracts and vendor management. Exposure/experience with a wide variety of business productivity solutions. Managing strategic change, through project implementations, in a dynamic operating environment 3 years solid IT governance, risk and compliance experience. Leading a team of highly skilled ICT professionals and consultants. Contract and supplier management ability. Experience and knowledge acquired through professional development, Technical Lead and Management experience. Excellent technical, analytical, and project management skills. Strong communication and interpersonal skills. Good leadership and motivational skills. \n \nTechnical Competencies Description \nKnowledge of: IT Service Management ICT Governance risk and Compliance Frameworks Project Management Lifecycle IT Risk Management ICT related Acts ICT Business Environment and Landscape State Information Technology Act Company’s Act Financial legislation: Public Finance Management Act (PFMA), Treasury Regulations, Tax Laws. \nLeadership competencies: Customer Experience; Collaboration; Communicating and Influencing; Outcomes driven; Planning and Organising; Creative Problem Solving; Bimodal IT Practice; Managing People and Driving Performance; Decision-making; Responding to Change and Pressure; Strategic Thinking \nInterpersonal/behavioural competencies: Active listening; Attention to Detail; Analytical thinking; Continuous Learning; Disciplined; Resilience; and Stress Management. \nOther Special Requirements N/A.\n \n \nHow to apply \nKindly forward your CV to: Zandile.recruitment@sita.co.za stating the position applying for and the relevant reference number \n \nClosing Date: 17 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on Employment Equity Plan. Correspondence will be limited to short listed candidates only. Preference will be given to members of designated groups.\nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant`s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves a right not to make an appointment. \nAppointment is subject to getting a positive security clearance, the signing of a balance score card contract, verification of the applicants documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered.\n \n \n \n \n \n ",
                " \n \n \n \n \n \nVACANCY - 1864 \nRe – Advertisement \nREFERENCE NR : VAC01184/24 \nJOB TITLE : Senior Software Developer \nJOB LEVEL : D2 \nSALARY : R 651 627 - R 977 440 \nREPORT TO : Technical Manager \nDIVISION : Applications Development and Maintenance \nDEPARTMENT : ADM Apps Dev \nLOCATION : SITA Centurion \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nTo lead the design, implementation, debugging, documentation, release and maintenance of software-based solutions, write code and enhance software/systems in accordance with ICT standards and the enterprise architecture for Government. \n \nKey Responsibility Area \nLead the design and development of new features for the software systems, and improvement of the existing ones. Implementation, debugging, documentation and release of the software solutions. Provide maintenance and enhancement support of the existing systems. Perform software systems coding assignments. Supervision of the Software development team. \n \nQualifications and Experience \nMinimum: 3-year National Diploma/ Bachelor's degree in ICT (Computer Science, Information Systems, Technology and Engineering) or related field. \nExperience: 6 - 7 years’ experience with full software development lifecycle (SLDC), including solution development, operational responsibility in a large corporate/public sector organisation. The experience must include \nExperience in solution analysis, and development for the development, implementation and maintenance/enhancements of systems within the corporate/public sector, including: Successfully developed and implemented applications Software development team leadership competency Software development deliverable effort planning, estimations and execution management Developed efficient and effective IT solutions to diverse and complex business problems. Extensive experience with a wide variety of database management systems and maintenance. Extensive experience with a wide variety of programming languages and technologies. Extensive experience with working on multiple tasks and report status. Experience in interacting with customers. \n \nTechnical Competencies Description \nSolid understanding of computer science including algorithms, data structures, operating systems and databases. ICT Governance and Compliance Governance e.g. Cobit and ITIL Strong knowledge to design test plans according to the software requirements specification. Broad and extensive knowledge of the software development process and its technologies. Extensive knowledge of design techniques, tools, and principles involved in the production of software requirements specifications, models and designs. Strong knowledge of user interfaces. Strong knowledge of solution Integration strategies and tools Working knowledge of Cloud Computing Strong knowledge source control and version control tools like Git and SVN Working knowledge of virtualisation and containerisation (Docker, Kubernetes) Working knowledge of DevOps (Continuous Integration, Continuous Delivery, Continuous Testing, Continuous Monitoring Infrastructure as Code, Config Management) Working knowledge of Agile Methodologies (Feature-Driven Development, Test-Driven Development, Scrum, Extreme Programming) Extensive background in coding Extensive knowledge of software testing techniques and tools Extensive knowledge of software team leadership IT Quality Management e.g. ISO9001 and CMMI IT Security ICT Standards COTS (Commercial of the Shelf) Products OSS (Open Source Software) Products IT Strategies and Architectures Strong knowledge of data integration tools Execution of Architecture methods and practices e.g. TOGAF and GWEA. \nTechnical Competencies: Application Development. Application Maintenance and Support. Database Administration \nAdded Advantage: \nSAG certification \nSAG WebMethods experience \nAPI Development in Java/ .Net \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 17 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \n● If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n● Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n● It is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n● Only candidates who meet the requirements should apply. \n● SITA reserves the right not to make an appointment. \n● The appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \n\n● Correspondence will be entered to with shortlisted candidates only. \n● CV`s from Recruitment Agencies will not be considered. \n \n \n \n \n \n ",
                " \n \n \n \n \nVACANCY - 1873 \nRe -advertisement \nREFERENCE NR : VAC00821 \nJOB TITLE : Specialist: Service Operations (Problem Management) \nJOB LEVEL : C5 \nSALARY : R 478 420 - R 717 630 \nREPORT TO : Consultant: Service Transition \nDIVISION : Service Management \nDEPARTMENT : Service Delivery Management \nLOCATION : SITA Erasmuskloof \nPOSITION STATUS : 3 - Years – Fixed Term Contract (Internal & External) \n \nPurpose of the job \n \nKey Responsibility Area \nTo develop, implement, optimise, and influence Incident / Request / Event / Access Management/ Problem Management processes / systems to influence service delivery by applying Service Operations aligned to the ITIL Service Lifecycle, relevant ISO standards, and COBIT Governance to Government enabling effective service management, to support the management of BA, SLAs, OLAs, and underpinning contracts. \n• Implementation of ITIL Life Cycle stage (Service Operations) relevant to all types of Incident / Request / Event / Access/ Problem Management issues raised against SLA / OLA and underpinning contract requirements and highlight areas of performance risks in order to provide excellent service delivery. \n• Monitoring and evaluation of Incident / Request / Event / Access/ Problem Management requirements life cycle against SLA requirements and mitigation of risks. \n• Provide input in planning and facilitating Incident / Request / Event / Access / Problem Management audits \n• Collaborate with relevant stakeholders in managing the Incident / Request / Event / Access / Problem Management life cycle processes \n• Monitoring and evaluation of all escalation mechanisms with regard to the management of risk to enable consistent effective service delivery and performance. \n• Manage critical and high impact Incident / Request / Event / Access Management requirements \n• Detect, Analyze, Process problems (RCAs) and evaluate, categorized and prioritized problems. \n• Facilitation and administration of Problem Management Forum. \n \nQualifications and Experience \nMinimum:3-year National Diploma/ Degree in Computer Science, Information Technology/ NQF level 6. \nCertificate: ITIL Practitioners Certification, ITIL Foundations Certification is an added Advantage. \nExperience: 3-5 years’ experience in Service Management principles related to Incident / Request / Event / Access/Problem Management good practice methodologies. Experience of working in a team and involvement in project management delivery concepts. Experience in dealing with customers. Experience in Customer Service Level and Relationship management. \n \nTechnical Competencies Description \nGood understanding and practice of ICT recognised Project management. Good Risk & Issue management. Excellent understanding of Service Operations aligned to ITIL good practice methodology, Cobit Governance and ISO 20 000 standards. Excellent understanding of continual improvement through service/process monitoring and evaluation. Excellent; policy, process, procedure development, review and implementation. Excellent Service / Process performance monitoring evaluation and reporting. \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 17 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \n● If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n● Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n● It is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n● Only candidates who meet the requirements should apply. \n● SITA reserves the right not to make an appointment. \n● The appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking.\n● Correspondence will be entered to with shortlisted candidates only. \n● CV`s from Recruitment Agencies will not be considered. \n \n \n \n \n \n ",
                " \n \n \n \n \nVACANCY\nREFERENCE NR : VAC00833/25 \nJOB TITLE : End User Computing Technician 1804JOB LEVEL : C1 \nSALARY : R 257 888 – R 386 832 \nREPORT TO : Specialist: End User Computing DIVISION : National & Regional Consulting \nDEPT : Prov MP: End-User Computing – (EUC) \nLOCATION : SITA Nelspruit \nPOSITION STATUS : 24 months Fixed term contract (Internal/External) \n \nPurpose of the job \nTo provide remote and onsite LAN and Desktop technical support to Workstations and Network infrastructure, ensuring that the clients requirements are always met, and their expectations exceeded. \n \nKey Responsibility Areas \nProvide first and second level LAN & desktop support within SLA targets. Install and configure new IT equipment within SLA targets. Implementation, customization and maintenance of the remote software deployment. Provide support to the enterprise’s local IT and software resources. Provide LAN & desktop advisory services to clients. Day to day administrative tasks. \n \nQualifications and Experience \nMinimum: Grade 12 PLUS National Higher Certificate in IT (NQF Level 5) with A+/N+ either as a subject of the Certificate OR as a separate certification (expiry irrelevant). \nExperience: At least one-year corporate experience in the Service Management / End User Support Environment, OR Call Centre Agent experience with 1 – 2 years relevant experience in the End User Computing services and related LAN Infrastructures Services. Maintenance and support service of the End User Computing Services relating to all LAN Infrastructure Services such as servers, desktops, LAN cabling, switches and other LAN peripherals. Maintenance and support to ensure the availability of the services according to prescribed procedures, policies, standards and SLA’s. Ensure the resolution of hardware and software service requests, incidents and problem within End User Computing and all related LAN infrastructure. \n \nTechnical Competencies Description \nKnowledge of: Desktop operating systems and application. Network cabling and telephony system. Security software and hardware. Technical support and maintains of the application system(s), hardware and software End User Computer and LAN infrastructure principles and topology, Internet protocols, services. Routing and switching technologies. ITIL. Procedure, Policies and standards. \nInterpersonal/behavioural competencies: Active listening, Attention to Detail, and Continuous Learning. \nOther Special Requirements  N/A \n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process \nRegister using your ID and personal information \nUse received one-time pin to complete the registration \nLog in using your username and password \nClick on “Employment & Labour \nClick on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \nClick on “Employment & Labour \nClick on “Recruitment Citizen” \nLogin using your username and password \nClick on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882\n \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 16 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups.\nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves the right not to make an appointment. \nThe appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered.\n \n \n \n \n \n ",
                " \n \n \n \n \nVACANCY- 1883 \nREFERENCE NR : VAC00360/23 \nJOB TITLE : Admin Assistant \nJOB LEVEL : B5 \nSALARY : R 220 972 – R 331 457 \nREPORT TO : HOD: Provincial Management \nDIVISION : NRC: Exec National & Regional Consulting \nDEPARTMENT : RPL: HOD Northern Region \nLOCATION : SITA Mahikeng \nPOSITION STATUS : Permanent (Internal /External) \n \nPurpose of the job \nTo provide Administrative Assistant support to the sub department and ensure corporate support across the unit. Provide high level administrative support by preparing statistical reports, handling information requests, and performing clerical functions such as preparing correspondence, receiving visitors, arranging conference calls, and scheduling meetings. \n \nKey Responsibility Areas \nReceive and record incoming and outgoing correspondence to ensure proper record keeping for the sub department. \nPrepare and distribute minutes, presentations as well as general office documentation/communication to ensure that information reached relevant identified parties. \nArrangement of Bid Committees. \nWriting minutes. \nPerform general office duties. \nArrange work sessions and staff meetings with employees and coordinate all logistical arrangements for the sub department. \nResponsible for the accommodation and flight arrangements for the sub division in accordance with SITA travelling policy and procedures to the satisfaction of the division. \nProvide management support to the sub departmental Budget \nEnsure adherence to the organisation quality standards in terms of documentation that requires management approval. \n \nQualifications and Experience \nMinimum: Grade 12 (NQF level 4) plus a relevant recognised course (shorter than a year at NQF level 4-certificate of competence) –depending on operational requirements. MS Office certification will be an added advantage. \nExperience : 1 – 2 years experience applicable to the specified discipline. \nTechnical Competencies Description \nKnowledge of principles and practices of organisation, records management and general administration. Basic principles of bookkeeping. Computer literacy. Office Management. Ability to operate standard office equipment. \nAbility to follow written and oral instructions. Office Management. Business writing skills. Report writing skills, in statistical analysis. \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process \n1. Register using your ID and personal information \n2. Use received one-time pin to complete the registration \n3. Log in using your username and password \n4. Click on “Employment & Labour \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support egovsupport@sita.co.za OR call 080 1414 882 \n \nClosing Date: 13 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on an Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant`s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves a right not to make an appointment. \nAppointment is subject to getting a positive security clearance, the signing of a balance score card contract, verification of the applicant’s documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered. \n \n \n \n \n \n ",
                "VACANCY - 1874 \nREFERENCE NR : VAC00398/25 \nJOB TITLE : Specialist: Database Administrator \nJOB LEVEL : C5 \nSALARY : R 478 420 – R 717 630 \nREPORT TO : Senior Database Administrator \nDIVISION : IT Infrastructure Services \nDEPARTMENT : ITI: Hosting Open Systems SAPS \nLOCATION : SITA Centurion \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nProvision Database services, design, support, install, maintain and administer database management system and related products. \n \nKey Responsibility Areas \nInfrastructure Preparation. Management and Administration. User Support. Reporting and Communication. \n \nQualifications and Experience \nMinimum: 3 year National Higher Diploma / Degree in an ICT related field (Computer Science, Information Systems, Technology and Engineering). \nCertification: Microsoft SQL Server database certifications. Oracle Certified Professional. MySQL Database Administrator. \n \nExperience: 3 - 5 years practical work experience of database administration on different platforms with programming experience and Microsoft SQL Server Reporting and Microsoft SQL Server Integration Services experience. \n \nTechnical Competencies Description \nKnowledge of: ADABAS, NATURAL, COMPLETE, IMS, Datacom, IDMS, Oracle, SQL IT server hardware, software setup and configuration. SQL Clustering SQL Always on MySQL Replication SCOM Basic knowledge of application development Advanced Agile/Scrum knowledge Advanced knowledge of software development lifecycle and database change management & automation Capacity planning, Performance Tuning, Backup and Recovery, Project Management Business/Systems Liaison Customer Relationship Management Meta Data Management Information Architecture/Strategy Business Intelligence Architecture/Tools. \nOther Special Requirements N/A.\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \nClosing Date: 13 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves the right not to make an appointment. \nThe appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered."
            ],
            "postedDate": "10/9/2024",
            "iframe": "",
            "uuid": "pc10fc154-5df4-470b-bd82-ed441e117309"
        }
    ],
    "departments": {
        "north west office of the premier vacancies": "https://www.govpage.co.za/north-west-office-of-the-premier-vacancies-blog/north-west-office-of-the-premier-vacancies1158580",
        "north west department of economic development, environment, conservation and tourism vacancies": "https://www.govpage.co.za/north-west-department-of-economic-development-environment-conservation-and-tourism-vacancies-blog/north-west-department-of-economic-development-environment-conservation-and-tourism-vacancies8686000",
        "commission for conciliation, mediation and arbitration (ccma) vacancies": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies9069209",
        "national electronic media institute of south africa (nemisa) vacancies": "https://www.govpage.co.za/national-electronic-media-institute-of-south-africa-nemisa-vacancies-blog/national-electronic-media-institute-of-south-africa-nemisa-vacancies2080761",
        "national health laboratory services (nhls) vacancies": "https://www.govpage.co.za/national-health-laboratory-services-nhls-vacancies-blog/national-health-laboratory-services-nhls-vacancies1424356",
        "ports regulator of south africa vacancies": "https://www.govpage.co.za/ports-regulator-of-south-africa-vacancies-blog/ports-regulator-of-south-africa-vacancies1131757",
        "private security industry regulatory authority (psira) vacancies": "https://www.govpage.co.za/private-security-industry-regulatory-authority-psira-vacancies-blog/private-security-industry-regulatory-authority-psira-vacancies8193362",
        "quality council for trades & occupations (qcto) vacancies": "https://www.govpage.co.za/quality-council-for-trades-occupations-qcto-vacancies-blog/quality-council-for-trades-occupations-qcto-vacancies4467529",
        "south african broadcasting corporation (sabc) vacancies": "https://www.govpage.co.za/south-african-broadcasting-corporation-sabc-vacancies-blog/south-african-broadcasting-corporation-sabc-vacancies6858703",
        "south african maritime safety authority (samsa) vacancies": "https://www.govpage.co.za/south-african-maritime-safety-authority-samsa-vacancies-blog/south-african-maritime-safety-authority-samsa-vacancies1469358",
        "south african special risk insurance association (sasria) vacancies": "https://www.govpage.co.za/south-african-special-risk-insurance-association-sasria-vacancies-blog/south-african-special-risk-insurance-association-sasria-vacancies3940642",
        "south african weather service (saws) vacancies": "https://www.govpage.co.za/south-african-weather-service-saws-vacancies-blog/south-african-weather-service-saws-vacancies6553400",
        "special investigating unit (siu) vacancies": "https://www.govpage.co.za/special-investigating-unit-siu-vacancies-blog/special-investigating-unit-siu-vacancies9046357",
        "state information technology agency (sita) vacancies": "https://www.govpage.co.za/state-information-technology-agency-sita-vacancies-blog/state-information-technology-agency-sita-vacancies2649809"
    }
}