{
  "title": "govpage-public-sector",
  "blogPosts": [
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/joe-gqabi-district-municipality_orig.jpg",
      "href": "https://www.govpage.co.za/joe-gqabi-district-municipality-vacancies-blog/joe-gqabi-district-municipality-vacancies1416151",
      "title": "JOE GQABI DISTRICT MUNICIPALITY VACANCIES",
      "content": [],
      "postedDate": "3/9/2024",
      "iframe": "https://drive.google.com/file/d/1UIn05Nucdmauigr8wKiPVi_OZhYf0-aZ/preview",
      "uuid": "p5221d107-9570-4cbd-8407-33ba5c0eeb9d"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/king-sabatha-dalindyebo-local-municipality_orig.jpg",
      "href": "https://www.govpage.co.za/king-sabatha-dalindyebo-local-municipality-vacancies-blog/king-sabatha-dalindyebo-local-municipality-vacancies9977373",
      "title": "KING SABATHA DALINDYEBO LOCAL MUNICIPALITY VACANCIES",
      "content": [],
      "postedDate": "3/9/2024",
      "iframe": "https://drive.google.com/file/d/1byuHMd4XeTcNL4xcjfHJEmjDISx49C0u/preview",
      "uuid": "pbf37cba9-36fe-4687-b843-175f90cc775c"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/kouga-local-municipality_orig.jpg",
      "href": "https://www.govpage.co.za/kouga-local-municipality-vacancies-blog/kouga-local-municipality-vacancies9698822",
      "title": "KOUGA LOCAL MUNICIPALITY VACANCIES",
      "content": [
        " \nKOUGA LOCAL MUNICIPALITY\n ",
        "KOUGA MUNICIPALITY (EC 108)\nNOTICE NO: 157 / 2024\n \nVACANCY\nKouga Local Municipality is committed to the prescripts of the approved Employment Equity Plan and furthermore invites suitably qualified applicants to submit a detailed application for the following position:\n \nMANAGER: SAFETY AND SECURITY\n \nREQUIREMENTS:                                  \nRelevant NQF 7 qualification;\nTraffic Officer Diploma;\nSafety and Security qualification will be an added advantage;\n5 years’ relevant experience;\nValid code B driving license;\nSound knowledge of Road Traffic Legislation, Regulations and Municipal By-Laws;\nKnowledge of Safety & Security Legislation;\nGood management skills;\nGood communication skills when dealing with members of the public;\nCCTV experience will be an added advantage;\nAttention to detail;\nAbility to work under pressure;\nMust be able to speak, read and write in at least two of the official languages in Kouga Municipality (Afrikaans, English, and Xhosa).\n \nSALARY: R751 083.63 – R974 958.44 (Excluding Vehicle Allowance).  \nTASK: 17\n \nDUTIES:                                               \nCommunicating with the Superintendents and Chief Law Enforcement & Security Officer on specific Key Performance Areas (Law Enforcement, Vehicle/ Driver/ Learner’s testing and Motor Licensing, Communication and Quality Assurance) with a view to aligning functions and service delivery objectives against the capacity and capability of the Section;\nMonitoring/ assessing the operations of the sub-sections and evaluating the quality of output through analysis and interpretation of reports;\nReporting internally/ externally (South African Bureau of Standards, Department of Transport, etc.) on implementation of the Quality System and statutory requirements with regards to Vehicle Testing and Licensing processes and interventions and providing reasons and recommendations to improve and/ or sustain the effectiveness of current applications;\nFormulating a Public Safety Crime Prevention and Security plans for the Municipality by developing and monitoring projects that subscribe to crime prevention principals and formulating crime prevention strategies that directly impact on local policing demographics;\nDefining/ adjusting the role boundaries, workflow processes against laid down service delivery requirements;\nPlanning work and allocating duties to subordinates to ensure that operational requirements are met;\nConducting appraisals to measure performance against agreed objectivities, counselling and consulting with personnel on developmental goals, short-term targets and standards;\nMonitoring the adequacy of current training interventions through the evaluation competency demonstrated in workplace application and prepares assessment and progress reports for inclusion into the consolidated Skills Development Plan of the Municipality;\nAnalyzing statistical information pertaining to staff attendance, overtime, leave and addressing deviations or occurrences of abuse and/ or workplace conflict through the implementation of corrective measures in accordance with Human Resources Policies and Procedures;\nCommunicating to personnel through the verbal and written mediums statutory and procedural quality assurance requirements for adoption and compliance thereof and/ or reviewing and updating procedures to provide coverage of operational needs and circumstances;\nChecking and verifying through internal audit processes, inspection records and registers of testing equipment and instruments against standards stipulated by laws and regulations;\nInspecting testing station and/ or conducting observations of work sequences and determining extent of awareness quality assurance applications and/ or the need for corrective/ remedial measures and amendment/ update of procedures;\nInspecting worksites and/or conducting observations of work sequences and determining extent of awareness and quality assurance applications, and/or the need for corrective/ remedial measures and amendments/updates of procedures;\nDiscussing and/ or investigating workplace accidents/ incidents, seeking reasons from personnel on any non-compliance/ deviation and providing direction on courses of action for execution;\nPromoting and enhancing of a safe and crime free crime society within the jurisdiction of the municipality and detecting crime prone area, protection of the municipal assets/ properties including staff and visitors;\nInteracting with the SAPS, Provincial Traffic departments, hawkers, Council of Churches, Community Police Forum, Business, Taxi associations, officials of State Departments with the aim of providing information, advice and promoting synergy and intergovernmental relationship on issues of security and law enforcement and planning for an effective working environment of important effects;\nPreparing and presenting to the Director forward plans, operational interventions necessary to sustain and/ or improve current Law Enforcement performance and service levels;\nInterpreting and consolidating the expenditure estimates for the Safety & Security Section, preparing the draft budget and, monitoring financial performance with a view to correcting and/ or reviewing applications and processes;\nConsidering proposals by the Director and subordinates for drawing up a draft budget;\nVerifying the execution and procurement of approved budgetary items to circumvent over-expenditure of votes and ensure that approved commodities are acquired in terms of the Municipal Financial Management Act, 2003 (Act 56 of 2003);\nEvaluating the sections performance against budget and addressing deviations/ variances with appropriate personnel;\nMonitoring and implementing corrective measures to rectify deviations/ acts contrary to financial regulations, audit requirements and departmental procedure;\nCommunicating with the Council’s Financial Section on audit findings and recommendations and institutes the necessary investigational or corrective measures;\nInspecting and/ or approving the outcomes of specific tests (oral/ written, theoretical/ practical and physical - roadworthiness of vehicles) through analysis, quality checking and correlation of test results with national standards and norms;\nCompleting all necessary documentation and issuing certificates endorsing compliance in accordance with the eNaTIS System requirements;\nChecking and verifying through internal audit processes, inspection records and registers of testing equipment and instruments against standards stipulated by laws and regulations;\nFormulating a Public Safety Crime Prevention plan for the Municipality by developing and monitoring projects that subscribe to crime prevention principals and formulating crime prevention strategies that directly impact on local policing demographics;\nDeveloping and maintaining implementation of safety and security program to maximize safety standards for the communities;\nLiaising with various departments and important stakeholders in crime combating and prevention, designing and initiating capacity building programs to enable the Municipality to better incorporate crime prevention issues into the IDP;\nFacilitating and maintaining multidisciplinary approach to social crime prevention so as to ensure a well-integrated approach to continue crime prevention;\nManaging and maintaining safety issues through the development of crime prevention policies and by- laws, conducting public awareness and promoting activities regarding safety issues;\nCompiling productivity/ statistical reports referring to statistical data and qualitative information related to testing station and driver’s license operations and submitting for the attention of the Manager for consideration and inclusion into Council and Sub Committee reports and, submission to the Department of Transport and South African Bureau of Standards;\nMaintaining the activity and record keeping systems and/ or executing specific actions to facilitate the updating of registers schedules and manuals (Quality System and procedures, Occupational Health and Safety Registers, Training records, Work Instruction Lists, Testing and Measuring Equipment Registers, etc);\nVerifying sufficient stock of stationery and consumables and authorizing requisitions when necessary;\nMaintaining relationships with National, Provincial and Local Government through interaction on critical aspects associated with identification, classification and readiness to deal with public safety;\nAttending the District and Provincial disaster advisory and practitioners meetings at a strategic level;\nCommunicate on a regular basis with neighbouring local authorities, other service providers and related services (mutual aid agreements) in order to regulate and improve public safety service delivery;\nDealing tactfully and diplomatically in negotiations and personnel matters.\n \nBENEFITS: As per standard conditions of service;",
        "Applicants must submit a formal application form and a comprehensive CV, copies of qualifications, identity document and driver’s license. \nApplications must be submitted electronically as one PDF document to recruitment@kouga.gov.za.\nApplication forms can be obtained from the Municipal website, www.kouga.gov.za and must reach the Human Resource Manager on or before Friday, 6 September 2024 at 12:00.\n \nFor any enquiries contact Mr. B Faulkner: 042 200 2200.\n \nDisqualification:\n \nPlease note that the following can lead to disqualification:\n \nCanvassing of councillors.\nSubmission of fraudulent qualifications and/ or documents.\n \nNB: Please note that shortlisted candidates will be subjected to a vetting process. By applying for this position, the candidates agree to background checks being performed.\n\nThe Municipality reserves the right not to make an appointment.\nPreference will be given to applicants residing within the Kouga area of jurisdiction.\nShould you not hear from us within 30 days of closing date, kindly regard your application as being unsuccessful.\n \nMR. C DU PLESSIS\nMUNICIPAL MANAGER\n \nP. O. BOX 21\nJEFFREYS BAY\n6330"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "pc8cb96ab-ca7c-4368-b37f-505366a1daf5"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/nelson-mandela-bay-metropolitan-municipality_orig.gif",
      "href": "https://www.govpage.co.za/nelson-mandela-bay-metropolitan-municipality-vacancies-blog/nelson-mandela-bay-metropolitan-municipality-vacancies6646292",
      "title": "NELSON MANDELA BAY METROPOLITAN MUNICIPALITY VACANCIES",
      "content": [
        " \nNELSON MANDELA BAY METROPOLITAN MUNICIPALITY\n ",
        "In terms of its Employment Equity Plan, the Nelson Mandela Bay Municipality is committed to employment practices that redress past imbalances in respect of race, gender and disability, and as such the relevant policy will be considered during selection and placement.\nApplications are invited from suitably qualified persons for appointment to the under-mentioned position. Persons with a disability are encouraged to apply, unless otherwise stated in the advertisement.\n \nINFRASTRUCTURE AND ENGINEERING DIRECTORATE\nMANAGER: REPAIRS AND MAINTENANCE\n(FLEET MANAGEMENT)\nPOSITION CODE: 240449\nTASK Grade 14 (R592 296 – R823 452 per annum)\n(Basic salary only, excluding benefits)\n \nQualifications and experience required:\nRelevant tertiary qualification.\nThree to five years’ experience.\nA valid Code EC driver’s licence.\n \nKey attributes and competencies:\nThe incumbent will be responsible for planning and co-ordinating the maintenance and repairs of the fleet and plant in the section.\nThe incumbent will be responsible for controlling the key performance indicators and outcomes of personnel based in the repairs and maintenance operations.\nThe incumbent will be responsible for managing the functioning and processes associated with providing a repair and maintenance service.\nThe incumbent will be responsible for controlling the procedural administrative and reporting requirements/deadlines associated with the functioning of the Department.\nThe incumbent must be computer literate in Office applications.\nMust have extensive knowledge of related legislation, relating to area of responsibility, as well as relevant policies of Council.\nMust have excellent problem-solving skills.\nMust have the ability to work under pressure and meet critical/conflicting deadlines.\nMust have proficient oral and written communication skills in English and at least one other local language.\n Special requirements for the post:\n The incumbent must be physically fit and able-bodied.\n \nJob purpose:\nCo-ordinating and controlling the procedures, operations and critical outcomes associated with Fleet Repairs and Maintenance through the implementation of functional plans and objectives, monitoring productivity and performance and addressing deviations and implementing standards and operating practices to manage the allocation, maintenance and optimum functionality of the entire municipal fleet, plant and equipment.\nAs part of the selection process, candidates may be tested on any requirement, skill or competency, which will include pre-employment screening, medical examination, security vetting and psychometric assessment.\nFringe benefits will include membership of a Retirement Fund, Medical Aid Scheme, Group Life Assurance Scheme, participation in a Housing Subsidy and Car Schemes (subject to the conditions of the various Schemes), and normal leave and sick leave benefits.\n \nSUBMISSION OF APPLICATION PROCEDURE:\nKindly note that all applications for employment and supporting documentation in respect of the advertised vacancy should be submitted online on the municipal website at www.nelsonmandelabay.gov.za (go to ‘Vacancies’ to find the documentation for details for submitting online applications). It is advisable to submit applications online in good time to allow time for attending to queries that may arise when submitting applications.\nHand-delivered or mailed applications for this position will not be accepted.\nTelephonic enquiries may be directed to the Receptionist, tel. 041 506 3259.\n \nCLOSING DATE FOR SUBMISSION OF APPLICATIONS: FRIDAY, 6 SEPTEMBER 2024 BEFORE 14:00\n \nPLEASE APPLY HERE",
        "In terms of its Employment Equity Plan, the Nelson Mandela Bay Municipality is committed to employment practices that redress past imbalances in respect of race, gender and disability, and as such the relevant policy will be considered during selection and placement.\n\nApplications are invited from suitably qualified persons for appointment to the under-mentioned position. Persons with a disability are encouraged to apply, unless otherwise stated in the advertisement.\n \nINFRASTRUCTURE AND ENGINEERING DIRECTORATE\nMANAGER: FLEET OPERATIONS\n(FLEET MANAGEMENT)\nPOSITION CODE: 240448\nTASK Grade 14 (R592 296 – R823 452 per annum)\n(Basic salary only, excluding benefits)\n \nQualifications and experience required:\nRelevant tertiary qualification.\nFour to five years’ relevant experience.\nValid Code EC driver’s licence.\nComputer literacy.\n \nKey attributes and competencies:\nOral and written communication skills in English and at least one other official local language.\nReport-writing skills.\nSupervisory skills.\n \nJob purpose:\nManaging and controlling all Municipal vehicles, construction plant and equipment, the procedural applications, interventions, and activities of the Fleet Operations functionality through the planning and co-ordination of providing a cost-effective transport/plant hire and lease fleet to the users within the Municipality, reporting on outcomes and/or proposing on opportunities for improving service levels.\nAs part of the selection process, candidates may be tested on any requirement, skill or competency, which will include pre-employment screening, medical examination, security vetting and psychometric assessment.\nFringe benefits will include membership of a Retirement Fund, Medical Aid Scheme, Group Life Assurance Scheme, participation in a Housing Subsidy and Car Schemes (subject to the conditions of the various Schemes), and normal leave and sick leave benefits.\n \nSUBMISSION OF APPLICATION PROCEDURE:\nKindly note that all applications for employment and supporting documentation in respect of the advertised vacancy should be submitted online on the municipal website at www.nelsonmandelabay.gov.za (go to ‘Vacancies’ to find the documentation for details for submitting online applications). It is advisable to submit applications online in good time to allow time for attending to queries that may arise when submitting applications.\nHand-delivered or mailed applications for this position will not be accepted.\nTelephonic enquiries may be directed to the Receptionist, tel. 041 506 3259.\n \nCLOSING DATE FOR SUBMISSION OF APPLICATIONS: FRIDAY, 6 SEPTEMBER 2024 BEFORE 14:00\n \nPLEASE APPLY HERE"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p0bf1c652-534e-49bb-9d12-361b0e99f17b"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/metsimaholo-local-municipality_orig.jpg",
      "href": "https://www.govpage.co.za/metsimaholo-local-municipality-vacancies-blog/metsimaholo-local-municipality-vacancies7416475",
      "title": "METSIMAHOLO LOCAL MUNICIPALITY VACANCIES",
      "content": [],
      "postedDate": "3/9/2024",
      "iframe": "https://drive.google.com/file/d/10EoAJ0MsmvJm-UldYFIGy2CJ73Zsyh3e/preview",
      "uuid": "pc2df8835-6e9c-4a02-8057-41b3b6102b59"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/thabo-mofutsanyane-district-municipality_orig.jpg",
      "href": "https://www.govpage.co.za/thabo-mofutsanyane-district-municipality-vacancies-blog/thabo-mofutsanyane-district-municipality-vacancies1789343",
      "title": "THABO MOFUTSANYANE DISTRICT MUNICIPALITY VACANCIES",
      "content": [
        " \nTHABO MOFUTSANYANE DISTRICT MUNICIPALITY\nMAMPOI STREET, OLD PARLIAMENT BUILDING, PRIVATE BAG X810, WITSIESHOEK 9870, SOUTH AFRICA\nTEL: +27 (58)-718 1036 FAX: +27 (58)718 1034 mmadmin@tmdm.gov.za\n ",
        "Thabo Mofutsanyana District Municipality, with its seating in Phuthaditjhaba, Free State Province, subscribes to the principle of Employment Equity Act and Affirmative Action. The municipality hereby invite suitable candidates to apply for the following advertised position. \n \nDEPARTMENT: OFFICE OF THE MUNICIPAL MANAGER \nPOSITION: DIRECTOR COMMUNITY SERVICES & LED \n(PERMANENT POSITION) \nSALARY: (Min – R965 958.00; Mid – R1 103 953.00; Max – R1 224 083.00) \nTotal remuneration package will be in terms of Government Gazette No.50737 dated 30/05/2024 \n \nREQUIREMENTS Bachelor Degree in Social Sciences / Public Administration / Law / Bachelor of Science Degree in Local Economic Development/ Building Sciences/ Architect/ Bachelor Degree in Town and Regional Planning or Development Studies, or equivalent. \n \nOTHER REQUIREMENTS: The appointed candidate must be a South Africa Citizen or permanent resident with no criminal record. He/she must be in possession of a valid driver’s license (Code 08 (EB) and a suitable vehicle for proper performance of his/her functions; willingness to work irregular hours with extensive travelling. \n \nADDED ADVANTAGE: ADDED ADVANTAGE: Certificate in Municipal Finance Management Program (MFMP) (SAQA Qualification ID No. 48965) or Certificate Program in Municipal Development (CPMD) or attain the qualification within 18 months from date of appointment, • Project Management Certificate or Diploma; and • Registration with a relevant Professional Body. \n \nEXPERIENCE: Five (5) years relevant experience at a Middle Management level and have proven successful institutional transformation within Public or Private Sector.\n\n \nKNOWLEDGE: The candidate will be expected to demonstrate; Good knowledge and understanding of relevant policy and legislation; Good knowledge and understanding of institutional governance systems and performance management; Understanding of council operations and delegation of powers, as well as: (Health service management; Public Safety; Parks and recreation management, Cemetery management; Solid Waste; LED & Tourism Development; Security Services). \n \nLEADING COMPETENCIES: Strategic Direction and Leadership, People Management, Program and project Management, Financial Management, Change Leadership and Governance Leadership. \n \nCORE COMPETENCIES: Moral Competence, Planning and Organizing, Analyzing and Innovation, Knowledge and Information Management, Communication, Results and Quality Focus. \n \nKEY PERFORMANCE AREA: Provide strategic leadership in the Community Services & LED Directorate of the Municipality. Develop and continuously evaluate short, medium and long term strategic organisational governance objectives of the Municipality. Ensure policy development, research and compliance. Develop and monitor systems, procedures and processes to ensure correct working operations and practices. Coordination of portfolio Committee meetings and business processes and submit reports. Development and implementation of the departmental SDBIP. Compile and implement departmental budget. Give inputs and support towards preparation of IDP to ensure alignment and efficient performance. Formulate creative solutions to enhance cost effectiveness and efficiency in the delivery of services and administration of the Municipality. Assist and support the Accounting Officer with the roles and responsibilities delegated to the Directorate. Management of health service, cemetery, sports, arts and culture, parks and recreation, Disaster Management, Fire and emergency services, environment and waste management.",
        "APPLICATIONS AND CONDITIONS OF APPOINTMENT \nApplicants must download and fill in an Application Form (Annexure C) available on the Municipal Website at (www.tmdm.co.za); which is also accessible on www.gpwonline.co.za) or directly from the Government Notice No. 21 of 17 January 2014 (Annexure C). No Applications will be considered if it is not on the Official Application Form. The application form must be accompanied by detailed CV with contactable references, recently certified original copies of qualifications, Identity document, driver’s licence and covering letter depicting the reference number of the post applied for and enclosed in an envelope clearly marked ‘’Application for the position: Director: Community Services & LED”. Faxed and e-mailed applications will not be considered; \nIt is the applicant’s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA) and to attach proof thereof. \nShort-listed candidate will be subjected to reference checks, criminal record check and signing of indemnity forms \nRecommended candidates will be subjected to a competency-based assessment over 2 day’s prior appointment in terms of Annexure A (Competency framework for Senior Managers) of Notice No.21 of Government Gazette No. 37245 of 17 January 2014; \nThe successful candidate will be required to sign an Employment Contract before assumption of duty, a Performance Agreement within 60 days of appointment and the necessary Disclosure of Financial Interest Forms as well as undergoing the necessary Security Vetting Processes. \nThe incumbent will be stationed at Thabo Mofutsanyana District Municipality’s head office situated in Phuthaditjhaba but may be deployed anywhere within the municipality depending on the operational requirements. \nDue to the large number of applicants, correspondence will be limited to the short-listed candidates only. If you have not been contacted within a period of two months after the closing date of the advertisement, kindly accept that your application has been unsuccessful. \nThe successful candidate will be reporting directly to the Accounting Officer. \nThe municipality reserves the right not to appoint any applicant to this position. \nA candidate who canvasses for preference will be disqualified. \n \nAPPLICATIONS\nApplications must be directed to: The Municipal Manager: Me TPM Lebenya, Thabo Mofutsanyana District Municipality; Private Bag X 810, WITSIESHOEK, 9870, or hand-delivered at the office of the Municipal Manager, Room G01, Old Parliament Building, during office hours. \n \nFurther enquiries may be directed to: Ms Malefu Ngobese- Human Resources Manager \nTel: 058 718 10000- email: malefu@tmdm.gov.za\n \nCLOSING DATE FOR THE POSITION: 06 SEPTEMBER 2024 \n \nMs M. Nkomo \nACTING Municipal Manager"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "pb4c74ab8-834f-4f92-ad9d-88623e5deb67"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-umhlathuze_orig.png",
      "href": "https://www.govpage.co.za/city-of-umhlathuze-municipality-vacancies-blog/city-of-umhlathuze-municipality-vacancies9173458",
      "title": "CITY OF UMHLATHUZE MUNICIPALITY VACANCIES",
      "content": [
        " \nCITY OF UMHLATHUZE MUNICIPALITY\n ",
        "The City of uMhlathuze is one of the fastest growing municipalities in South Africa, offering the ideal combination of a rewarding career and pleasant working conditions. Interested and qualified applicants are invited to apply for the following position that is based in Richards Bay – Civic Centre, KwaZulu-Natal.\n \nDEPUTY CITY MANAGER: FINANCIAL SERVICES\nPERMANENT APPOINTMENT \n• REFS56001/2024\nANNUAL TOTAL REMUNERATION PACKAGE: NEGOTIABLE IN TERMS OF GOVERNMENT GAZETTE NO. 37500 OF 29 MARCH 2014; PLUS PERFORMANCE BONUS. \n \nREQUIREMENTS: • A Grade 12/Matric Certificate • At least an NQF Level 7 in the field of Accounting, Finance or Economics, or Chartered Accountant (SA) • A post graduate NQF Level 8 qualification is essential • A Master’s degree (MBA/MBL) will be an added advantage • 15 years’ experience, of which at least 7 years’ must have been at a senior management level in a municipal environment • Verifiable experience to manage a municipal financial environment, at least a Grade 5 Municipality upwards • Proven ability to engender at least one clean audit managing corroboratively within a municipal environment• Demonstrate ability to manage a financial environment at a Treasury non delegated Municipality • A valid driver’s licence • MFMP or Certificate of Competency against minimum competency levels of 2007 issued in terms of the MFMA under Government Notice No. 493 in Government Gazette No. 29967 of 15 June 2007 • Proven experience in successful institutional transformation in the public or private sector • Advanced understanding of Council operations and delegation of Powers.\n \nKNOWLEDGE: • Advanced knowledge and understanding of relevant policy and legislation • Advanced knowledge and understanding of institutional governance systems and performance management• Extensive knowledge of Financial services • Good knowledge of Supply Chain Management Regulations and the Preferential Procurement Policy Framework Act,2000 (Act No.5 of 2000) • Knowledge of good governance • Knowledge of Financial related legislation • Knowledge of coordination and oversight of all specialised support functions.\n \nKEY PERFORMANCE AREAS: • Lead and direct the Financial Services Department (Budget, Revenue and Supply Chain Management) • Implement an Integrated Development and Strategic goals of the budget and treasury • Implement a Service Delivery Budget Implementation Plan • Prepare and implement the Municipal budget • Prepare Annual Financial Statements and other legislative financial management reports • Perform duties and functions delegated to the Deputy City Manager (Financial Services) by the Municipal Financial Management Act • Manage efficient provision of Municipal services • Establish, operate and maintain support structures, processes and systems • Provide visionary and innovative leadership to diverse workforce, to ensure optimal utilisation of the Council’s resources in terms of implementing its strategic objectives articulated in the IDP and in the fulfilment of its legislative mandate • Provide support and advice to Council and City Manager.",
        "CLOSING DATE: 16 SEPTEMBER 2024.\n \nNB: All applicants must forward an application form (obtainable in Government Gazette, No. 37245) or can be downloaded from our website: www.umhlathuze.gov.za\nApplications, accompanied by a detailed CV with copies of qualifications certificates, Identity Document and driver’s licence, should be forwarded to: The City Manager by e-mail to: SM_Vacancies@umhlathuze.gov.za quoting the reference number. Alternatively, applications can be hand delivered during the week to the City of uMhlathuze, Civic Centre (5 Mark Strasse Road, Richards Bay) between 07h30 - 16h00. Candidates must state clearly the position to which appointment is sought. Applicants are requested to furnish telephone number/s at which they may be contacted.\n \nFor administrative enquiries, contact: Deputy City Manager: Corporate Services, Mr Mpilo Sibiya on (035) 907 5181.\n\n \nThe City of uMhlathuze is an equal opportunity, affirmative action employer. As such, we intend to promote and uphold representativity in the Municipality regarding race, gender and disability.\n \nPLEASE NOTE: It would be expected of shortlisted candidates to be subjected to competency assessments and that previous and current employers and references will be contacted. Verification will be done on his/her qualifications, criminal and credit record. The candidate will be required to disclose all financial interests. All applications must be submitted with an official application form, detailed CV, copies of qualifications and Identity Document, the names of three references from current and previous employers. The internal or external application form is available from the Municipal website or the Human Resources Section (Department Corporate Services). Failure to adhere to the above will result in automatic disqualification.\n \nAppointment is subject to the signing of an employment contract and performance agreement in terms of Section 56 of the Municipal Systems Act. The appointment and Conditions of Employment will be in accordance with the applicable and relevant local government legal framework.\n \nDue to the large number of applications we envisage to receive, applications will not be acknowledged. \n \nShould you not be contacted within 3 months of the closing date of the advertisement, please consider your application unsuccessful.\n \nMR N.G. ZULU\nCITY MANAGER, CITY OF UMHLATHUZE"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p93d5165e-0e95-4720-91a8-790962e8993e"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/umgungundlovu-district-municipality_orig.jpg",
      "href": "https://www.govpage.co.za/umgungundlovu-district-municipality-umdm-vacancies-blog/umgungundlovu-district-municipality-vacancies7380309",
      "title": "UMGUNGUNDLOVU DISTRICT MUNICIPALITY VACANCIES",
      "content": [],
      "postedDate": "3/9/2024",
      "iframe": "https://drive.google.com/file/d/1ecn60jH9mralD0aA308Y0CFYpXKzFTdw/preview",
      "uuid": "pddf0606b-3af1-4294-b397-3c60e753e63e"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-polokwane-city_orig.jpg",
      "href": "https://www.govpage.co.za/city-of-polokwane-municipality-vacancies-blog/city-of-polokwane-municipality-vacancies2721997",
      "title": "CITY OF POLOKWANE MUNICIPALITY VACANCIES",
      "content": [
        " \nCITY OF POLOKWANE MUNICIPALITY\n ",
        "POLOKWANE MUNICIPALITY, AN EQUAL OPPORTUNITY EMPLOYER THAT SUBSCRIBES TO THE PRINCIPLE OF AFFIRMATIVE ACTION, INVITES APPLICATIONS FOR THE FOLLOWING EPWP POSTS:\n \nBusiness Unit: By-Law Enforcement and Security\nIG COMMUNITY SAFETY OFFICERS EPWP (X8)\nContract Duration: 9 Months\nRate: R271.14 per day\n \nRequirements:  A Grade 12  Valid Security Certificates (PSIRA)  Clean criminal record  18 – 35 years.\n \nDuties and Responsibilities:  Assist Security Officers at access control points  Protect and secure Council premises, property, and personnel through regular patrols to prevent crime on Council premises  Patrol with law enforcement officers to monitor and enforce by-law compliance within the municipal jurisdiction and any other areas of Council interest  Manage and oversee access control by completing necessary registers and confirming appointments.\n \n \nNB: THE POSITIONS ADVERTISED ABOVE ARE EXPANDED PUBLIC WORKS PROGRAMME (EPWP) WORK OPPORTUNITIES AND WILL BE AVAILABLE FOR A LIMITED CONTRACTUAL PERIOD ONLY. SUITABLE CANDIDATES WILL UNDERGO A SUITABILITY CHECK, INCLUDING A CRIMINAL RECORD AND QUALIFICATION VERIFICATION.\n \nIncumbents must be prepared to work in various geographical areas across the City of Polokwane's Council premises. Preference will be given to applicants residing within the City of Polokwane's jurisdiction.\n \nThe Municipality reserves the right not to make an appointment.\n \nPreference will be given to candidates from designated groups in accordance with the provisions of the Employment Equity Act and the Council's employment equity plan, targets, and goals. Therefore, applicants are requested to specify their race, gender, and disability status.\n \nSubmission Guidelines: Interested individuals must submit detailed CVs, a certified copy of their ID, and certified copies of their qualifications. Applications should be hand-delivered to:\n \nHuman Resource Recruitment\n8th Floor, Office No: 802\n \nClosing Date: 04 September 2024\n \nEnquiries: Mr. Obed Kgare and Ms. Mpho Mulea\nTel No: (015) 290 2116 / 2031 / 2004\n \nMUNICIPAL MANAGER: MS. THUSO NEMUGUMONI",
        "POLOKWANE MUNICIPALITY, SITUATED IN THE CAPRICORN DISTRICT MUNICIPALITY OF LIMPOPO PROVINCE HEREBY INVITE APPLICATIONS FROM SUITABLY QUALIFIED AND EXPERIENCED PERSONS TO BE CONSIDERED FOR THE FOLLOWING POSITIONS THAT EXIST AT ITS MUNICIPAL OFFICES IN POLOKWANE\n \nRE- ADVERTISEMENT\n \nAPPOINTMENT OF INDEPENDENT CHARPERSON OF POLOKWANE LOCAL MUNICIPALITY ICT STEERING COMMITTEE\nClosing Date: 11 September 2024\nRef No.: ICT SteerCom 02/2024\n \nApplications are hereby invited for an independent, suitably qualified and experienced professional from the ICT Sector to serve as the Independent Chairperson of the ICT Steering Committee of Polokwane Local Municipality, for a period of three (3) years.\nPolokwane Local Municipality has established an ICT Steering Committee in accordance with Section 3.1.10 of the Treasury Regulation and Section 166 of the Municipal Finance Management Act, 2003 (Act No. 56 of 2003).\n \nRequirements: Suitable candidates should possess a post-graduate degree in Information Communication Technology (ICT) or Computer Science or equivalent qualification with expertise in Information Communication Technology (ICT) The candidate must be a member of relevant ICT professional bodies. A Master's degree in Computer Science will serve as an advantage The candidate must have served as a member of an ICT Steering Committee in the public sector at local government level for at least three years or have experience as an Audit Committee Member responsible for ICT Governance oversight in the public sector at a local government level for at least three years.\n\n \nCompetencies: Five years or more management experience at a senior management level related to ICT At least five years proven knowledge and understanding of King IV Report on Corporate Governance requirements and Municipal related legislation, policies and processes Must possess strong and dynamic leadership skills Analytical reasoning ability A demonstrated track record of diligence and integrity Excellent communication skills (verbal and written).\n \nDuties: The ICT Steering Committee at Polokwane Local Municipality is an oversight body which operates and discharges its duties according to Section 3.1.10 of the Treasury Regulation and Section 166 of the Municipal Finance Management Act, 2003 (Act No. 56 of 2003).\nRoles and responsibilities of the ICT Steering Committee Chairperson include the chairing of the ICT Steering Committee whose responsibilities include, amongst others, the following: Providing oversight on: ◊ The management of Corporate Governance of ICT in the Municipality ◊ Development and implementation of the ICT Policy Framework, ICT Strategic Plan, ICT Implementation Plan and ICT Operational Plan as directed by the Municipality ICT Strategic Plan ◊ functionality of ICT organisational structure, resources and capacity according to the needs and priorities of the Municipality ◊ The development of a project plan for each ICT initiative to organise and manage resources (people and funding) in such a way that these resources deliver all the work required to complete a project within the defined scope, quality, time and cost Articulation of the ICT Risk appetite and its management within the risk management practices of the Municipality Performance monitoring of external ICT service providers (3rd parties) through service level agreements and service management engagements Oversight and reporting on ICT security (including cyber security) to ensure the protection of electronic information, information systems and infrastructure to maintain confidentiality, integrity and availability of information Supporting and reporting to the Audit and Performance Audit Committee.\n \nNumber of Meetings: To chair at least four (4) quarterly ICT Steering Committee meetings per financial year and on invitation attend quarterly Audit and Performance Audit Committee Meetings on ICT related matters.\n \nRemuneration: The appointed ICT Steering Committee Chairperson shall be remunerated in line with National Treasury Guidelines for sitting allowance and a maximum of three (3) hours preparation in terms of SAICA rates (Guidelines of fees for audit done on behalf of the Auditor-General).\nThe successful candidate will be required to sign a contract with the Municipality. The appointed candidate may be subjected to a security vetting and screening process.\n \nApplication: It is mandatory to submit application (motivation letter), a detailed Curriculum Vitae and relevant supporting documentation, including a copy of an ID document, copies of qualifications, summary of previous Audit Committee and/or ICT Steering Committee memberships and references to: The Municipal Manager, Private Bag X 111, Polokwane, 0700, or hand delivered to Office 907, 9th Floor, Civic Centre, Corner Landraos Mare and Bodenstein Street, Polokwane, Email to: ICTsteercom02@polokwane.gov.za quoting the reference number in the subject heading of application. \n \nNote: Correspondence will only be made with short-listed candidates. If you have not been contacted within Four (4) months after the closing date of this advertisement, please accept that your application was unsuccessful. Polokwane Local Municipality reserve the right to cancel this advertisement any stage of the process.\n \nPOLOKWANE MUNICIPALITY IS AN EQUAL OPPORTUNITY AFFIRMATIVE EMPLOYER AND RESERVES THE RIGHT NOT TO MAKE ANY APPOINTMENT.\n \nTHUSO NEMUGUMONI\nMUNICIPAL MANAGER"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p62f88a60-952c-47f0-8087-b8d173a9162e"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/makhudutamaga-local-municipality_orig.jpg",
      "href": "https://www.govpage.co.za/makhudutamaga-local-municipality-vacancies-blog/makhudutamaga-local-municipality-vacancies8673836",
      "title": "MAKHUDUTAMAGA LOCAL MUNICIPALITY VACANCIES",
      "content": [],
      "postedDate": "3/9/2024",
      "iframe": "https://drive.google.com/file/d/1pdJdJw9B2q58O-sAZqGZ8ntxhrcV-xBQ/preview",
      "uuid": "p016dcc2c-a64b-42be-aaa9-39713ea89b42"
    },

    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ccma_orig.jpg",
      "href": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies4992553",
      "title": "COMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA) VACANCIES",
      "content": [
        " \nCOMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA)\n ",
        "PART-TIME INTERPRETER (INDEPENDENT CONTRACTOR) X2\nGauteng Province – Ekurhuleni Office\nRef: EKPT09-24\nRate Per Day: R929.03\nThe Gauteng Province – Ekurhuleni Office requests the services of two (2) Part Time Interpreters.\n \nPurpose: To assist the CCMA Commissioners and structures by providing interpreter services to facilitate successful outcomes of CCMA activities.\n \nKey Performance Areas:-\nVerbal interpretations during hearings.\nAdministrative support functions.\n \nKey Requirements:\nMatric Certificate\nNational Diploma in Labour Related Qualification.\n1 year experience\nKnowledge on latest legislation/ amendments.\nLanguages: isiXhosa and isiZulu.",
        "NOTE FOR ALL APPLICANTS:    \n \nStrictly apply via the link provided: https://forms.office.com/r/UVfL7SkdWk\n \nIn your online application for appointment, kindly ensure that you disclose all relevant material information to assist the panel in considering your application.\n \nDetailed CV, copies of qualifications, driver’s license & ID document must be uploaded. Failure to complete the online form in full or not provide relevant information will automatically disqualify your application.\n\n \n*Only One (1) online application should be submitted.\n \nNo emailed or hand-delivered applications will be accepted. Non-adherence to the stated procedures in applying as well as incomplete application will result in the disqualification of the application.\n \nClosing date: 09 September 2024\n \nN.B Incomplete and late applications will automatically be disqualified.\n \nIf we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The CCMA reserves the right not to make an appointment. It is the intention of the CCMA to promote representivity in respect of race, gender and disability through the filling of the posts. Preference will be given to candidate from the designated groups.\n \nPeople with disabilities are encouraged to apply."
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p551cd837-3075-4d13-b160-5b9649d70e09"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/legal-aid_orig.jpg",
      "href": "https://www.govpage.co.za/legal-aid-vacancies-blog/legal-aid-vacancies7477378",
      "title": "LEGAL AID VACANCIES",
      "content": [
        " \nLEGAL AID\n ",
        "IT TEMP TRAINEES x 2\nREF: NO/IS/IT-TEMP/30/08/2024\nINTERNAL AND EXTERNAL ADVERTISEMENT                                                  \nNATIONAL OFFICE – BRAAMFONTEIN (INFORMATION SYSTEMS DEPARTMENT)\n \nLegal Aid SA is a National Public Entity; a key contributor to South Africa’s constitutional democracy, providing quality legal services to indigent and vulnerable persons. The organisation has a national footprint in all nine (9) provinces. Legal Aid SA is a credible employer of choice, boasting Top Employer SA accreditation for 15 consecutive years. We offer an exciting Employee Value Proposition with opportunities for development, career growth and an inspiring workplace.\nApplications are invited from persons interested to fill the above-mentioned position. The incumbent will be appointed on a twenty-four (24) month contract basis. \n\nThe position is based at the Legal Aid SA National Office in Braamfontein.\n \nJob Summary\nTo support end users and provide one-on-one training in the utilisation of computer hardware and peripherals and non-application software programmes in a way that will ensure defect-free and optimal utilisation of user computer workstation environments.\n \nKEY OUTPUTS\nComputer hardware installation, maintenance and support.\nSoftware installation, maintenance and support.\nUser support and one-on-one training in respect of the above.\n \nCOMPETENCIES (SKILLS, KNOWLEDGE AND ATTRIBUTES) REQUIRED\nA recognised Grade 12 certificate plus a three (3) year Computer qualification obtained at a University/Technikon, or other acknowledged tertiary institution.\nOne (1) year of relevant work experience in an IS Department in the field of Support.\nEffective working relationship with the IS team.\nExcellent analytical skills, business acumen and the ability to deal with ambiguity and meet demanding deadlines and manage projects.\nA sophisticated collaborative style is advantageous.\nProject management experience is essential.\nService excellence imperative.\nMulti-level and diverse stakeholders.\nComplexity in co-ordinating across organisational levels.\nNetworking with relevant stakeholders.\nIntegration across all business units.",
        "BASIC SALARY: R14,689.75 per month\n \nA detailed curriculum vitae reflecting practical application of the position outputs and the required competencies as advertised must be submitted by close of business on 17 September 2024, quoting the reference number NO/IS/IT-TEMP/30/08/2024 in the subject line to Recruit [at] legal-aid.co.za or apply online at www.legal-aid.co.za \n \nEnquiries to Blanche Gouws, Tel: 011 877 2000\n \nThe employment decision shall be informed by the Employment Equity Plan of Legal Aid SA. It is Legal Aid SA’s intention to promote equity (race, gender and disability) through the filling of this post(s) with a candidate whose transfer/promotion/appointment will promote representivity in line with the numerical targets as contained in our Employment Equity Plan. Legal Aid SA reserves the right to withdraw posts or not to make an appointment, if by doing so, the interests of Legal Aid SA will be best served.\n \nAPPLICANTS NOT CONTACTED WITHIN TWO (2) MONTHS MAY CONSIDER THEIR APPLICATION UNSUCCESSFUL."
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p544a61b0-52ec-4c9f-be00-5cd77980314c"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/mintek.jpg?1725387376",
      "href": "https://www.govpage.co.za/mintek-vacancies-blog/mintek-vacancies1728148",
      "title": "MINTEK VACANCIES",
      "content": [
        " \nMINTEK\n ",
        " \n \nICT SECURITY ANALYST\nListing reference: minte_000277\nListing status: Online\nApply by: 16 September 2024\nPosition summary\nIndustry: Scientific, Research & Development\nJob category: Network Administration and Security\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nMintek has an exciting career opportunity for an ICT Security Analyst. The successful candidate will ensure the security and integrity of MINTEK’s ICT infrastructure by implementing and managing key security systems, monitoring network traffic, responding to incidents, conducting risk assessment and ensuring compliance with regulations like POPIA. The ideal candidate will have strong cybersecurity skills and experience with various security tools.\n \nJob description\nSystem Administration and Security Management :\nFirewall Administration (IPS/IDS): Manage and monitor firewall configurations, ensuring optimal performance and security. Implement intrusion detection and prevention systems to protect against potential threats;\nEndpoint EDR Administration and Monitoring : Manage and monitor EDR systems by configuring policies, conducting threat hunts, analysing alerts, and ensuring updates. Implement behavioural detection and prevention to identify and mitigate threats, ensuring endpoint security and performance;\nVPN Management: Administer and secure virtual private network, ensuring secure remote access for users while monitoring for unauthorised access or breaches;\nMimecast Administration : Oversee the e-mail security platform, ensuring robust protection against phishing, malware, and other e-mail-based threats;\n KnowBe4 Security Awareness Training : Manage the security awareness platform, coordinating regular phishing simulations and training sessions to improve staff vigilance against social engineering attacks;\nSIEM Incident Remediation : Monitor security information and event management (SIEM) systems incidents, analyse security alerts, and respond to incidents promptly to mitigate risks;\nActive Directory (AD) Security : Ensure the security and integrity of the Active Directory environment by managing access controls, permissions, and group policies;\nCloud Security : Implement and manage security measures for cloud-based services, ensuring data protection and compliance with MINTEK’s security policies.\n \nSpecialized Security Administration:\n“Digital Signature ” Administration : Manage the digital signature platform, ensuring secure and compliant electronic document signing processes;\nData Governance : Develop and enforce data governance policies, ensuring the organization’s data is managed securely, consistently, and in compliance with regulations;\nVulnerability Management : Conduct regular vulnerability assessments, applying patches and updates as necessary, and ensuring systems are protected against known vulnerabilities.\n \nCompliance and Governance:\nPOPIA Compliance : Ensure all ICT operations and data management practices comply with the Protection of Personal Information Act (POPIA) requirements, implementing necessary controls and processes.\n \nCollaboration and Support:\nCross-ICT Sections Collaboration : Work closely with other sections in ICT to ensure security measures are integrated into all aspects of the organization’s operations;\nUser Support: Provide technical support and guidance to users regarding security practices and incident response procedures;\nMonthly Reporting : Prepare regular reports on security status, incidents, and compliance for senior management and regulatory bodies.\n \nMinimum requirements\n \nEDUCATION: \nMinimum: Bachelor’s degree in information technology, Computer Science, Information Systems, Cybersecurity, or a related field.\nIdeal: CompTIA's Security , CISSP or equivalent\n \nEXPERIENCE:\nMinimum of 3-5 years of experience in IT security, with specific experience in the administration of firewalls, VPNs, and SIEM systems;\nHands-on experience with firewalls, EDRs, email security, security awareness training, vulnerability management and AD security.\nExperience in cloud security and vulnerability management is essential.\n \nAPPLY\n \n \n \n \n ",
        "TECHNICIAN-IN-TRAINING (INTERNAL ONLY)\nListing reference: minte_000276\nListing status: Online\nApply by: 15 September 2024\nPosition summary\nIndustry: Scientific, Research & Development\nJob category: Others: RandD, Science and Scientific Research\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: No\n \nIntroduction\nTo perform assembly, installation, commissioning and maintenance of advanced process measurement instruments at plants worldwide.\n \nJob description\n·       Follow established procedures to install, commission and maintain Mintek equipment \n·       Examine electrical problems, identify source of problems and determine method for repair by electrical circuit diagrams \n·       Ensure that Mintek’s safety standards and procedures are sustained with regard to the scope of work and to uphold prescribed safety standard procedures in their workspace. \n·       Recommend improved work practices and amendments to procedures affecting workmanship and safety matters. \n·       Assist the supervisor with performing Safety inspections. \n·       Comply with client SHEQ procedures. \n·       Assemble, test and calibrate advanced process measurement instruments. \n\n·       Commission and maintain advanced process measurement instruments on site. \n·       Troubleshoot problems with equipment with minimal input from others. \n·       Assist development team as required. \n·       Completion of trip documentation \n·       Adhere to established operating procedures with regards to project administration. \n·       Work cooperatively with others \n·       Share functional expertise\n \nMinimum requirements\n \nQualifications And Experience \n·       National Diploma\n·       Passed trade test and a completed apprenticeship/work integrated learning\n·       Driver’s Licence (Code EB) within 6 months of appointment (condition of appointment)\n \nBehavioural Competencies:\n·      Team player who enjoys variety and has a strong affinity for planning and conducting new and innovative projects.\n·      Good interpersonal skills.\n·      Ability to work in a stressful and demanding environment.\n·      Willing to travel locally and internationally.\n \nAPPLY",
        "HR ADMINISTRATOR: REMUNERATION & BENEFITS (6 MONTHS CONTRACT)\nListing reference: minte_000275\nListing status: Online\nApply by: 6 September 2024\nPosition summary\nIndustry: Scientific, Research & Development\nJob category: HR Administration\nLocation: Randburg\nContract: Fixed Term Contract\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nMintek has an exciting career opportunity for an HR Administrator: Remuneration & Benefits. The successful candidate will be responsible for administering employee information processing through creation, maintaining, updating, and retention of employee information /files both manually and electronically. Ensuring 100% data integrity, whilst adhering to policies, procedures and legislation framework. All suitably qualified and experienced candidates are invited to apply.\n \nJob description\n \nOPERATIONS:\nData Integrity Project \nMaintain the employee master data, throughout the employee life cycle from joining to leaving, while adhering to the relevant policies, procedures and relevant legislation.\nHR Information System updates- Employee on-boarding, promotions, transfers, contract renewals, terminations, changes in conditions of employment, leave administration.\nDocument processing, data capturing, and filing to ensure we record all employee transactions.\nImprove administrative procedures and documentation (contribute to the improvement of internal systems and procedures, other input towards payroll calendar management)\nAssist with time, attendance and leave  administration requirements.\nEnsure employee data complies with reporting  requirements, such as EE/ BEE/ DoL, Remuneration Analysis. \nMaintain a meticulous and updated employee filing system for all employee movements.\nBenefits Administration Processes\nWork in collaboration with benefit administration consultants to ensure that the company and employees are well advised on legislation developments pertaining to pension, medical and risk benefits matters.\nEnsure that employees have access to, and receive Employee Benefits Advisory Services.\nAdminister benefit claims as per policies and regulations.\nUpdate employee files with the latest beneficiary information ( manually and electronically).\nGovernance and Risk\nEnsure compliance with the internal audit requirements of the organisation.\nEnsure compliance with the policies and procedures in order that the division gets clean audits.\nSystem compliance with data security and privacy requirements – POPI ACT.\nLegislative Requirements \nInterpret and apply statutory regulations and maintain HRIS system data changes (Employment Equity, Management Control –BEE Act, Basic Conditions of Employment  etc.).\nAdvice and guide managers and staff on company policies relating to conditions of employment when necessary such as leave administration, time management, overtime administration, pension fund, medical aid, risk benefits, and related claims etc.  \nMaintains compliance with all the relevant employment laws and regulations, and recommended best practices; reviews policies and practices to maintain compliance (employee life cycle –data management.\nMaintaining the integrity of Employment Equity Reports – and assist with Statistical Equity Reporting & BEE Reporting.\nFacilitate audits/verifications by providing records and documentation to auditors/ BEE /DoL/verification officers Keep files/documents - injury on duty claims and relevant documentation submitted to the Compensation Commissioner by SHEQ and Occupational Health.\n Reporting \nAssist the various departments with aggregated and analysed data / reports according to stakeholder specific requirements, adhoc reports, monthly, quarterly and annually.\nDevelop and maintain ad hocs reports to provide HR and other stakeholders with timely and accurate data.\nReport on Absenteeism, Sick Leave ( moved to Information Systems).\nReport on Employee Movements – Terminations, Hires,  Movements and other relevant changes.\nProvide regulatory reports BEE, EE, and Remuneration Analysis, Leave Management.\n People Development\nContribute towards guiding, coaching and mentoring the interns in the department.  \n \nCUSTOMER SERVICE:\nProvide Support Services \nAssisting staff with Employee Information related queries.\nProviding Support with Employee Self Service Portal (ESS), and Manager Self Service Portal (MSS)\nProviding information for monthly, quarterly and yearly statistics for various stakeholder reporting requirements\nEfficient processing of benefits during on -boarding, information updates, and withdrawals for pension fund, medical aid, death and disability claims, etc.\nConduct monthly/ quarterly induction presentations for new employees.\nCoordinate onsite presentations for medical aid, risk benefits, financial planning, etc.\n \nPROCESSES: \n Absenteeism\nEnsures implementation of Mintek policies and procedures regarding absenteeism. Monitors trends on absenteeism through utilising the HR systems (PaySpace, IFS and T&A) and forwards reports to managers and supervisors for follow up and action.\nAdministration \n Maintains  employee master data, throughout the employee life cycle from joining to leaving, while adhering to the relevant policies, procedures and relevant legislation.\n Ensures HR admin deadlines related to employee hire, termination and movements  are met at all times\nInputs of employee related data into HRIS (PaySpace, IFS and T&A), through  verification, scrutinizing and ensuring pre-approval alignment to policies and procedures before capturing.\nVerifies and approves all HR administration data and supporting documentation received viz appointments, terminations, salary increases, promotions, leave, PAR, terminations etc and forwards to HR & Admin Systems Controller for processing (daily).\nEnsures readily and accessible electronic and manual  HR records are maintained.\n Verifies and approves all HR administration data and supporting documentation received viz appointments, terminations, salary increases, promotions, leave, PAR, terminations etc and forwards to HR & Admin Systems Controller for processing (daily).\nEnsures that the asset register is signed and approved by the relevant stakeholders before employee termination is effected.\nEnsures document control and adherence to workflow processes.\nUpdates HR admin control registers and files - submits input for approval and forwards to finance and payroll for processing.\n  Audit\n Interact with relevant HR section and Payroll to ensure clean audit process; ensures compliance to audit findings and corrections are actioned within stipulated timeframe.\nSupport the internal and external auditors in verification of discrepancies and queries related to HR administration.\nBusiness processes and workflow\nAssists in analysing HR business processes, workflow and documents accordingly.\nGive inputs into policies and procedures.\nFiling \n Ensures an up-to-date and accurate filing system is maintained for HR admin at all times- both manually and electronically.\n Filing - ensures satisfactory filing and retrieving of documentation\n Filing - files all documents on personal files and ensures accurate and up-to-date information on personal files at all times.\nOvertime\nOpens and closes overtime claim sheet for Division to complete and informs accordingly.\nVerifies overtime pre-authorised with actual claimed - notifies line managers, employee and HR Systems Controller if 40 hours are exceeded and if overtime was not pre-authorised.\n  Leave management\n Verify and audit maternity, sick, annual leave applications, cross checking with employment contracts, policies, and legislation.\nControls and checks data for leave and sick leave; capitalisation of leave, unpaid leave, special leave etc and that these are accurately captured on system.\nVerifies leave input and requests - notifies line management and employee if not approved. Ensures availability and accrual of entitlements.\nPolicies and procedures \nInputs towards updating of Policies and procedures - maintains and updates HR Administration according to policies and procedures updates  utilising  Ms Word, Excel  in prescribed formats. Maintains and updates HR databases, Shared Drive accordingly. Liaises with the  HR  Multiple Disciplinary Teams  to ensure annual revision.\nParticipate in policy and procedure reviews.\nConduct  administrative functions and  ensure up-to-date knowledge of the HR administration processes, as well as all conditions of service.\nQueries and complaints management\nHandle employee queries and complaints regarding HR administration.\n  Reports\n Compile and submit HR admin reports - (monthly, quarterly).\nDraws relevant reports from HRIS (PaySpace, IFS and T&A)   Reports - draws relevant reports from HRIS (PaySpace, IFS and T&A).\nHRIS Systems \nMaintains master data (PaySpace, IFS and T&A).\nProcesses total package changes, new appointments, resignations, changes in status, promotions etc.\nProcesses hourly rates for contract/temporary/fixed term employees; ensures valid contract approval before processing.\nCompletes return on attendance reports (weekly) and forwards to HR System Controller and Head: HR Administration, follows up on Divisions not returning weekly attendance reports.\nRuns attendance reports and forwards to Divisions (monthly).\n Verifies and processes attendance reports returned from Divisions (monthly), records findings and submits report to HR Systems Controller and informs  Head: HR Shared Services if any discrepancies /anomalies, before forwarding to Payroll for processing.\n Verifies monthly interface file for payment - permanent and casuals. Verified information processed by Divisions. Clears all rejections and submits for approval before releasing to payroll for payment.\n \nMinimum requirements\nEducation:\n      Minimum:\nB degree in Human Resources or relevant field.\nCertificate in Payroll Administration (mandatory).\n     Ideal: \nExperience or training in Payroll Administration.\nExperience:\n3-5years' experience working with HR information systems & Payroll Inputs.\nIn-depth knowledge of HR business processes.\nIn-depth knowledge of Employee Master Data Administration, Remuneration and  Benefits.\nTraining:\n      Minimum:\nCompetent User of Pay Space, IFS, Time and Attendance, Intermediate Ms Office (importantly excel), HR, Leave, Payroll Information System modules.\nExternal Candidate - Payroll module, Employee Master Data module, Time & Attendance, Leave Administration, Excel.\n     Ideal:\nFunctional reporting skills.\nLegal:\n     Minimum: \nBasic Conditions of Employment, HR Policies and Procedures, Payroll and Leave Management, Time and Attendance, Labour Relations Act, BEE Act, POPI, Employment Equity Act, Skills Development Act. \n \nKnowledge, Skills and Abilities:\n Ability to work with stake holders such as employees, divisions, management and the relevant external   vendors.\nA high level of  expertise and broad knowledge of labour/employment legislation .\nHR administration processes - knowledge, understanding and the ability to apply them in day-to-day activities.\nHR information systems - knowledge, understanding and the ability to apply them in day-to-day activities.\nHR policies and procedures - knowledge, understanding and the ability to apply them in day-to-day activities.\nHR workflow - knowledge, understanding and the ability to apply them in day-to-day activities.\nManaging self: accountability, accuracy and attention to detail, customer service orientation, deadline driven, self motivation, communicating information, showing resilience, upholding standards.\nExcellent analytical skills.\nA methodical, investigative and inquisitive mind and attention to detail.\nGood interpersonal and client-handling skills, with the ability to manage expectations and explain technical detail.\nGood presentations skill.\nPolicy and process  writing ability.\n \nCompetency Required:\n   Strong analytical skills.\n   Strong administrative efficiency\n   Teamwork skills.\n   Change management skills\n   Written and verbal communication skills.\n Flexibility.\n   Adaptability.\n   Initiative.\n   Organised, thorough and systematic orientated\n   Highly skilled in MS Office Packages ( excel, word, power point)\n   Ability  work under pressure\n   Be able to work on deadlines\n   Excellent interpersonal and communication skills\n   A high level of accuracy and numerical skills\n   A high service-orientation and enjoy working in a team\n   Exceptional organisational skills and a high attention to detail\n   Sound knowledge of payroll, employee administration, benefits and remuneration\n   Functional Knowledge of systems ( HR, BEE Act , Employment Equity, Skills, Remuneration analysis, Basic Conditions of Employment, )\n \nAPPLY"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p4de95f4a-2262-46e2-95e5-ecdc4f024872"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-credit-regulator-ncr_orig.jpg",
      "href": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies8621798",
      "title": "NATIONAL CREDIT REGULATOR (NCR) VACANCIES",
      "content": [],
      "postedDate": "3/9/2024",
      "iframe": "https://drive.google.com/file/d/1RQSN4siN63CPUJn7yZdIYXXM-ApMmXDq/preview",
      "uuid": "p4ce9a054-ddad-4dc8-ac2b-3462317391bc"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-development-agency-nda_orig.jpg",
      "href": "https://www.govpage.co.za/national-development-agency-nda-vacancies-blog/national-development-agency-nda-vacancies1797428",
      "title": "NATIONAL DEVELOPMENT AGENCY (NDA) VACANCIES",
      "content": [
        " \nNATIONAL DEVELOPMENT AGENCY (NDA)\n ",
        "NDA PERMANENT POSITION\n \nThe National Development Agency is a Schedule 3A National Public Entity with a mandate for Poverty eradication and is accountable to Parliament through the Minister of Social Development. \n \nThe following position is available at the NDA:\n \nFINANCIAL ACCOUNTANT\n \nDescription\nThis position is primarily required to coordinate review and undertake the implementation of financial accounting systems and procedures in line with relevant legislation regulations, frameworks, polices and procedures. It is also required produce accurate monthly, quarterly and annual financial statements as well as to provide support for the efficient recording, disbursement and reporting of operational finances. The incumbent will ensure that proper accounting practices are followed in line with NDA’s financial policy and financial accounting requirements including GAAP, GRAP, IFRS, PFMA and National Treasury regulations.\n \nDirectorate Finance\nReports To Senior Manager: Finance\nPosition location Head Office\nPeromnes Grade 8\nNumber of Direct Reports 1 \n \nPOSITION REQUIREMENTS\n \nMinimum Qualification\n• A Bachelor of Commerce degree- Financial Accounting (NQF level 7)\n• Articles will be advantageous\n \nEssential Experience\n• Three years’ financial accounting and reporting experience\n• Post-articles experience would be advantageous\n• Experience with computerised accounting systems\n \nKnowledge\n• Working knowledge of accounting package e.g. Great Plains\n• Knowledge of GRAP, PFMA and National Treasury regulations\n• Knowledge of Public Administration and Accounting Systems\n• Knowledge of Corporate Governance\n \nSkills & Abilities\n▪ Leverage diversity\n▪ Negotiation skills\n▪ Service motivation\n▪ Creativity & innovation\n▪ Customer Service orientation\n▪ Technology orientation\n▪ Good communication skills – written & verbal\n▪ High numerical and analytical ability\n▪ Facilitation skills\n▪ Ability to work quickly and accurately and to adhere to and meet strict deadlines\n▪ Methodical and attentive to detail\n▪ Discreet and ability to work with confidential information\n▪ Flexible, i.e. ability to work as part of a team but also independently as required\n▪ Ability to stay current with legal and financial changes and ability to evaluate how these could affect NDA financial operations\n▪ Ability to produce up-to-date reconciliations\n▪ Understanding of general ledger set-up\n▪ Strong computer technical skills preferably with accounting packages and MS Office\n \nMAIN AREAS OF RESPONSIBILITY\n \nFinancial Management\n• Day to day management of recording of all financial transactions.\n• Review, posting and approval of financial transactions processed by accounts staff.\n• Review of monthly general ledger and weekly bank reconciliations. reconciliations\n• Review, posting and 1st level approval of payments to suppliers, funded projects, and salaries.\n• Perform cash management function. Ensure enough cash is held to pay obligations when they are due and ensure that cash surpluses are held in interest bearing investments.\n• Develop and maintain a record keeping system for the unit.\n• Prepare quarterly cash flow projections to determine cash required to meet obligations and funds that can be invested to maximise interest.\n• Prepare schedules and reconciliations required for year- end audit processes conducted by the Auditor General.\n• Ensure Accounting records are ready to be subjected to internal and External Audit processes.\n \nCorporate Governance\n• Ensure that all transactions recorded comply with applicable policies, laws and regulations (e, PFMA, Treasury Regulations, SARS, e.tc)\n• Ensure that all transactions are recorded in compliance with GRAP standards.\n• Train NDA staff on Finance processes to ensure compliance with NDA operating procedures and policies\n \nFinancial Analysis And Reporting\n• Prepare monthly and quarterly Management Accounts for internal decision-making purposes.\n\n• Prepare Annual Financial Statements that comply with standards of GRAP\n• Prepare any financial reports that may be required by NDA funders and stakeholders. (National Treasury, Executive Authority and any funders or donors)\n• Perform analysis of financial reports and reports on variances between budget and actuals and obtain reasons for variances.\n• Advise and support business units on analysis of financial reports and management of budgets.\n• Consolidate budget inputs and support Finance manager during preparation of budgets required in accordance with PFMA\n \nSTAFF MANAGEMENT\n• Manage performance and work of subordinates\n• Prepare and monitor performance contracts of subordinate.\n• Guide and supervise subordinates.\n \nInternal and External Audit\n• Ensure that Accounting records are complete, accurate and supported by necessary reconciliation\n• Maintain record keeping system that ensures that all transactions in the accounting records are supported by valid complete and compliant supporting records.\n• Attend to queries from Auditors and draft responses to findings raised.\n• Provide information requested by auditors during audits within agreed timelines\n \nKEY RELATIONSHIP INTERFACES\nInternal Relationships - other than reporting lines (manager and subordinates). *\n• All NDA Staff and Directorates\nExternal Relationships (With Local/Provincial structures and other key parties, specify)\n• Service Providers\n• Government Departments",
        "Application details: Full Job profile for this position is available on the NDA website – www.nda.org.za. A detailed Curriculum Vitae (CV), with three references must accompany the application and a fully completed application for employment form obtainable on www.nda.org.za must be emailed to careers@nda.org.za.\n \nCorrespondence will be limited to shortlisted candidates only. Preference will be given to candidates whose appointment will promote NDA Employment Equity targets. \n \nNB: Use the job reference as a subject line (heading of the email application) e.g. 2024FA1 \n \nAn email without the reference number as a subject/heading will be disqualified. Please ensure that the reference number is written the same way as in the advert. \n \nFailure to submit a detailed CV, fully completed application form and comply with the application instructions above will result in the disqualification of your application. \n \nFor enquiries regarding this position, please contact Ms. Kobela Matjea at Tel: 011 018 5500 / 5622. \n \nShould you not be contacted within two months of the closing date of this advert, please consider your application unsuccessful. All candidates will be subjected to personnel suitability checks, qualification verification and competency assessment where required. Correspondence will be made with shortlisted candidates ONLY. \n \nClosing date: 15 September 2024 \n \nUNLOCKING POTENTIAL"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p1929b770-9e98-47e5-a32c-c2cd2299fe39"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/national-home-builders-registration-council-nhbrc.png?1725387780",
      "href": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies4799202",
      "title": "NATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC) VACANCIES",
      "content": [
        " \nNATIONAL HOME BUILDERS REGISTRATION COUNCIL (NHBRC)\n ",
        " \n \nREGULATORY INVESTIGATOR\nCONTRACT TYPE : TEMPORARY\nJOB GRADE : COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\nREPORTING TO : MANAGER: REGULATORY ENFORCEMENT\nDEPARTMENT/SECTION : REGULATORY ENFORCEMENT\nLOCATION : HEAD OFFICE, SUNNINGHILL JHB\n \nKEY DELIVERABLES\nThe Regulatory Investigator is responsible for conducting investigations and enforcing laws and regulations related to the construction industry in South Africa with specific reference to criminal conduct as set out in Housing Consumers Protection Measures Act 95 of 1998. The individual will conduct investigations into potential criminal activity, gather evidence, prepare investigations report and open cases for criminal investigation and prosecution.\n \nThe Individual will primarily be responsible for, but not limited to the following:\n• Develop and implement investigative plans outlining the process, parameters, timelines and outputs consistent with policies and procedures under limited guidance;\n• Make decisions and recommendations regarding the right of reply or review on the closure of file.\n• Development and implementation of investigation policy.\n• Manage, plan and conduct investigations relating to defaulters (e.g. defaulting home builders) in terms of the Housing Consumers Protection Measures Act 95 of 1998, Regulations, Council Rules and Code of Conduct.\n• Conduct investigations by collecting information via interviews, taking statements and physical and electronic surveillance, having appropriately planned investigative tactics and strategies. – tracing and locating of subjects.\n• Analyse information and prepare reports relating to investigations and prepare briefs of evidence for assessment by the Manager.\n• Compile Investigation Reports.\n• Analyse queries and complaints trends and suggest solutions. Responding to queries and complaints.\n• Testify and/or present material evidence to relevant forums in a clear and concise manner.\n• Carry out ad hoc duties and investigations as required.\n• Assist in preparing cases for prosecution and presenting evidence at criminal and civil trials.\n• Attend court and give evidence obtained through the process of investigation.\n• Preparing and presenting reports to senior/executive management.\n• Provide relevant technical support to stakeholders to ensure team objectives are achieved.\n• Investigate and compile case files in respect of criminal offences for referral to SAPS.\n• Investigate and compile case files in respect of developers/contractors identified and referred to the NHBRC from various sources, including but not limited to National Department of Human Settlements, Ministerial Hotline and the NHBRC Fraud Hotline.\n• Collating and presenting material evidence and analysis in a clear and concise form which is relevant to and meets business expectations.\n• Providing management with advice on crime prevention and detection strategies.\n• Compile clear and concise reports for use in home builder disciplinary hearings and other relevant forums.\n• Report findings of investigations in an effective and unbiased manner.\n• Prepare reports and other documentation (monthly, quarterly and annual reporting).\n• Provide input into the budgeting process of the department.\n• Ensure that expenditure is in line with budget requirements, standards and policies.\n• Procure and safeguard assets of the function.\n• Build and maintain good working relationship with all stake holders to ensure effective and efficient investigations.\n• Conduct workshops to educate both internal and external stake holders of the role played by the Investigators within NHBRC and to advise them of the role each discipline can play in improving the service provided by the NHBRC in the regulation of the home building industry.\n• Liaise with the relevant prosecuting authority and SAPS in respect of criminal cases.\n• Engage with internal stakeholders to improve the flow of information during investigation process.\n• Maintain records of communication with stake holders, including builders, housing consultants and unregistered homebuilders.\n• Discuss and share investigation reports with relevant officials from entities such as National Prosecuting Authority; Municipalities and specialized units (e.g. Hawks) to ensure successful prosecutions.\n\nMINIMUM REQUIREMENTS:\n• Must hold an appropriate bachelor’s degree in (NQF 7) in Policing Law or Criminal Investigations\n• Minimum of five (5) years’ work experience in investigations\n• Recent and demonstrated experience in the conduct of criminal or complex investigations and information\n \nAPPOINTMENT\nThe above-mentioned position will be offered on temporary basis for a period of 1 year with a basic salary.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMr. Jabulani Ntshani\nTel: (011) 317 0496\n \nCLOSING DATE: 12 September 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Temporary Regulatory Investigator” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates will be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups.\n \n \n \n \n ",
        "PROSECUTOR: GAUTENG\nCONTRACT TYPE : TEMPORARY\nJOB GRADE : COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\nREPORTING TO : MANAGER: REGULATORY ENFORCEMENT\nLOCATION : HEAD OFFICE, SUNNINGHILL.\n \nKEY DELIVERABLES:\nThe role of the Prosecutor is responsible to oversee compliance with the Housing Consumers Protection Measures Act, Rules and Regulations through instituting disciplinary action against defaulting home builders, guiding and directing investigations, providing legal advice, and represent the NHBRC at the disciplinary hearing of home builders before the Disciplinary Committee.\n \nThe Individual will primarily be responsible for, but not limited to the following:\n• Review new instructions and decide if suspension is warranted\n• Draft suspension memo recommending suspension to the COO or any delegated official.\n• Upon final decision by the COO or any delegated official, ensure that relevant stakeholders are notified of the suspension.\n• Implement any other instruction or request from Manager Regulatory Enforcement, COO or delegated official.\n• Respond to suspension queries and advise homebuilder what legal requirements must be complied with for the suspension to be lifted.\n• Review new instructions and decide on the prospects of successful prosecution\n• Provide guidance regarding further investigation on the prosecutorial matters.\n• Collate evidence for prosecution matters.\n• Draft and submit valid affidavits and charge letters to home builders.\n• Draft and issue charge sheets.\n• Peruse legal representations (disputing the charges or request to be exonerated from the contravention) and judiciously consider same from Home Builders and their legal representatives.\n• Conduct legal research based on the legal representations received to make a legally informed decision on the representations.\n• Communicate decision to prosecute or exonerate to relevant stakeholders.\n• Draft summons memo and issue summons.\n• Compile witness list.\n• Draft Disciplinary Hearing roll;\n• Serve DC roll upon relevant witnesses and stakeholders.\n• Compiling evidential bundle for DC hearings.\n• Consult with witnesses to ensure successful prosecution of matters.\n• Liaise with Secretariat regarding disciplinary hearing dates to ensure efficient scheduling of cases and availability of Disciplinary Committee members.\n• Oversee the appointment of Interpreters in the regions where required.\n• Attend to preliminary issues to establish facts that are common cause and facts in dispute\n• Present prosecution’s case in the form of viva voce (oral) and documentary evidence.\n• Chief Examination-lead witnesses and re-examine where necessary.\n• Raise objections to protect the prosecution’s witness\n• Cross examine defense witnesses.\n• Prepare and draft arguments on merits.\n• Conduct research to support arguments.\n• Drafts heads of arguments.\n• Present closing arguments.\n• Establish if homebuilder has previous convictions and present same.\n• Prepare and draft arguments and present aggravating factors.\n• Make further oral submission in response to the defense argument.\n• Recommend sanctions to the Disciplinary Committee.\n• Review instructions and decide if grounds exist for suspension to be uplifted.\n• Verify compliance with relevant departments.\n• Instruct Technical officials to investigate and prepare reports for submission to prosecution regarding alleged compliance by a homebuilder.\n• Draft memo recommending suspension upliftment to the COO or any delegated official.\n• Upon final decision by the COO or any delegated official, ensure that relevant stakeholders are notified of the suspension upliftment.\n• Respond to upliftment queries.\n• Ensure suspension of homebuilders that have failed to comply with DC verdicts\n• Identify and eliminate waste within own area of responsibility to ensure operational excellence\n• Monitor expenditure of subordinates in order to eliminate fruitless and wasteful expenditure e.g., travel requests.\n\n• Planning & Scheduling of DC hearings to minimize DC expenses on transport, accommodation, catering, transcription, printing and DC Members costs.\n• Planning and Organising by assigning some responsibilities, on a temporary basis, to less burdened officials in order to alleviate pressure from overburdened officials.\n• Prepare ad hoc reports as and when required.\n• Ensure periodic reports are compiled and submitted.\n• Develop and review policy document.\n• Identify and recommend initiatives aimed at saving costs for the Section.\n• Assist, where possible, with the implementation of the above initiatives to ensure operational excellence.\n• Support and participate in change management initiatives as part of contributing to the organisation’s transformation.\n• Provide inputs in drafting and review of enforcement policies, procedures and process maps.\n• Assist in drafting enforcement policies as and when required by the Manager.\n• Respond to audit findings.\n• Advise Manager on emerging risks affecting the Enforcement Section and the organization.\n• Prepare ad-hoc reports for submission to the NHBRC Management, Committees of Council and other stakeholders as requested by Manager.\n• Assist Legal Services by providing inputs in the review of the Act\n• Vetting of policies relating to enforcement of the Act (Inspection, Registration, Enrolment, etc.).\n• Attendance and participation in committees, meetings and forums as requested.\n• Provide input into the budgeting process of the department.\n• Ensure that expenditure is in line with budget requirements, standards and policies.\n• Procure and safeguard assets of the function.\n• Contribute to revenue collection for the organization by ensuring compliance with imposed penalties thus deterring builders from repeated non-compliance.\n• Recover optimal amounts of Disciplinary Hearing fines without resorting to costly litigations measure.\n• Liaise with Secretariat to obtain Disciplinary Rulings.\n• Review written rulings and liaise with Secretariat to obtain amended rulings.\n• Oversee the serving of disciplinary hearing outcome reports upon homebuilders.\n• Conduct follow up on payments.\n• Receive and review requests for deferred payment of fines and communicate decision to relevant stakeholders.\n• Draft Acknowledgement of Debt.\n• Monitor and review payments.\n• Ensure payment allocation of fines by Finance Department.\n• Notify Litigation Unit, Regulatory Enforcement Manager, Paralegal and relevant provinces regarding payments made.\n• Refer matters to Litigation Unit where builders fail to honour DC ruling or AOD (where payment arrangements were made).\n• Conduct legal research in preparation of training interventions.\n• Provide legal advice and support to internal and external stakeholders in relation to applicable legislative and regulatory framework.\n• Undertake training and awareness initiatives, on applicable legislative/regulatory framework to ensure compliance thereto, for stakeholders such as: home builders, financial institutions, conveyancers, SAPS, NPA, Municipal Inspectors, and internal stakeholders.\n• Timeous submission of performance agreements and reviews.\n• Conduct performance management and monitor performance on an on ongoing basis through mentoring, coaching, and reviews and take appropriate steps to correct performance issues.\n• Deal with grievances, conflict and disciplinary issues and take appropriate actions in accordance with NHBRC Policy.\n• Recruitment and selection of suitable candidates according to recruitment and selection procedures and EE targets within area of responsibility.\n \nMINIMUM REQUIREMENTS:\n• Must hold an LLB and or appropriate bachelor’s degree (NQF 7)\n• Minimum of five (5) years’ work experience in prosecutions and criminal investigations\n• Minimum of three (3) years’ supervisory experience\n• Recent and demonstrated experience in the conduct of criminal or complex investigations and prosecutions\n \nAPPOINTMENT\nThe above-mentioned position will be offered on a temporary basis for a period of 1 year with a Total Cost To Company package.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMr. Jabulani Ntshani\nTel: (011) 317 0496\n \nCLOSING DATE: 12 September 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Temporary Prosecutor: Gauteng’’ in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates will be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups.",
        "TEMPORARY SPECIALIST: ITDT GOVERNANCE AND INFORMATION SECURITY\nCONTRACT TYPE : TEMPORARY\nJOB GRADE : COMPETITIVE SALARY ALIGNED TO NHBRC SALARY GRADES\nREPORTING TO : CHIEF INFORMATION OFFICER\nDEPARTMENT/SECTION : INFORMATION TECHNOLOGY AND DIGITAL TRANSFORMATION\nLOCATION : HEAD OFFICE, SUNNINGHILL JHB\n \nKEY DELIVERABLES\nThe Specialist: ITDT Governance and Information Security is responsible for ensuring the operations of the NHBRC information security solutions and establishing maturing an enterprise security stance through policy, architecture, and training processes.\n \nThe Individual will primarily be responsible for, but not limited to the following:\n• Develop and implement the ITDT Governance Framework within the NHBRC.\n• Oversee ITDT Governance Risk assessments and Audits.\n• Develop and implement ITDT system change processes.\n• Establish ITDT change control committee and implement terms of reference.\n• Engage with peers in the Applications and ITDT Infrastructure teams in all business units to ensure enterprise-wide understanding of security goals, to solicit feedback and to foster co-operation.\n• Develop and implement an information security strategy for the organisation.\n• Oversee the deployment, integration, and initial configuration of all new security solutions.\n• Implement enhancements to existing security solutions in accordance with standard best operating procedures generically and the enterprise security document specifically.\n• Develop and maintain the enterprise information security architecture.\n• Develop and maintain the enterprise security awareness training program.\n• Select and acquire additional security solutions or enhancements to existing security solutions to improve enterprise security as per the enterprise existing procurement processes.\n• Ensure the confidentiality, integrity and availability of the data residing on or transmitted to/from/through enterprise workstations, servers, and other systems and in databases and other data repositories.\n• Provide information for investigations into problematic activity and provide communication with senior management.\n• Plan and execute vulnerability assessments, penetration tests and security audits.\n• Align ICT contracts with signed SLA.\n• Develop, monitor, and review the enterprise information security policies, procedures, standards, process flow s and forms.\n• Contribute to the development of and maintenance of the risk register of ITDT Governance and Information Security Risks\n• Compile reports and other documentation for internal stakeholders and council sub committees.\n• Collaborate with the compliance function in respect of monitoring and implementation Acts and Regulations.\n• Respond to audit findings.\n• Recommend actions on the improvement of systems and practices from a ICT Governance and Security perspective.\n• Ensures adherence to all policies, procedures, and applicable laws.\n• Manage Service Level Agreements (SLA) with external service providers.\n• Maintain project costing information on assigned projects.\n• Perform regular security awareness training for all employees to ensure consistently high levels of compliance with enterprise security documents.\n• Build and maintain good working relationship with all stake holders to ensure effective and efficient ICT Governance and Security environment.\n• Implement remedial actions where required.\n• Provide relevant technical support to stakeholders to ensure team objectives are achieved.\n\n\nMINIMUM REQUIREMENTS:\n• Matric/Grade12 Certificate\n• Minimum of a bachelor’s degree (NQF 7) in IT/Computers Science.\n• Minimum five (5) years’ experience in ICT and Information Security.\n• Relevant Information Security Certification.\n• Relevant Risk Management Certification\n \nAPPOINTMENT\nThe above-mentioned position will be offered on temporary basis with a basic salary.\n \nENQUIRIES:\nPlease note the following contact details are for enquiries about JOB CONTENT ONLY and NOT for application purposes.\nMs. Jabulani Ntshani\nTel: (011) 317 0496\n \nCLOSING DATE: 10 September 2024\n \nAPPLICATION PROCESS:\nPlease email your CV to recruitment@nhbrc.org.za with “Temporary Specialist: ITDT Governance and Information Security” in the subject line. Applicants are informed that correspondence will be limited to short-listed candidates only. If notification of an interview is not received within 1 month after the closing date, candidates may regard their application as unsuccessful.\n \nDisclaimer: The National Home Builders Registration Council (NHBRC) will consider all applications in terms of its Employment Equity Plan. The NHBRC reserves the right not to make an appointment. Candidates will be subjected to appropriate psychometric testing and other selection instruments. In conjunction to merit on the basis of qualifications, experience and proven achievements the National Home Builders Registration Council is committed to providing equal employment opportunities for persons with disabilities and those individuals from the historically disadvantaged groups."
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "pb2de5dda-0347-4932-9e09-065fa9791d0f"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/psira_orig.jpg",
      "href": "https://www.govpage.co.za/private-security-industry-regulatory-authority-psira-vacancies-blog/private-security-industry-regulatory-authority-psira-vacancies6229403",
      "title": "PRIVATE SECURITY INDUSTRY REGULATORY AUTHORITY (PSIRA) VACANCIES",
      "content": [
        " \nPRIVATE SECURITY INDUSTRY REGULATORY AUTHORITY (PSIRA)\n \nThe Private Security Industry Regulatory Authority (PSiRA) with its head office in Eco Park - Centurion is the statutory body regulating the private security industry in South Africa. PSiRA is looking for dynamic experienced and suitably qualified professionals to take up these challenging positions. It is the intention of the Authority to promote representative through the filling of these positions.\n ",
        " \n \nMANAGER: FINANCIAL REPORTING & ASSET MANAGEMENT\nAll-inclusive package of R 1 111 724 per annum (Centurion)\n \nRequirements: Degree or National Diploma in Accounting or Management Accounting, coupled with 6 to 8 years of experience in financial reporting and asset management within a large to medium-sized organizational environment (preferably in the public sector) of which two (02) years should be at the Team Leader or Supervisor level● Recognition of Prior Learning (RPL) and relevant knowledge and experience on the job may be considered during the selection process● Articles or professional accounting qualifications would be an added advantage. \n \nEssential Criteria: In-depth knowledge of GRAP/IFRS, King III/IV, PFMA, National Treasury Regulations, and the Preferential Procurement Policy Framework Act ●High proficiency with spreadsheet and accounting software programs ●Strong analytical and problem-solving skills, with the ability to conduct root cause analysis and identify opportunities for improvement ● Excellent verbal, written, and interpersonal communication skills ●Proven ability to lead and develop a finance team, with a focus on achieving accuracy, efficiency, and compliance. \n \nKey Performance Areas: Finance and bookkeeping: Coordinate the management of the trial balance to ensure that all items are correctly allocated● Preparation of the annual financial statements● Implementation of systems of internal controls ●Manage the asset life cycle and ensure adherence to budget provisions in liaison with the respective stakeholders● Review insurance and public liability claims, consolidate and present findings and trends to the Senior Manager ●Establish and maintain robust internal controls to safeguard company assets and ensure accurate financial reporting● Ensure that assets are accurately accounted for in accordance with the applicable GRAP accounting standards● Coordinating the preparation and submission of financial reports according to treasury regulations and guidelines ● Participate in the audit process to ensure that PSiRA receives an unqualified audit report● Ensure that internal and external audit queries are resolved timely and that information is provided ● Ability to promote teamwork ●Ability to take key decisions in complex situations and stand by decision/s taken.\n \nPLEASE APPLY HERE\n \n \n ",
        " \n \n \n \n \nACCOUNTANT: FINANCIAL REPORTING & ASSETS MANAGEMENT \nSalary: R 724 287 basic salary P/A plus benefits (Centurion)\n \nRequirements: Degree or National Diploma in Accounting coupled with 5 to 6 years? experience in the Accounting or Finance environment, of which two (2) years should be at the Team Leader or Supervisor level● Recognition of Prior Learning (RPL) and applicable knowledge and experience on the job may be considered during the selection process. \n \nEssential Criteria ● Strong understanding of GRAP and PFMA regulations and their application in financial reporting● Proficiency in processing journal entries, managing accruals, trade payables, and preparing financial reconciliations ●Excellent attention to detail, with strong analytical and problem-solving skills ● Good communication skills, both verbal and written, with the ability to effectively interact with team members and other departments ● Ability to manage multiple tasks and meet deadlines in a fast-paced environment● Experience in document management and compliance with regulatory standards. \n \nKey Performance Areas: Assist in the preparation of financial statements, ensuring compliance with GRAP and PFMA ● Identify and resolve discrepancies in financial records, ensuring accuracy and reliability of financial information ● Process accruals for suppliers and manage the journal entries after approval from the Manager: Reporting & Assets Management ●Handle the processing of all recurring monthly journals, as well as the preparation of year-end and reallocation journals ● Manage and maintain accurate records of fixed assets, including acquisitions, disposals, and depreciation ●Conduct periodic analysis of asset data to identify and rectify discrepancies or irregularities ● Support the implementation of asset management policies and ensure that assets are properly accounted for according to Accounting standards ● Ensure all financial processes and records comply with auditing standards and regulatory requirements● Participate in the reconciliation of Balance Sheet accounts, ensuring accuracy and completeness ● Maintain process compliance by ensuring that all financial operations align with internal controls and policies ● Prepare and manage documentation for audits, ensuring timely and accurate submission of reports ● Assist in the resolution of audit queries, providing necessary information and documentation to internal and external auditors ● Support team productivity by ensuring timely completion of tasks and adherence to performance metrics ●Foster positive relationships with internal stakeholders by delivering high-quality financial reports and addressing queries promptly. \n \nPLEASE APPLY HERE\n \n \n \n \n ",
        " \n \n \n \n \nSUPPLY CHAIN MANAGEMENT SPECIALIST\nAll-Inclusive package of R 1 111 724 per annum (Centurion)\n\n \nRequirements: Degree/National Diploma in Supply Chain Management/Logistics or Finance coupled with 5 to 6 years’ experience in Supply Chain Management environment, of which two (2) years should be at Team Leader/Supervisor level ●Recognition of Prior Learning (RPL) and applicable knowledge and experience on the Job may be considered during the selection process. \n \nEssential Criteria: The Constitution, PFMA, PPPFA, Treasury regulations as well as general understanding of BBBEE Act requirement in line with procurement compliance ●Comprehensive knowledge and understanding of SCM best practices. Comprehensive understanding of legislation/prescripts. \n \nKey Performance Areas: Project Management: Demonstrable capability of leading and driving project-based exercises to completion● Procurement and demand plan management: Conducts in-depth market research and analysis of historical expenditure all procurement related activities● Lead the pivotal operations of driving cost-effective procurement practices, fostering supplier relationships, and ensures supply chain integrity● Align procurement plan with project plans to enable execution in line with appropriate procurement strategies and approvals● Liaise with suppliers and provide support as required to all stakeholders during the project life cycle● Facilitate of negotiations process with potential service providers to ensure value for money in obtained in procurement process● Monitor commodity markets, pricing trends, and supply availability● Reporting on other methods of procurement ●Travel Management: Execution of travel related processes and procedures by facilitating day-to-day arrangements for all travel related activities, including flight arrangements, visa applications, vendor negotiations and contracts ● Contract Management: Provide oversight of the contract management process, as well as the development of specific standards for bidding and submission, contract negotiation, and document management● Ensuring that suppliers deliver against contractual SLAs and requirements of business units in achieving objectives● Managing escalations/disputes between Suppliers and Business users ● Supplier Development: Manage supplier relationships, including research, vetting, and performance evaluation ●On-board new clients with efficient sourcing, purchasing, and management of goods and services that meet the company's requirements and standards● Manages data, business partnerships and project opportunities required to meet metrics for success ●Cultivate and manage relationships with suppliers and logistics companies to negotiate contracts and terms that benefit the organisation ●Identify cost-saving opportunities while maintaining quality standards and ensuring timely delivery● Evaluate supplier performance and implement improvements or changes as necessary● Employee management: ? Lead, develop, and manage the human capital and ensure sound financial management of the unit. \n \nPLEASE APPLY HERE\n \n \n \n \n ",
        "COMMITTEES COORDINATOR \nSalary: R 724 287 basic salary P/A plus benefits (Centurion)\n \nRequirements: Recognised Degree/ National Diploma in Law and/or corporate governance qualification coupled with at least 3 years’ experience working with Board/Council Committees ● CIS qualification or registration for same will be an added advantage. \n \nEssential criteria: Interpretation of statutes ● Ability to work under pressure ● Document Control or Record Management● Client & service orientated ● Excellent verbal and written communication skills (to all levels & personalities) ● Excellent people/interpersonal skills (incl. diplomacy & problem solving) ● Advanced computer literacy in MS Office packages - Word, Excel, PowerPoint. ● Excellent planning and organising skills ● Excellent reporting skills ● Strong analytical and problem-solving skills ● Excellent negotiation skills ● Supervisory skills ● Advanced writing skills. \n \nKey Performance Areas: Provide Council Committees support as per King Report on Corporate Governance: Provide secretariat, legal and administrative support to Council Committees to ensure their effective and efficient functioning ● Schedule and administer arrangements for Council Committee meetings, circulate meeting agendas, and preparation and compilation of Committee meeting packs ● Assist with the coordination and facilitation of induction of new committee members and governance developmental training ● Attend the Council committees’ meetings in order to ensure that the legal requirements are fulfilled and decisions are legally sound and rational, accurate records, minutes are kept and provide such advice and information as is necessary ● Governance and Statutory Responsibilities: Ensure that the Council committees’ charters and terms of reference are kept up to date ● Ensure that the minutes of the Council Subcommittees are signed and kept safe ● Ensure proper record keeping, including disclosures of interests and performance assessments of Committees and individual members ● Administrative Responsibilities: Provide administrative support to Committee Chairpersons including, amongst others document sourcing and/or preparation, document delivery and collection and arrange meetings, travel, and accommodation logistics ● Maintain and update Committees’ membership records as and when required, and monitor the filing, security and availability of the Committee’s records ● Preparation and circulation of Committee meeting agenda packs, action lists and minutes ● Communicate Committee decisions and requests to relevant staff, and monitor and report on the implementation of decisions ● Assist with the preparation of Committee reports as may be required ● Receive, process and ensure payment of Committee members’ claims for meetings and travel, and update members’ payment records; and Maintain in-house documents in accordance with the existing practices.\n \nPLEASE APPLY HERE",
        "PROJECT ADMINISTRATOR\nSalary: R 318 409 P/A plus benefits (Centurion)\n \nRequirements: A recognised Degree or Diploma in Business Administration/Project Management or equivalent NQF level 6 qualification coupled with 2 to 3 years’ experience in the management or coordination of projects ● A certificate in project management will be an advantage ● A valid driver’s license ● Recognition of Prior Learning (RPL) and experience on the Job may be considered during the selection process. \n \nEssential criteria: Proficient in relevant Microsoft Office Packages ● Good oral and written communication skills ●Knowledge of legislations ●Interpersonal Skills ●Computer Literate ●Organizational Skills ● A calm, logical approach with an ability to work and deliver under pressure ●Professionalism ●The successful candidate is expected to have his/her own reliable vehicle. \n \nKey Performance Areas: Provide administrative and support to the Project Officer ● Assist the Project Manager in planning, scheduling, and executing project activities ● Coordinate meetings, prepare agendas, and take minutes ● Attend meetings internally, externally and assist Project Officer with determination of project requirements ● Assist Project team in drafting of project related documentation including but not limited to concept proposals, preliminary schedules etc ● In absence of Project Officer, chair unit projects meetings and distribute minutes to all project stakeholders ● Coordinate the planning and management for internal and external project management activities ● Coordinate engagements between other business units and project management unit at operational level ● Liaise with allocated projects resources to track and assist in monitoring progress on set targets ● Assist the project management team in the review of any project related documents that may arise over the course of the project ● Prepare and maintain proper centralised project directory for potential audit with reference ● Attend and participate in all project management forums/ or meeting as required to represent the Project Management. Maintain and update project documentation, including contracts, reports, and project plans ● Ensure all project documents are properly filed and accessible to team members. \n \nPLEASE APPLY HERE"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p32c31cd6-7850-4b5a-b83e-00555a0aa18a"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/shra_orig.png",
      "href": "https://www.govpage.co.za/social-housing-regulatory-authority-shra-vacancies-blog/social-housing-regulatory-authority-shra-vacancies5605689",
      "title": "SOCIAL HOUSING REGULATORY AUTHORITY (SHRA) VACANCIES",
      "content": [
        " \nSOCIAL HOUSING REGULATORY AUTHORITY (SHRA)\n ",
        "1. COMPLIANCE, ACCREDITATION AND REGULATIONS EXECUTIVE\n \nKey stakeholders the Compliance, Regulation and Accreditation Executive will engage with are:\n• Council and Council Sub-Committees\n• CEO\n• Exco\n• SHIs and Project Leaders\n• Service providers\n• Attorneys\n• Department of Human Settlements\n• Private and Public Sector\n \nREQUIREMENTS:\nQualifications/Knowledge (including most relevant field of study)\n• A post graduate degree or equivalent in commerce, project management or similar is required\n• Required computer literacy\n \nEXPERIENCE:\n• 5 years senior leadership experience is required\n• 3 years Council interaction experience is required\n• 10 years compliance and/or regulatory related experience is required\n• 5 years public sector experience is required\n \n \n \n \n \n2. SELECTION OF BOARDS OF DIRECTORS \n \nInvitation for nomination of candidates for the National Department of Human Settlements’ database for selection of the boards of directors (BOARDS) of Community Schemes Ombud Service (CSOS), Housing Development Agency (HDA), National Housing Finance Corporation (NHFC), National Home Builders Registration Council (NHBRC), Property Practitioners Regulatory Authority (PPRA), Social Housing Regulatory Authority (SHRA) and office of disclosure.\nRef. no: dhs/igr/001/24\n \nThe Department of Human Settlements (DHS) hereby invites nominations from individuals, organisations, institutions and civil society structures for suitable candidates to be included in the DHS database for selection on the Boards of Public Entities/SOCs/Regulatory Offices/Oversight offices that report to the Minister of Human Settlements.\n \nREQUIREMENTS:\nThe Minister of Human Settlements intends to establish a Database of persons who, when viewed collectively have wide experience and who: Are suited to serve on the Board by virtue of their qualifications, expertise and experience in the fields of Strategic Leadership, Financial Management, Dispute Resolution, Township Planning, Land Development, Project Management, Property Management, Development Finance, Public Finance, Global Economic Analysis, Legal, Policy Development, Land Reform, Infrastructure Development, Civil Engineering, Environmental Engineering, Transformation, Information Technology, Compliance, Auditing, Risk Management, Accounting, Actuarial Science, Human Resources Management, Public Education and Training, Promotion and Protection of Consumer Interests, Property Practitioners, Property Estate Management and Administration, Banking, Home Loans, Credit Risk, Knowledge of the Consumer and Credit landscape, Insurance, Intergovernmental Relations, Supply Chain Management, Investment Management, Commerce, Finance, Corporate Governance, Socio-economic Development, Public Policy, Business, Public Administration, Social Housing, Property and Rental Administration, Construction, Community Schemes Administration Policy development, skills, ethics and experience.\nThe Minister of Human Settlements intends to establish a Database that will remain valid for a period of five (5) years. The Database will be used to appoint a full Board or fill any vacancy that will exist from the Boards from a pool of candidates who will be in the Database. Members of the public are hereby invited to nominate persons who have the required knowledge, skills, understanding of the mandate and experience in any of the Entities of the Department of Human Settlements listed above to send their nominations.",
        "NOMINATION PROCEDURE:\n(a) Written nominations must contain the full name, address and contact numbers of the person or organisation making the nomination. A signed acceptance of the nomination by the nominee.\n(b) A Curriculum Vitae of the nominee, providing the following information: Full name; Identity number and gender; latest address; contact(s) details including cellphone and email; previous experience quoting dates and organisations or institutions concerned; academic qualifications and other directorships; certified copy of the identity document and qualifications; At least two names and contact details of references, Membership of all Boards the nominee currently serves on or has served on in the past ten (10) years and any other information that may be of assistance to the DHS in making recommendations.\nFurther considerations: Self-nomination is not allowed. Security clearance in the form of background verification including criminal records, directorship, ITC and citizenship checks will form part of the selection process. It is the responsibility of the nominee to have foreign qualifications verified by the South African Qualifications Authority (SAQA). Preference will be given to candidates whose appointment will enhance representativity.\nDisclaimer: The DHS reserves the right to amend, modify or withdraw this advert or to amend, modify or terminate any of the requirements set out herein at any time and from time to time, without prior notice and without liability to compensate or reimburse any party. Nominations do not mean acceptance as candidates and all nominees will be subject to the DHS’ determined recruitment and selection process for this purpose. The DHS reserves the right not to select any nominee as a candidate.\n\n\nThe Minister of Human Settlements reserves the right to determine the appropriate remuneration allowances and other benefits of the Chairperson and other Board members.\nThe nomination must be emailed to edatabase1@dhs.gov.za for the attention of the Director-General, Department of Human Settlements. \n \nFor enquiries: Ms Sindisiwe Ngxongo at (012) 421 1742/1717.\n\nN.B. Women, youth and persons with disabilities are encouraged to apply. \nCorrespondence will be limited to the successful candidates. \nSuccessful candidates will be subjected to security vetting.\n\nThe closing date for the nominations: 23 September 2024"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "pf9a21962-da66-4c77-825e-3ff477e5f5b2"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/safcol_orig.jpg",
      "href": "https://www.govpage.co.za/south-african-forestry-company-safcol-vacancies-blog/south-african-forestry-company-safcol-vacancies9300680",
      "title": "SOUTH AFRICAN FORESTRY COMPANY (SAFCOL) VACANCIES",
      "content": [
        " \nSOUTH AFRICAN FORESTRY COMPANY (SAFCOL)\n ",
        "SENIOR FORESTER: SILVICULTURE X2 (1X BERLIN, 1X ENTABENI PLANTATION)\nStatus: Permanent\nLocation: Berlin/Entabeni Plantation\nGrade: C5\nReporting line: Plantation Manager\n \nRole Mandate\nTo manage all growing stock in SAFCOL plantation (Berlin/Entabeni Plantation) by implementing silviculture practices according to BOP standards.\n \nKey Accountabilities\n• Manage silviculture activities and contractors and establishment programme by:\nPerforming growth stock planning, identify nature and type of plants to be planted for specific conditions\nDetermining planting regime and assessing sites for re-generation\nIdentifying correct fertilizer type and application\nPerforming blanking assessments to replace dead plants and assessing watering needs in winter plants\n• Perform fire management by:\nCompiling burning register and fire plan\nAssessing if fuel reduction burn is required before planting\nDeveloping and managing fuel reduction burns in mature compartments\nObtaining burning permits\nManaging annual firebreak preparations and burning of fire breaks\nAttending fire association meetings and ensuring suppression of fire\n• Manage pruning process by:\nManaging process according to APO and regimes\nManaging task determination by keeping track of the amount of trees to be pruned per worker\n• Manage marking of trees for thinning, develop and manage plantation weed control plan\n• Ensure proper management of conservation areas by controlling weeding, erosion, controlling escapees (weeds)\n• Update and implement management unit clearing plan, conservation management plan, environmental management plan\n• Identify CAPEX needs, compile detail annual silviculture budget and consolidate budget for the section\n• Monitor sectional budget and manage fuel consumption of vehicles under area of control\n• Manage assets and ensure proper utilisation and preventative maintenance plan is executed\n• Extract data from IMS for daily operations and reporting\n• Ensure correct utilisation of equipment by teams\n• Ensure team adherence to health and safety standards and environmental practices\n• Manage fire-fighting operations, practices and monitor Personal Protective Equipment (PPE) usage\n• Ensure toolbox talks, perform incident investigations and identify training needs\n• Organise Safety, Health and Environmental (SHE) awareness initiatives\n\n• Build and maintain relationships with the community regarding firewood, sand mining, fire prevention, and illegal activities\n• Facilitate engagements with internal support functions to ensure cooperation within the business\n• Supervise Silviculture team to ensure effective daily operations\n• Coach and mentor team members on a daily basis to improve productivity\n• Monitor team members to ensure planned training needs is undertaken\n \nMinimum Requirements\n• Grade 12\n• National Diploma in Forestry (NQF level 6)\n• B-Tech or BSc Degree in Forestry (NQF level 7) will be added advantage\n• 3 – 5 Years’ experience in silviculture operations\n• Valid driver’s license\n \nLeadership Competencies\n• Driving change\n• Operational delivery\n• Self-awareness\n• Business acumen\n• People management\n \nBehavioural Competencies\n• Relationship building\n• Communication\n• Planning and Organising\n• Conflict Management\n• Problem solving\n• Stakeholder management\n \nTechnical Competencies\n• Process flow management\n• Total quality management\n• Mechanical and maintenance\n• Safety management\n• Fire prevention and control\n• Silviculture practices\n• Computer literacy",
        "SAFCOL Group is an equal opportunity company with the focus on gender equality and people with disabilities.\n \nEmployment Equity will be taken into consideration in terms of all appointments within SAFCOL.\n \nInterested qualified individuals can e-mail a concise CV and must submit relevant copies of qualifications in confidence to:\nMs. Magdeline Selopyane, Human Capital Practitioner, magdalinerecruitment@safcol.co.za  Tel no: 013 754 2700\n \nClosing date: 06 September 2024\n \nShould you not have received a response within 30 days of the closing date, please consider your application unsuccessful."
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p4fd23b52-5386-4cba-bc43-b559a056686e"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/salb.jpeg?1725389066",
      "href": "https://www.govpage.co.za/south-african-library-for-the-blind-salb-vacancies-blog/south-african-library-for-the-blind-salb-vacancies8951464",
      "title": "SOUTH AFRICAN LIBRARY FOR THE BLIND (SALB) VACANCIES",
      "content": [
        " \nSOUTH AFRICAN LIBRARY FOR THE BLIND (SALB)\n ",
        "Employment Opportunity (Re: Advertisement) \n \nThe South African Library for the Blind is a Schedule 3A Public Entity, an agency of the National Department of Sports, Arts and Culture, and is governed by the provisions of the South African Library for the Blind Act, 91 of 1998. \nApplications are invited from suitably qualified South African citizens for the following 3-year contract position to commence on 1 November 2024 or earlier: \n \nPROJECT ACCOUNTANT \n3 YEAR CONTRACT TERM \n \nOVERVIEW OF POST: \nThe main responsibility of the Project Accountant is to render a comprehensive and professional accounting and financial administrative function in terms of projects funded by Conditional Grants within the SA Library for the Blind (SALB). This function will also facilitate budget allocation, track expenditure patterns for the provincial, national and donation funding, support and work collaboratively with the general finance section within the SALB, and the incumbent will report to the Office of the CFO. \n \nMinimum Requirements: \nA completed NQF 6 or higher-level qualification in Accounting/Finance. \n5 years working experience in an accounting/bookkeeping/financial administrative position, preferably in the public sector. \nIntermediate or higher-level experience in the Ms Office Suite, particularly MS Excel and Ms Word. \nSound knowledge and practical experience in computer based financial systems including but not limited to SAGE Pastel. \nThe ability to perform bookkeeping functions up to at least trial balance effectively and efficiently. \nGood understanding of accounting principles and ability to analyse financial statements and reports. \nAn ability to prepare, manage and review budgets, monthly, quarterly, annual and ad-hoc financial reports, including narrative reports thereto. \nGood working knowledge and exposure to budgeting and reporting to oversight bodies and National Treasury in terms of the customised reporting templates. \n \nOther skills and attributes: \nGood (English) written and verbal communication skills. \nA highly motivated, detail oriented and deadline driven individual who is well organised and able to prioritize workload. \nStrong time management skills, and multi-tasking ability. \nGood interpersonal skills. \n \nThe following competencies will be advantageous: \nAt least two years’ work experience in a supervisory capacity in a financial section within the Public Sector. \nGood working knowledge of GRAP, IFRS, the PFMA, Treasury Regulations, SCM and related Acts and prescripts. \nHaving worked and actively participated in Bid Processes (from preparation of specification documents, invitation of bids/tenders and quotations, tender and or specification briefing meetings, record management of SCM documents, participating in review and in adjudication committees, and other related functions. \nPrevious experience in internal and external audits, particularly in the Public Sector. \nPractical knowledge and exposure to preparation of AFS, and National Treasury financial templates. \nAn ability to inspect and advise on corrections required on payroll processing and statutory reporting in terms of payroll matters (e.g. Tax reconciliations, Workman’s Compensation, Statistical reporting, etc.). \nWorking experience of electronic banking processing. \nProven track record and experience in systems with proficiency in data analytics and report writing skills.",
        "All-inclusive Remuneration Package: R467 670 CTC per annum \n\n \nCandidates who meet the minimum requirements that would like to apply for the position should submit a Letter of application together with a Curriculum Vitae and certified copies of qualifications of his/her SA ID to: Ms Glynis Bentley at Sheldon Recruitment at email address glynisb@sheldon.co.za\nContact number 043 735 1773. \n \nClosing date for applications: 16:00 on 06 September 2024 \n \nPLEASE NOTE: \nApplications from suitably qualified candidates from designated groups, particularly persons with disabilities, youth and woman are encouraged. \nShort-listed candidates may be required to undergo competency testing. \nSALB reserves the right not to appoint any person to this position. \nOriginal certificates and/or testimonials may be requested from shortlisted candidates for verification purposes before confirming an appointment. \nCertification of documentation in support of this application may not be older than 6 months."
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p362d62d3-ffe4-426d-a52c-7c464519289a"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/samsa_orig.png",
      "href": "https://www.govpage.co.za/south-african-maritime-safety-authority-samsa-vacancies-blog/south-african-maritime-safety-authority-samsa-vacancies2331150",
      "title": "SOUTH AFRICAN MARITIME SAFETY AUTHORITY (SAMSA) VACANCIES",
      "content": [
        " \nSOUTH AFRICAN MARITIME SAFETY AUTHORITY (SAMSA)\n ",
        "RE-ADVERT VACANCY: MANAGER: APPLICATIONS MANAGEMENT GRADE: D3\nThe position reports to the Chief Information Officer.\nLOCATION: HEAD OFFICE, PRETORIA\n \nJOB PURPOSE\nLead in the conceptualization, design, development, implementation, quality assurance including continuous maintenance, and support of SAMSA applications that are developed in diverse technology platforms to enable optimal and efficient SAMSA operations including leading and monitoring a team of internal developers and those from third parties.\n \nKEY PERFORMANCE AREAS\nMonitor adherence to best practice methodologies with a focus on more optimal ways of work, towards attainment of the Centre for ICT’s Annual Performance Plan (APP) and SAMSA strategic objectives.\nLead in the development, maintenance, and support of SAMSA applications in line with applicable best practice standards, methodologies, and framework.\nLead in the transformation and modernisation of the SAMSA applications portfolio in alignment with technology changes.\nLead in the procurement of required software to ensure an optimal SAMSA applications portfolio.\nDevelop detailed project plans, including objectives, milestones, timelines, and resource allocation, to guide the implementation of the applications delivery plans.\nPropose cost effective approaches for management of SAMSA applications.\nEvaluate, develop, and test best practices and research the cost versus benefits for the applications portfolio.\nDesign, develop, obtain resources and approval to implement business continuity and recovery programs for all applications within the SAMSA applications portfolio.\nLead in the design of applications in accordance with approved design principles including functional and technical specifications.\nContribute to the development of technical / functional specifications to be used.\nConsult with the Business Analyst to inform the design of systems in accordance with approved user requirements specifications.\nObtain approval of functional and technical specifications by all interested parties through extensive consultations, testing and quality assurance.\nConfirm that the configuration of SAMSA applications are in accordance with applicable best practice standards and SAMSA applications architecture, structures, and taxonomies.\nDemonstrate a solid understanding of data architecture standards to ensure deployment of applications capabilities that meet the defined data architecture.\nStandardise applications development technology platforms across the applications portfolio including defining of application integration APIs, and data exchange protocols.\nLead in ensuring that applications are developed with incorporated cybersecurity principles and best practices to ensure secure SAMSA applications.\nWork with internal and external auditors or OEM to ensure that the applications which are implemented are thoroughly tested and quality assured.\nWork with external stakeholders/service providers to ensure that SAMSA applications attain high levels of standardisation and integration.\nDesign, develop, and implement maintenance procedures and processes to ensure optimal operations of the SAMSA applications.\nCoordinate applications training for all end users following change management procedures to implement system changes.\nImplement prompt remedial solutions as part of vulnerability and patch management.\nManage prompt resolution of all application related incident calls in line with set resolution timeframe.\nContribute to the maintenance of an updated ICT Risk Register and ensure that risk control/mitigation measures are implemented.\nParticipate in the development and testing of the Disaster Recovery Plan by ensuring that all systems in the portfolio are recoverable in the event of a disaster.\nProvide accurate reports on all annual / quarterly Disaster Recovery tests and implement any corrective steps related to DR testing.\nNegotiate terms and manage contracts with appointed service providers.\nMonitor SLAs and take corrective action when required.\nManage and monitor Operational Level Agreements between ICT and Business Units with focus on applications deliverables.\nPrepare and manage applications budget including project related budgets to ensure optimal utilization of resources in a cost-effective manner.\nMonitor expenditure.\nParticipate in developing and implementing ICT procurement plans.\nOversee ICT procurement processes related to applications.\nProvide leadership and direction that is aligned with the SAMSA culture and values.\nEstablish an enabling work environment and culture for optimum staff performance\nManage the performance, productivity, development, and wellbeing of the applications team.\nFacilitate synergy and co-ordination between the other delivery areas within the Centre for ICT.\n \nMINIMUM REQUIREMENTS\nQualifications\nNQF Level 7 in ICT. Qualification in the Applications Development or related specialisation.\nA higher qualification in ICT Applications or Software Development stream will be an added advantage.\nRequired certification or Professional Registration:\nEnterprise Architecture – Applications and Data Architecture\nBusiness Analysis\nProgramming Languages (.Net, JAVA, XCP and C#)\nSQL\nITIL\nCOBIT\nOpenText Certification (Documentum, xCP, xPression, xPlore, etc)\nMicrosoft Certification\nAdobe Certification (LiveCycle, AEM, etc)\n \nKnowledge and Experience\n7 - 10 years’ experience in Applications Development environment with advance understanding of diverse development platforms.\n3-5 years’ management experience in any of the following:\nArchitecture development and implementation\nDiverse development platforms such as:\nOpenText Documentum, Captiva Input Accel, xPression, XCP, xPlore.\nDocument Content Server including BAM.\nAdobe LiveCycle/AEM Forms and Content / Presenter.\nRecords Manager.\nC#, Java, M-V-C, Development.\nMobile and AI-assisted development practices\nKnowledge of Agile project delivery approaches\n \nCompetencies\nHigh levels of competence on the skills below is a requirement:\nSAMSA Strategy, ICT Strategy, and the ICT Business Plan\nSAMSA policies and procedures\nPOPI Act\nITIL Framework\nCOBIT 2019\nSQL\nDiverse development platforms – Microsoft, OpenText, Java, etc.\nSystem Development Life Cycle (SDLC)\nApplicable programming languages.\nIndustry best practices in application management.\nService management processes.\nApplicable Programming/Development language skills\nERP Environment.\nDocumentum Environment.\nAdobe LiveCycle Environment.\nMicrosoft Environment.\nExperience in designing and implementing reporting solutions.\nExperience in SQL\nProblem solving skills.\nCommunication skills.\nNegotiation skills.\nPresentation skills.\nProject management skills.\nStakeholder and SLA management.",
        "Should you meet the requirements as set out above, please e-mail your CV to Zanele Zwane at: recruitment@samsa.org.za\n\n \nAs we are committed to Employment Equity in our employment practices, it is our intention to appoint individuals with the aim of meeting our Equity objectives. Preference will be given to African Males, Indian Males, African Females, White Females, and persons living with disability to achieve the objectives of Employment Equity.\n \nCLOSING DATE: 14 SEPTEMBER 2024\n \nPlease note: SAMSA reserves the right not to make an appointment to any advertised position. No late applications will be considered. Psychometric and other assessments may be used as part of the selection process and all shortlisted candidates will be required to be available for the tests. If you have not been contacted within 1 month of the closing date as mentioned above, kindly deem your application unsuccessful."
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p162b7936-cc5c-4bee-89c5-e5e47edf9f06"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sanral_orig.jpg",
      "href": "https://www.govpage.co.za/south-african-national-roads-agency-sanral-vacancies-blog/south-african-national-roads-agency-sanral-vacancies8147741",
      "title": "SOUTH AFRICAN NATIONAL ROADS AGENCY (SANRAL) VACANCIES",
      "content": [
        " \nSOUTH AFRICAN NATIONAL ROADS AGENCY (SANRAL)\n ",
        "MANAGER: CONTRACTS & LEGAL ASSURANCE\nNational\nPermanent     \n \nDescription\n \nPOSITION OBJECTIVE\nThe successful candidate will be responsible for managing and overseeing the entire lifecycle of contracts and agreements, including drafting, vetting, reviewing, and negotiation. You will play a critical role in providing expert legal advice and assurance to SANRAL's Bid Committees throughout the tender process, ensuring compliance and sound decision-making at all bid stages. Additionally, you will lead, mentor, and develop a team of Legal Advisors and Legal Officers, fostering their growth and ensuring the delivery of high-quality legal services.\n \nMINIMUM REQUIREMENTS\nBachelor of Laws/ LLB at an NQF level 8.\nAdmitted Attorney or Advocate (with Pupillage from the Bar) of the High Court of SA, Member of the Law Society/ LPC.\nA minimum of 10 years relevant experience.\nA minimum of 5 years managerial experience.\nProven experience in drafting, reviewing, and negotiating a wide range of commercial contracts and various legal agreements.\n \nADVANTAGEOUS\nLLM and/or specialisation by experience would be advantageous\nCommercial and Contract Law\n \nWORKPLACE COMPETENCIES\nGovernmental landscape and regulations: Knowledge and understanding of the government and public sector landscape and the regulatory and legislative operating environment.\nCorporate legal knowledge: Knowledge and understanding of a wide scope of legislation which includes, but is not limited to the:\n           -Preferential Procurement Policy Framework Act,\n           -Public Finance Management Act,\n           -South African National Roads Agency SOC Limited Act,\n           -National Treasury’s Regulations,\n           -Constitution of the Republic of South Africa and all other related legislations.\n           -Companies Act\n           -Environmental Legislation\nEngineering legal knowledge: Knowledge and understanding of engineering-specific legislation with which SANRAL must comply, especially the FIDIC suite of contracts.\n \nKEY RESPONSIBILITIES\n \nContracts and Legal Assurance Planning and Management\nDevelop a contracts management and legal assurance workflow and operational plan to execute, manage and deliver the timely drafting, vetting, review and amendment of all contracts, agreements and addenda and for the provision of expert legal assurance for the commercial decisions of the business supporting the overarching business strategy and objectives in its commercial activities.\nDefine turnaround times for delivery on business requests for contracts support and commercial legal assurance.\nDevelop a performance management criterion to monitor and assess the contracts and assurance functionality and the implementation of operational plans and workflows.\nMonitor and report on the output of the unit and legal services provided to the business.\nOversee and assist with developing a contract and legal document management system.\n \nContract Drafting, Vetting, Review and Amendment\nDrive the provision of contracts services in various areas of expertise, including labour and employment, construction and engineering, real estate, procurement documents, land acquisition, and disposal.\nAdvise the business on all contractual matters, provide contract negotiation support, and comply with all laws, regulations, industry frameworks, guidelines and standards applicable to various contracts.\nAmend and update agreements in keeping with legal and regulatory developments within the relevant discipline.\nInterpret clauses and provide advice to project teams during the implementation phases of the contract.\nEnsure standard contracts are amended and drafted to be fit for purpose and comply with the legal landscape of the jurisdiction they will be executed and accord with legislative requirements.\nWhere necessary, guide and provide input on the co-drafting, reviewing, updating and negotiation of all types of contracts with SCM and oversee the facilitation of contract finalisation and storage.\nProvide guidance and support on engineering and construction-specific claims including delays, price acceleration claims, and change of work claims.\nProvide, and oversee the provision of advice on construction and engineering law, including infrastructure procurement and the drafting and administering of engineering contracts.\nDrive and ensure the contribution of legal counsel in developing SANRAL’s policies, procedures, and controls.\nProvide support to all SANRAL Commercial and Contracts Committees.\n \nLegal Assurance\nProvide business support to SCM during the tender processes, i.e. specification drafting, bid evaluation, adjudication, and pre-award stages.\nReview the tender processes from bid specification, advertising, closing, validity periods, evaluation, and adjudication for legal compliance of all aspects of the tender\nProvide assurance reports of the tender review to bid committees on the legality of the process, legal risks and procedural and legal deficiencies identified and advise/make recommendations to the business.\n \nManaging and Reporting of the Contracts and Assurance Unit\nAccountable to manage and report on operational functions and outputs.\nKeep records and manage contracts and assurance service requests.\nManage the equitable allocation of work and assign responsibilities to Legal Advisors and Officers as required.\nMonitor the execution and review assigned work and responsibilities and any delays in delivery and performance.\nEnsure timely procurement and appointment of external service providers.\nProvide weekly, monthly and quarterly reports to management on contractual and assurance matters.\nCompile memoranda and submission for contract management and assurance to the relevant committees of SANRAL.\nManage and supervise the overall performance of the unit.\n \n \nEMPLOYMENT REFERENCE CHECKS\nEmployment reference checks are a requirement as part of SANRAL’s recruitment and selection process. In order for SANRAL to conduct these checks a consent form needs to be completed and signed by the applicant. As an applicant of this position, you authorize SANRAL to process all the information provided for the purpose of your application for the position as well as the verification and record keeping of such credentials.\n \nPlease note that this is a confidential document and is intended for internal use by SANRAL’s Human resources department only. \n \nEMPLOYMENT EQUITY\nAppointments will be made in accordance with SANRAL’s Employment Equity plan.\nSANRAL reserves the right not to fill any position\n \nClosing date for applications:   05 September 2024\n \nLink to apply: https://career2.successfactors.eu/sfcareer/jobreqcareer?jobId=2503&company=southafr02\n \nEmployment Permanent\nLocation 48 Tambotie Avenue, Val-De-Grace, Pretoria, South Africa\nClosing Date 05/09/2024",
        "MANAGER: LITIGATION\nNational\nPermanent\n \nDescription\n \nPOSITION OBJECTIVE\nThe successful applicant will be responsible for leading and executing the Litigation and Alternative Dispute Resolution strategy within Legal Services. This includes managing and overseeing the performance of SANRAL's Litigation Unit and Litigation and Disputes Portfolio. The role involves overseeing and monitoring all litigation and disputes, managing the litigation budget, and implementing strategies to reduce litigation costs throughout the process. The candidate will provide leadership and guidance to Legal/Litigation Advisors and Legal Officers, ensuring their effective performance. Additionally, the role requires managing performance records, and preparing and presenting regular reports on operational litigation to the organisation.\n \nMINIMUM REQUIREMENTS\nA Bachelor of Laws / LLB qualification at an NQF level 8.\nAdmitted attorney or Advocate (with Pupillage from the Bar) of the High Court of SA, Member of the Law Society/ LPC\nA minimum of 10 years of relevant experience.\nA minimum of five years of managerial experience.\nDemonstrable record of litigation and litigation oversight and directing\n \nADVANTAGEOUS\nLLM and/or specialization by experience would be advantageous\n \nWORKPLACE COMPETENCIES\nLeadership skills: Ability to lead by example, employ strong business acumen, solid judgment, and integrity.\nCritical thinking: Ability to objectively analyse and evaluate issues and factual evidence in order to form judgements.\nContract vetting and management: Advanced skills and experience in drafting and vetting contracts, including service level agreements.\nLegal research: Ability to identify and retrieve relevant legal information/precedent to aid in the legal decision-making and/or execution process.\nCommunication skills: Good interpersonal skills, people skills, organising and communication skills.\nLitigation skills: Ability to manage and thoroughly execute all phases within the legal litigation process from investigation all the way through to settlement and appeal.\nAttention to detail: Ability to pay close attention to details and complete tasks with a high level of thoroughness, accuracy and completeness.\nOrganisation: Ability of to make efficient and effective use of time, energy and resources available by organising workloads and scheduling and prioritising tasks.\n \nKEY RESPONSIBILITIES:\n \nLitigation Strategy Development and Execution\nDevelop and implement the litigation strategy to provide an effective and efficient litigation service in managing SANRAL’s litigation demands.\nDevelop and maintain the litigation management and monitoring processes/ procedures to execute and measure the litigation unit’s performance of its responsibilities and functions.\nEstablish the measurement criteria to monitor the operational objectives and manage the performance of the litigation unit and the quality of the support it provides to the business in litigated and non-litigated disputes and matters.\nMonitor and report on litigation matters and performance deliverables in line with predefined measurement criteria and agreed performance objectives and implement the necessary mechanism to improve delivery and performance.\nIdentify litigation risks and implement the appropriate measures to mitigate and prevent the risk.\nManage the litigation budget and expenditure on legal fees.\n \nLitigation Management\nGuide the resolution of SANRAL issues and/or disputes through negotiation, mediation, arbitration, and litigation methods, as required.\nOversee the resolution of litigation instances including pre-suit negotiations, arbitrations, facilitations, and appeals as they may arise.\nAdvise on and guide the resolution of engineering and construction-specific claims/disputes including delays, price acceleration claims and change of work claims.\nOversee the resolution of FIDIC-Contract-related issues and/or disputes through adjudication, litigation, arbitration, mediation or negotiation, as required.\nProvide advice and defend SANRAL on infrastructure procurement matters emanating from tenders issued by SANRAL and provide advice and defend all other procurement matters and litigation.\nManage, assess and advise on the merits of litigated matters to determine if a settlement can be reached or the matter should proceed to court.\nAppoint, instruct and consult with external legal service providers within the correct internal procedure and PFMA requirements.\nManage service providers' performance and delivery of instruction.\nManage the litigation cycle from end-to-end and provide the appropriate instructions to avoid litigated matters becoming dormant.\nComply with court timelines and limit reliance on condonation, extensions, tendering of costs.\nConsult internal clients/business to obtain instructions, facts on the matter and report to the business on developments in their matters monthly and as and when required.\n \nRecovery of Costs\nManage and monitor the execution of judgments, orders, and awards in favour of SANRAL at the conclusion of a dispute/litigated matter.\nManage the recovery of costs awarded to SANRAL.\nEnsure legal bills are subjected to taxation/and or agreed fees and executed, engaging the services of a taxation consultant where necessary.\nRecord costs recovered and to be recovered and provide monthly and quarterly reports on the status.\n \nManagement & Reporting\nManage and report on operational litigation.\nKeep records and manage incoming litigation and pre-litigation disputes\nManage the equitable allocation of work and assign responsibilities to Legal Advisors and Legal Officers as required\nMonitor the execution and review assigned work and responsibilities and any delays in delivery and performance.\nEnsure timely procurement and appointment of external service providers to defend or institute legal action for SANRAL.\nProvide weekly, monthly, and quarterly reports to Management on litigation and active matters.\nCompile memoranda and submission for Litigation to the relevant committees of SANRAL.\n \n \nEMPLOYMENT REFERENCE CHECKS\nEmployment reference checks are a requirement as part of SANRAL’s recruitment and selection process. In order for SANRAL to conduct these checks a consent form needs to be completed and signed by the applicant. As an applicant of this position, you authorize SANRAL to process all the information provided for the purpose of your application for the position as well as the verification and record keeping of such credentials.\n\nPlease note that this is a confidential document and is intended for internal use by SANRAL’s Human resources department only.\n \nEMPLOYMENT EQUITY\nAppointments will be made in accordance with SANRAL’s Employment Equity plan.\n \nClosing date for applications: 05 September 2024\n \nLink to apply: https://career2.successfactors.eu/sfcareer/jobreqcareer?jobId=2502&company=southafr02\n \nEmployment\nPermanent\nLocation South African National Roads Agency SOC Ltd Head Office, Kuisis Street, Val-De-Grace, Pretoria, South Africa\nClosing Date 05/09/2024"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p6b01576f-ca2b-42ba-b582-06a2d73728db"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sanparks-logo_orig.png",
      "href": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies9483296",
      "title": "SOUTH AFRICAN NATIONAL PARKS (SANPARKS) VACANCIES",
      "content": [
        " \nSOUTH AFRICAN NATIONAL PARKS (SANPARKS)\n ",
        " \n \nOCCUPATIONAL HEALTH AND SAFETY OFFICER\nThe organisation requires the services of an Occupational Health and Safety Officer in the Human Capital Management Department. This position will be based at Groenkloof National Park, Pretoria.\nLocation Groenkloof National Park (Head Office)\n \nRequirements\nBe in possession of a Diploma in OHS. Degree: Health and Safety Management will be advantageous.\nShould have 1 to 3 years’ experience in OHS.\nShould have communication skill.\nProblem solving skill.\nInformation-sharing skill.\nPeople Management skill.\nNegotiation skill.\nShould be Computer Literacy.\nFinancial Management skill.\nConflict Management skill.\nPresentation and Facilitation skill.\nReport writing skill.\n \nResponsibilities\nDevelop and implement incident reporting systems and procedures.\nDraw up implementation monitoring and control systems.\nCoordinate periodic audits, workplace inspections, and surveillance schedules in line with the Corporate OHS policy.\nCompile periodic statistical information and reports.\nEvaluate all programmes and procedures periodically.\nConduct incident statistical analysis.\nProvide advice to the line on a consultative basis.\nCoordinate Malaria Control spraying by government officials at affected parks or areas within SANParks.\nLiaise with internal and external professional bodies and stakeholders.\n \n \nSalary R354 947.02– R579 755. 23\n \nHow To Apply\nInterested candidates who meet the above requirements should forward their applications accompanied by the required documentation listed below to the following:\nSmiley Riba\nEmail: smiley.riba@sanparks.org\nPostal Address: PO Box 787 PRETORIA 0001 Fax: 086 295 4078\n \nDocuments Required\nInterested persons who meet the above-stated qualifications should forward their applications which should consist of a cover letter, detailed Curriculum vitae, certified copies of qualification(s), and Identity Document (certified within the past 3 months) to the following address\n \nClosing Date 26 September 2024\n \n \n \n \n ",
        "MANAGER: FRAUD MANAGEMENT\nSANParks requires the services of a Manager: Fraud Management in the Enterprise Risk Management department. This position will be based at Groenkloof National Park, Pretoria\nLocation Groenkloof National Park (Head Office)\n \nRequirements\nHave a National Diploma or Degree in Forensic Investigation / Law / Forensic Auditing or equivalent qualification (NQF level 7).\nHave 4-6 years’ work experience in a Forensic Investigation Environment.\nCFE or FP membership will be advantageous.\nKnowledge of professional standards of the Associations of Certified Fraud Examiners or Institute of Commercial Forensic Practitioners\nKnowledge of Criminal Law, Criminal Procedures, and The Law of Evidence.\nKnowledge of the Prevention and Combating of Corrupt Activities Act.\nAn understanding of the Protected Disclosures Act.\nKnowledge of the Promotion of Access to Information Act.\nAn understanding of fraud risk management practices.\nKnowledge of SANParks policies and procedures.\nAn understanding of the Public Finance Management Act and Treasury Regulations.\nKnowledge of Government priorities, policies, and legislation.\nAn understanding of project management.\nAn understanding of personnel management.\nPlanning and organizing.\nCommunications skills.\nConflict management.\nPresentation skills.\nComputer skills.\nListening skills.\nHigh level of accuracy and attention to detail.\nAnalytical decision-making.\nForensic Investigation Skills.\n \nResponsibilities\nImplement the Fraud Prevention Plan, inclusive of the Policy and Strategy.\nContribute to the ethics maturity improvement and annual implementation plan.\nImplement the Whistleblowing SOP.\nImplement the Forensic Investigation SOP.\nReview and development of applicable governance documents.\nCoordinate and conduct fraud risk assessments and update the fraud risk profile.\nIdentify fraud risk response strategies.\nMonitor fraud risk response strategies.\nConduct forensic investigations within prescribed timeframes.\nMonitor and report on the implementation of recommendations resulting from investigations.\nManage the panel of forensic investigation service providers.\n \n \nPlease Note\nInterested persons who meet the above-stated qualifications should forward their applications which should consist of a cover letter, detailed Curriculum Vitae, certified copies of qualification(s), and Identity Document (certified within the past 3 months) to the below email.\nEmail : nomawethu.dudumashe@sanparks.org\n \nSalary\nR641 921.99 – R1 052 446.50\n \nHow To Apply\n \nClosing Date 17 September 2024",
        "WEB SYSTEMS ANALYST\nThe Organisation requires the services of a Web Systems Analyst in the Chief Operating Officer’s division. This position will be based at Groenkloof National Park, Pretoria.\nLocation Groenkloof National Park (Head Office)\n \nRequirements\nBSc Computer Science, or related qualification\n7-9 years Web Programming experience,5 years of which were in PHP programming\nLinux Apache MySQL, PHP.\nKnowledge of the Consumer Protection Act, Electronic, Communications and Transaction Act.\nKnowledge of the Conservation and Tourism related legislation will be an added advantage.\nWeb application development skills.\nObject orientated programming.\nProject management and leadership skills\nDatabase design and administration\nCommunication skills (written & verbal)\nAttention to detail\nAnalytical skills.\n \nResponsibilities\nLead and manage the design, development, testing implementation, and maintenance of all E-Business systems within an open-source environment (PHP, MySQL, JavaScript, HTML, etc.) according to relevant legislation and standards.\nConduct feasibility study, work prioritization, and capacity planning for web projects and observe the software development life-cycle (SDLC) from start to finish.\nDraw, implement and consistently enforce complete and thorough documentation within the E-Business environment.\nCoordinate all processes with internal and external stakeholders (tourism departments, hosting company, payment gateway, corporate bank, and corporate IT service provider) to define, document, and deliver integrated E-Commerce applications, components, and strategies.\nUpgrade existing infrastructure and align all applications with new technology.\nBe responsible for online security and risk management.\nEnhance the user experience (UX) of all E-Commerce systems.\nServe as a contingency for Senior Web Developer in all hands–on programming.\nEnhance the site for search engine optimisation and assist with marketing the website online.\n \n \nPlease Note\nInterested persons who meet the above-stated qualifications should forward their applications which should consist of a cover letter, detailed Curriculum Vitae, certified copies of qualification(s), and Identity Document (certified within the past 3months)\n \nHuman Resources Division\nSA National Parks\nPO Box 787\nPRETORIA\n0001\nFax: 086 295 4078\nE-mail: smiley.riba@sanparks.org\nSalary R557 046.70 – 913 281.72\n \nHow To Apply\nInterested candidates who meet the above requirements should forward their applications accompanied by the required documentation listed below to the following:\nSmiley Riba\nHCM\nEmail: smiley.riba@sanparks.org\nPostal Address: PO Box 787 PRETORIA 0001\n \nClosing Date 11 September 2024"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p96658783-05dd-471a-91d1-90937c3aebbd"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sita_orig.jpg",
      "href": "https://www.govpage.co.za/state-information-technology-agency-sita-vacancies-blog/state-information-technology-agency-sita-vacancies4120711",
      "title": "STATE INFORMATION TECHNOLOGY AGENCY (SITA) VACANCIES",
      "content": [
        " \nSTATE INFORMATION TECHNOLOGY AGENCY (SITA)\n ",
        " \n \nVACANCY - 1861 \nREFERENCE NR : VAC00852 \nJOB TITLE : Senior Project Manager \nJOB LEVEL : D3 \nSALARY : R 760 490 – R 1 140 736 \nREPORT TO : Programme Manager \nDIVISION : National and Regional Consulting \nDEPARTMENT : Cluster Business Management \nLOCATION : SITA Erasmuskloof \nPOSITION STATUS : 24 - Months – Fixed Term Contract (Internal & External) \n \nPurpose of the job \nTo manage complex SITA internal/external project(s) following the SITA project management methodology, within a defined service/product/customer portfolio under the supervision of a Programme Manager/Line Manager. To ensure effective management of the core business support environments. \nKey Responsibility Area\n• INITIATION PROJECT - Effectively applies project management principles to Initiate and Plan the project. \n• MANAGE PRODUCT DELIVERY - Manage product delivery to ensure successful delivery of the project. \n• PROJECT CONTROL - Monitor and Control project activities to ensure successful delivery of the project objectives within budget, scope, time and quality according to plan. \n• PROJECT CONTROL-FINANCE - Consolidate, Monitor and control Project costs and revenue to ensure delivery of the Project within budget and profitability guidelines. \n• PROJECT CONTROL-RISK - Monitor and Control project risks and issues. \n \nQualifications and Experience \nMinimum: 3- Year National Diploma / Degree in a relevant discipline - at least NQF level 6 \nCertification: Project Management Professional (PMP) and/or Prince 2 Practitioner Certification and/or Agile PM Practitioner. \nExperience: A minimum of 7-8 years working experience, including: • At least 4 years Project management experience managing complex projects, • At least 4 years working experience in an IT environment and • At least 4 years in public sector IT environment. \n \nTechnical Competencies Description \nKnowledge of: Public sector / Government organization; Information Technology management; ICT Services; System Engineering methods and Governance; Project Management Office (PMO) Management; Project management methodologies (PMBOK, Agile PM and Prince 2); PPM Governance. Computer Literacy: SITA Business Planning system (BPS), Oracle ERP; Project Schedule Management (PSM); Oracle Time & Labour (OTL); MS Office; MS Projects. \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 12 September 2024 \n \nDisclaimer \nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \n● If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n● Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n● It is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n● Only candidates who meet the requirements should apply. \n● SITA reserves the right not to make an appointment. \n● The appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \n● Correspondence will be entered to with shortlisted candidates only. \n● CV`s from Recruitment Agencies will not be considered. \n \n \n \n \n ",
        " \n \n \n \nVACANCY - 1862 \nREFERENCE NR : VAC00009 \nJOB TITLE : Programme Manager \nJOB LEVEL : D5 \nSALARY : R 986 492 – R 1 479 739 \nREPORT TO : HOD: Cluster Business Management \nDIVISION : National & Regional Consulting \nDEPARTMENT : Cluster Business Management \nLOCATION : SITA Erasmuskloof \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nTo manage one or more defined SITA Internal / External programmes according to the SITA Project Management methodology within a defined service/product/customer portfolio. To manage the project management office, business support office.\n \nKey Responsibility Areas \n• Effectively applies programme management principles to Initiate and plan the programme. \n• Direct and manage programme execution to ensure successful delivery of the programme and subsidiary projects. \n• Plan and optimize the effective utilization of resources throughout the programme. \n• Consolidate monitor and control programme and subsidiary project’s work to ensure successful delivery of the programme's objectives within budget, scope, time and quality according to plan. Including integrated change control and configuration management. \n• Consolidate, monitor and control costs and revenue to ensure the delivery of the programme and subsidiary projects within budget and profitability guidelines. \n• Perform quality control of programme. \n• To manage the provinces risk management, document & records management, ISO, internal audit reporting and ERP functions \n \nQualifications and Experience \n \nMinimum: 3-year National Diploma / Degree in a relevant discipline - at least NQF level 6 \nCertification: Project Management Professional (PMP) and/or Prince 2 Practitioner and/or Programme Management Professional (PgMP) and/or Advanced Practitioner (MSP – Managing Successful Programmes) will be advantageous. \nExperience: A minimum of 8 - 10 years working experience, including expertise in: \n• 4 years in a leadership role in a complex project management or programme management environment \n• 4 years Project/Programme management experience as Project /Programme Manager \n• 4 years in a public/private sector IT environment. \n• 4 years in risk management, internal audit reporting, document configuration management, management of ERP transactions. \n \nTechnical Competencies Description \nKnowledge of: Public/private sector; Information Technology management; ICT Services; Project Management Office (PMO) Management; PPM methodologies (PMBOK, Agile PM and Prince 2); PPM Governance. Computer Literacy: MS Office; MS Projects. Personal Attributes/Behaviours: Agility/Collaboration/Customer Centricity/Innovation/Empathy/Integrity. \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 12 September 2024 \n \nDisclaimer \nSITA is an Employment Equity employer and this position will be filled based on Employment Equity Plan. \nCorrespondence will be limited to short listed candidates only. Preference will be given to members of designated \n• If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n• Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n• It is the applicant`s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n• Only candidates who meet the requirements should apply. \n• SITA reserves a right not to make an appointment. \n• Appointment is subject to getting a positive security clearance, the signing of a balance score card contract, verification of the applicants’ documents (Qualifications), and reference checking. \n• Correspondence will be entered to with shortlisted candidates only. \n• CV`s from Recruitment Agencies will not be considered. \n \n \n \n \n ",
        " \n \n \n \n \nVACANCY - 1846 \nREFERENCE NR : VAC00254 \nJOB TITLE : Specialist: Production Planner \nJOB LEVEL : C4 \nSALARY : R 409 935– R 614 903 \nREPORT TO : Senior Engineer: Digital Printing \nDIVISION : IT Infrastructure Services \nDEPT : ITI Hosting: EDD \nLOCATION : SITA Centurion \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nTo manage and facilitate the automation of production processes for application systems to ensure client satisfaction during implementation. \n \nKey Responsibility Areas \nWrite and amend software procedures to automate the processing of application systems using the Automation suite of software. Quality assure the automated production before implementation. Management of automated departmental projects. Manage change control on production systems. Liaise with clients, management, technical staff and service providers to ensure that requirements are met. \n \nQualifications and Experience \nMinimum: 3-year Diploma / Degree in IT / NQF level 6. Certifications: Relevant Technical Courses. \nExperience: 3 - 4 years’ experience as Shift Leader. 3 years’ experience as a Printing/EDD Operator. \n \nTechnical Competencies Description \nKnowledge of: Application systems. Job Scheduling software. Automation Software. Printing/EDD Operating systems. Database Management Systems. Document Composition application knowledge. \nSkills: Communication and Interpersonal Skills; Problem solving and decision-making skills; Self-management; Client Orientation and customer service; Intellectual. \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process \n1. Register using your ID and personal information \n2. Use received one-time pin to complete the registration \n3. Log in using your username and password \n4. Click on “Employment & Labour \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 09 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on Employment Equity Plan. Correspondence will be limited to short listed candidates only. Preference will be given to members of designated groups. \nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant`s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves a right not to make an appointment. \nAppointment is subject to getting a positive security clearance, the signing of a balance score card contract, verification of the applicants documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered. \n \n \n \n \n ",
        " \n \n \n \n \n VACANCY - 1855 \nREFERENCE NR : VAC00891 & 0894 & 0262 & VAC00317 \nJOB TITLE : Specialist EUC Information System Security Operations X4 \nJOB LEVEL : C5 \nSALARY : R 478 420 - R 717 630 \nREPORT TO : Consultant: EUC Security \nDIVISION : Service Management \nDEPARTMENT : SM: EUC National \nLOCATION : SITA Erasmuskloof \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nThe job will be responsible to perform compliance and vulnerability assessments, execute activities related to the implementation, and maintenance of information security controls and services aligned to the cyber security framework and attend to all logged security incidents. \n \nKey Responsibility Area \nPerform ongoing monitoring of information systems and assess threats and risks to information security. \nCoordinate security awareness and training programs to increase employees ' overall understanding, reaction time and the ability to envisage the company's potential safety and compliance requirements. \nPerform compliance assessments and vulnerability assessments to ensure government and citizen information is secure. \nAttend to all logged security incidents. \nCollaborate and partner with internal business representatives to recommend appropriate products so that the solutions are developed with relevant security system design specifications. \nExecute activities related to the implementation, and maintenance of information security controls and services aligned to the cyber security framework, policies, standards and procedures. \n \nQualifications and Experience \nMinimum: 3 years National Diploma / National Degree in Computer Science or Information Technology or Network Management or a relevant discipline NQF level 6 qualification. Certified information system security professional (CISSP) or Certified Information Security Management (CISM). \nAdded Advantage: ITIL foundation and COBIT 5 Introduction. \nExperience: 3 to 5 years’ Information and Communication Technology (ICT) Infrastructure or Information Security (IS) or application life cycle management which should include the following: Working knowledge of information technology security configurations on the LAN/WAN infrastructure. Understanding of firewalls and switch management technology. Exposure to enterprise architecture frameworks (e.g. TOGAF; GWEA; MIOS). knowledge of governance processes and standards (e.g. ISO 27001/ 27002; COBIT; ITIL). Exposure to information system security technical standards (e.g.: SSL certificates, anti-virus protection, , firewalls, SCCM, Intune etc.) Experienced in (e.g. Service Management, Converge Communication, Risk Management, Information Technology, Applications, etc). \n \nTechnical Competencies Description \nKnowledge of: Information security management frameworks, such as ISO/IEC 27001, and NIST.and security services (firewalls, proxy’s, DNS, Mail relays etc.) Risk finance and risk control concepts. Enterprise risk management concepts, frameworks Deep understanding of operational integration of security functions. Strong knowledge of security, and network architecture. Deep knowledge of security best practices, principles, and common security frameworks. Excellent written and verbal communication skills and high level of personal integrity Knowledge of the latest IT thinking and threat modelling methods together with a creative drive. Analytical mind capable of managing numerous information sources and providing data analysis reports to senior management. Strong customer focus – able to meet the demands of internal and external customers. Excellent communication skills – providing verbal and written communication. Excellent Project management skills. Strong networking, consultation and negotiation skills Excellent Planning & organising Financial management Governance processes and standards (ISO 27001/ 27002, COBIT, ITIL). Proficiency in ICT technology securing and safeguarding (operating databases, applications, IS solutions). Knowledge of Cloud, Public Cloud security best practices and monitoring of systems and services hosted in the cloud (IaaS, SaaS etc.). Network security On-call network troubleshooting Firewall administration Network protocols Routers, hubs, and switches System administration skills. Security risk, threats and vulnerability management. Knowledge of Cloud, Public Cloud security best practices and monitoring of systems and services hosted in the cloud (IaaS, SaaS etc.). Working knowledge of Service Oriented Architecture (SOA); CISSP domains support (BCM/DRM, Legal, human resource, cryptography, access control, operations, architecture, etc.) Working knowledge of Enterprise architecture framework (TOGAF; Zachman; FEAF; MODAF; GWEA Framework; MIOS). Infrastructure (DELL/ HP/ IBM) and network security configuration. Operating systems administration (UNIX, WINDOWS, Linux) or security configuration. Database and application security configuration (Oracle, ERP, Web sites). \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \n\nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 09 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves the right not to make an appointment. \nThe appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered. \n \n \n \n \n ",
        " \n \n \n \n \nVACANCY - 1856 \nREFERENCE NR : VAC00318/25 \nJOB TITLE : Senior Specialist: EUC Information System Security Operations \nJOB LEVEL : D2 \nSALARY : R 651 627 - R 977 440 \nREPORT TO : Consultant: EUC Information System Security Operations \nDIVISION : Service Management \nDEPT : SM: EUC National Support \nLOCATION : SITA Erasmuskloof \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nThe job will be responsible to perform compliance and vulnerability assessments, execute activities related to the implementation, and maintenance of information security controls and services aligned to the cyber security framework and attend to all logged security incidents. \n \nKey Responsibility Areas \nExperience in Firewalls. \nPerform ongoing monitoring of information systems and assess threats and risks to information security; \nCoordinate security awareness and training programs to increase employees ' overall understanding, reaction time and the ability to envisage the company's potential safety and compliance requirements \nPerform compliance assessments and vulnerability assessments to ensure government and citizen information is secure \nAttend to all logged security incidents \nCollaborate and partner with internal business representatives to recommend appropriate products so that the solutions are developed with relevant security system design specifications \nExecute activities related to the implementation, and maintenance of information security controls and services aligned to the cyber security framework, policies, standards and procedures \nManagement and Administration. \n \nQualifications and Experience \nRequired Qualification: 3-year National Diploma / Degree in Computer Science or Information Technology or a relevant discipline verified / certified @ NQF level 6 qualification. Certified information system security professional (CISSP) or Certified Information Security Management (CISM) or Microsoft Azure Security Technologies\nAdded advantage: Certifications: ITIL foundation and COBIT 5 Introduction. \nExperience: 6-7 years Information and Communication Technology (ICT) Infrastructure or Information Security (IS) or application life cycle management which should include the following: Working knowledge of information technology security risk management; Exposure to enterprise architecture frameworks (e.g. TOGAF; GWEA; MIOS); knowledge of governance processes and standards (e.g. ISO 27001/27002; COBIT; ITIL); Exposure to information system security technical standards (e.g.: SSL certificates, anti-virus protection, firewalls, SCCM, Intune etc); Experienced in (e.g. Service Management, Converge Communication, Risk Management, Information Technology, Applications, etc.). \n \nTechnical Competencies Description \nKnowledge of: Information security management frameworks, such as ISO/IEC 27001, and NIST. and security services (firewalls, proxy’s, DNS, Mail relays etc.) Risk finance and risk control concepts. Enterprise risk management concepts and frameworks. Deep understanding of operational integration of security functions. Strong knowledge of security, and network architecture. Deep knowledge of security best, practices, principles, and common security frameworks. Excellent written and verbal communication skills and high level of personal integrity. Knowledge of the latest IT thinking and threat modelling methods together with a creative drive. Analytical mind capable of managing numerous information sources and providing data analysis reports to senior management. Strong customer focus – able to meet the demands of internal and external customers. Excellent communication skills –providing verbal and written communication. Excellent Project management skills. Strong networking, consultation and negotiation skills. Excellent Planning & organising. Financial management. Governance processes and standards (ISO 27001/ 27002, COBIT, ITIL). Proficiency in ICT technology securing and safeguarding (operating databases, applications, IS solutions). Knowledge of Cloud, Public Cloud security best practices and monitoring of systems and services hosted in the cloud (IaaS, SaaS etc.). Network security. On-call network troubleshooting. Firewall administration. Network protocols. Routers, hubs, and switches. System administration skills. Security risk, threats and vulnerability management. Knowledge of Cloud, Public Cloud security best practices and monitoring of systems and services hosted in the cloud (IaaS, SaaS etc.). Working knowledge of Service Oriented architecture (SOA); CISSP domains support (BCM/DRM, Legal, human resource, cryptography, access control, operations, architecture, etc.). Working knowledge of Enterprise architecture framework (TOGAF; Zachman; FEAF; MODAF; GWEA Framework; MIOS). Infrastructure (DELL/ HP/ IBM) and network security configuration. Operating systems administration (UNIX, WINDOWS, Linux) or security configuration. Database and application security configuration (Oracle, ERP, Websites). PFMA. \nTechnical competencies: IT Service management. \nInterpersonal/behavioural competencies: Active listening, Attention to Detail, and Continuous Learning. \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered. \n \nClosing Date: 09 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. EE Preference will be given to White/Coloured and Indian. \nIf you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \nApplications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \nIt is the applicant`s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \nOnly candidates who meet the requirements should apply. \nSITA reserves a right not to make an appointment. \nAppointment is subject to getting a positive security clearance, the signing of a balance score card contract, verification of the applicant’s documents (Qualifications), and reference checking. \nCorrespondence will be entered to with shortlisted candidates only. \nCV`s from Recruitment Agencies will not be considered. \n \n \n \n \n ",
        " \n \n \n \n \n \nVACANCY - 1860 \nRe - Advertisement \nREFERENCE NR : VAC01363 \nJOB TITLE : Specialist: EUC Infrastructure Implementation \nJOB LEVEL : C5 \nSALARY : R 478 420 - R 717 630 \nREPORT TO : Consultant: EUC Infrastructure Implementation \nDIVISION : Service Management \nDEPARTMENT : EUC SM: DOD \nLOCATION : SITA Erasmuskloof \nPOSITION STATUS : Permanent (Internal & External) \nPurpose of the job \nTo implement, evaluate, test and integrate hardware, software solutions and commissioning of distributed LANWAN products services. \n \nKey Responsibility Area \n• Implement tested solutions. \n• Provide Advanced Technical support \n• Quality Assurance. \n• Provide hardware and software technical advice on technology and related IT infrastructure \n \nQualifications and Experience \nMinimum: 3-year Diploma/Degree in Computer Science NQF 6, IT or related fields. \nCertification: MCSA or MCSE \nExperience: 3 to 5 years’ experience Years ICT working experience in the respective field including the following: ICT Infrastructure implementation and support LAN Security skills. ITIL. Project Coordination and Management Experience in the provision of ICT solutions and services. \n \nTechnical Competencies Description \nKnowledge of: Directory services, Architecture and Policy management. DNS, E-Mail, software deployment, Patch management, Core Stack builds. VPN technologies and concepts. Disaster Recovery. Virtualisation technologies and concepts. Computer and network security principles. Operating System Stack builds (OS Imaging). Service Level Management. Proficiency in managing, commissioning and maintenance of Core Server. Infrastructure and Services (Patch management, Antivirus, DNS, DHCP, Agents etc.) and Unified Communications. \nOther Special Requirements N/A\n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 09 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \n● If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n● Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n● It is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n● Only candidates who meet the requirements should apply. \n● SITA reserves the right not to make an appointment. \n● The appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \n● Correspondence will be entered to with shortlisted candidates only. \n● CV`s from Recruitment Agencies will not be considered. \n \n \n \n ",
        "VACANCY - 1859 \nREFERENCE NR : VAC00806 \nJOB TITLE : Specialist: ETDP \nJOB LEVEL : C5 \nSALARY : R 478 420 – R 717 630 \nREPORT TO : Consultant: ETDP \nDIVISION : ADM Exec Apps Development & Maintain Department : Application Training \nLOCATION : SITA Centurion \nPOSITION STATUS : Permanent (Internal & External)\n \nPurpose of the job \nTo deliver a total training service according to the training development cycle and best practices, including e-learning solutions. \n \nKey Responsibility Areas \n• Design, develop and maintain training material, including e-learning. \n• Present training by using a variety of methodologies. \n• Knowledge transfer. \n• Comply with SITA corporate and departmental policies and business processes. \n• System testing. \n• Identify and report service risks. \n• Project involvement. \n \nQualifications and Experience \nRequired Qualification: 3-year National Diploma / Degree in Education, Training and Development Practices (ETDP) OR BA / BSc / BCom / BIT / BCompSc / BTech (NQF Level 6) plus an ETDP related Certificate. \nExperience: 3 - 5 years' experience in a training environment, of which at least 2 years is in an application/IT- related training environment. \nTechnical Competencies Description \nKnowledge of: IT/IS application training environment and training cycle; E-learning design and development; Client’s business culture, processes, policies and procedures; Various training methodologies and technologies; Current training legislation; Training quality standards; Assessment methodologies and tools. \nInterpersonal/behavioural competencies: Attention to Detail; Analytical thinking; Continuous Learning; Disciplined Resilience and Stress Management. \nOther Special Requirements N/A\n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \n \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered. \n \nClosing Date: 06 September 2024 \n \nDisclaimer \nSITA is an Employment Equity employer and this position will be filled based on Employment Equity Plan. Correspondence will be limited to short listed candidates only. Preference will be given to members of designated groups.\n• If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n• Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n• It is the applicant`s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n• Only candidates who meet the requirements should apply. \n• SITA reserves a right not to make an appointment. \n• Appointment is subject to getting a positive security clearance, the signing of a balance score card contract, verification of the applicant’s documents (Qualifications), and reference checking. \n• Correspondence will be entered to with shortlisted candidates only. \n• CV`s from Recruitment Agencies will not be considered.",
        "VACANCY - 1858 \nREFERENCE NR : VAC00764 \nJOB TITLE : Senior Software Developer \nJOB LEVEL : D2 \nSALARY : R 651 627 - R 977 440 \nREPORT TO : Advance Software Developer \nDIVISION : Application Maintenance \nDEPARTMENT : AM: SAPS Unique \nLOCATION : SITA Centurion \nPOSITION STATUS : Permanent (Internal & External) \n \nPurpose of the job \nTo lead the design, implementation, debugging, documentation, release and maintenance of software-based solutions, write code and enhance software/systems in accordance with ICT standards and the enterprise architecture for Government. \n \nKey Responsibility Area \n• Lead the design and development of new features for the software systems, and improvement of the existing ones. \n• Implementation, debugging, documentation and release of the software solutions.\n• Provide maintenance and enhancement support of the existing systems. \n• Perform software systems coding assignments. \n• Supervision of the Software development team. \n \nQualifications and Experience \nMinimum: 3-year National Diploma/ Bachelor's degree in ICT (Computer Science, Information Systems, Technology and Engineering) or related field. \nExperience: 6 - 7 years’ experience with full software development lifecycle (SLDC), including solution development, operational responsibility in a large corporate/public sector organisation. Understanding of user requirement process Knowledge of Microsoft C#, Microsoft SQL Server, (off the shelf Codis software will be an added advantage) software development process and its technologies computer science including algorithms, data structures, operating systems and databases. Knowledge to design and develop test plans and software simulator to facilitate different levels of testing. Knowledge to report the results of different levels of testing report, the discrepancies between the software and its related documents. Extensive experience with working on multiple tasks and report status. Experience in interacting with customers. \n \nTechnical Competencies Description \nUnderstanding of user requirement process Knowledge of Microsoft C# and Codis software development process and its technologies computer science including algorithms, data structures, operating systems and databases. Knowledge to design and develop test plans and software simulator to facilitate different levels of testing. Knowledge to report the results of different levels of testing report, the discrepancies between the software and its related documents. Development methodologies (e.g. RUP, OpenUp, Agile), SDLC COTS (Commercial of the Shelf) Products Security (Software and Technologies). Comprehensive knowledge of software testing techniques and tools Comprehensive knowledge and experience with one or more of the major programming languages BCobol and Cobol. Comprehensive knowledge and experience with one or more of the major database systems Oracle. Comprehensive Team-working experience. \nTechnical Competencies: Application Development, Application Maintenance and Support, Database Administration. \n \n \nHow to apply \nTo apply please log onto the e-Government Portal: www.eservices.gov.za and follow the following process; \n1. Register using your ID and personal information; \n2. Use received one-time pin to complete the registration; \n3. Log in using your username and password; \n4. Click on “Employment & Labour; \n5. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs; \nOr, if candidate has registered on eservices portal, access www.eservices.gov.za, then follow the below steps: \n1. Click on “Employment & Labour; \n2. Click on “Recruitment Citizen” \n3. Login using your username and password \n4. Click on “Recruitment Citizen” to create profile, update profile, browse and apply for jobs \nFor queries/support contact egovsupport@sita.co.za OR call 080 1414 882 \nCV`s sent to the above email addresses will not be considered \n \nClosing Date: 06 September 2024 \n \nDisclaimer\nSITA is an Employment Equity employer and this position will be filled based on the Employment Equity Plan. Correspondence will be limited to shortlisted candidates only. Preference will be given to members of designated groups. \n● If you do not hear from us within two months of the closing date, please regard your application as unsuccessful. \n● Applications received after the closing date will not be considered. Please clearly indicate the reference number of the position you are applying for. \n● It is the applicant's responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA). \n● Only candidates who meet the requirements should apply. \n● SITA reserves the right not to make an appointment. \n● The appointment is subject to getting a positive security clearance, the signing of a balance scorecard contract, verification of the applicants’ documents (Qualifications), and reference checking. \n● Correspondence will be entered to with shortlisted candidates only. \n● CV`s from Recruitment Agencies will not be considered."
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "p05d343e7-bf8c-4fd2-b0af-36d078797bc4"
    },
    {
      "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/umalusi_orig.jpg",
      "href": "https://www.govpage.co.za/umalusi-vacancies-blog/umalusi-vacancies8837689",
      "title": "UMALUSI VACANCIES",
      "content": [
        " \nUMALUSI\n \nUmalusi, the Council for Quality Assurance in General and Further Education and Training is a statutory Quality Council which quality assures education provision in General and Further Education and Training. This body seeks to appoint suitable persons with the relevant qualifications and experience to the following posts. The Council intends to promote representivity through the filling of these posts.\n ",
        "ASSISTANT MANAGER: EVALUATION AND ACCREDITATION EVALUATION AND VERIFICATION\nReference Number EA/09/02\n \nRequirements\nAn appropriate recognised four year post-matric qualification in education, Current registration with the South African Council for Educators. At least three years’ recent working experience in an environment offering the NSC/CAPS and three years’ middle management experience in a school / college environment. Required skills: The successful applicant must have proven understanding, knowledge and experience of all pieces of legislation that inform Umalusi’s work as a Quality Council, the uniqueness of independent schools and private colleges. Accreditation, monitoring and evaluation systems and processes. Good verbal and written English communication and report writing skills. Sound training and facilitation skills, project management, coordination and strong administration skills. The successful applicant must, be dynamic, self-motivated, and self-managing. Have the ability to work under pressure as an individual and in a team, be willing to travel regularly and extensively and also to work extra hours and/or after hours, have the ability to work within tight timelines, hold a valid driver’s license and have their own vehicle and have extensive computer literacy skills (Microsoft Word, Excel, PowerPoint, Outlook, and Teams), be able to coordinate and conduct online meetings. \nAdditional Advantages: A post-graduate education qualification. Experience working in an independent school or private college. Experience working as an Umalusi Subject Specialist/Evaluator dealing with the evaluation and accreditation of independent schools or private colleges. Experience in teaching/lecturing in a private college offering a qualification on the General and Further Education and Training Qualifications Sub-framework.\n \nDuties\nImplementation of a system to maintain and extend the evaluation, accreditation, and monitoring of independent schools and private colleges, including, but not limited to, developing and maintaining a database for independent schools and private colleges. Developing accreditation, monitoring and evaluation instruments and manuals. Assisting in the development of accreditation and monitoring policies and procedures. Generating and editing evaluation reports, planning and coordinating site visits and the related reporting. Arranging and facilitating workshops. Establishing and maintaining sound relations with independent schools, private colleges and other relevant stakeholders. Performing any other tasks that are reasonably assigned by the supervisor.\n \nNotes\nEnquiries: HCM at (012) 030 0735/36. Interested persons may visit the Umalusi website: www.umalusi.org.za to view the full job advertisements and download the application form. \n \nApplications must be forwarded to the following email address: Recruit.ASM-EAV@umalusi.org.za.\n \nUmalusi is an equal opportunity and affirmative action employer, and all appointments will be made in accordance with the organisation’s Employment Equity Plan to promote its representivity (race, gender and people living with disability). Correspondence will be limited to shortlisted candidates only. Umalusi reserves the right not to appoint. Failure to attach the fully completed Umalusi application form (not Z83) and your CV (excluding supporting documents) will result in your application being disqualified. \n \nThe closing date for applications is 13 September 2024 at 16h00.\nSalary (per annum): R 500,205\nClosing Date: 2024-09-13",
        "STATISTICIAN: STATISTICAL INFORMATION AND RESEARCH\nReference Number SSIR/09/01\n \nRequirements\nA master’s degree in Statistics. At least five (5) years of appropriate experience in Statistics. At least 3 years at the middle managerial level. At least 3 years’ experience using Statistical Analysis System (SAS) software. Required skills: Advanced skills in Microsoft Word, Excel, Access, and PowerPoint. Ability to conduct independent research, experience in sampling, questionnaire designs, data analysis, and report writing. Advanced verbal and written communication skills. Ability to compile strategic documents. Ability to draft, maintain, and implement policies. Proven experience in conference presentations. The candidate should be dynamic, self-motivated, self-managing, and capable of working under pressure. A valid driver’s license and own transport is essential. \n\nAdditional advantages: A PhD degree in statistics. Experience working in the education sector. Experience in the use of SQL.\n \nDuties\nThe successful candidate will manage the statistical aspects of all research conducted by Umalusi. Initiate and conduct research. Maintain adequate databases for the extensive analysis of assessment results, and design and work with all of Umalusi’s units in terms of their statistical requirements. Lead the conceptualisation and theoretical framing of quantitative research initiatives. Write concept notes, research reports, and position papers where needed. Present research findings both within the organisation and at public events. Review draft research outputs produced in-house and by external researchers. Assist with the standardisation processes of candidates' raw marks. Build staff capacity in preparation for conferences. Contribute to the preparation of quarterly reports.\n \nNotes\nEnquiries: HCM at (012) 030 0735/36. Interested persons may visit the Umalusi website: www.umalusi.org.za to view the full job advertisements and download the application form. \nApplications must be forwarded to the following email address: Recruit.SSIR@umalusi.org.za.\n \nUmalusi is an equal opportunity and affirmative action employer, and all appointments will be made in accordance with the organisation’s Employment Equity Plan to promote its representivity (race, gender and people living with disability). Correspondence will be limited to shortlisted candidates only. Umalusi reserves the right not to appoint. Failure to attach the fully completed Umalusi application form (not Z83) and your CV (excluding supporting documents) will result in your application being disqualified. \n \nThe closing date for applications is 13 September 2024 at 16h00.\nSalary (per annum): R 875,388\nClosing Date: 2024-09-13"
      ],
      "postedDate": "3/9/2024",
      "iframe": "",
      "uuid": "pab0fdf49-5714-442d-b3d1-310ce8a59d0b"
    }
  ],
  "departments": {
    "joe gqabi district municipality vacancies": "https://www.govpage.co.za/joe-gqabi-district-municipality-vacancies-blog/joe-gqabi-district-municipality-vacancies1416151",
    "king sabatha dalindyebo local municipality vacancies": "https://www.govpage.co.za/king-sabatha-dalindyebo-local-municipality-vacancies-blog/king-sabatha-dalindyebo-local-municipality-vacancies9977373",
    "kouga local municipality vacancies": "https://www.govpage.co.za/kouga-local-municipality-vacancies-blog/kouga-local-municipality-vacancies9698822",
    "nelson mandela bay metropolitan municipality vacancies": "https://www.govpage.co.za/nelson-mandela-bay-metropolitan-municipality-vacancies-blog/nelson-mandela-bay-metropolitan-municipality-vacancies6646292",
    "metsimaholo local municipality vacancies": "https://www.govpage.co.za/metsimaholo-local-municipality-vacancies-blog/metsimaholo-local-municipality-vacancies7416475",
    "thabo mofutsanyane district municipality vacancies": "https://www.govpage.co.za/thabo-mofutsanyane-district-municipality-vacancies-blog/thabo-mofutsanyane-district-municipality-vacancies1789343",
    "city of umhlathuze municipality vacancies": "https://www.govpage.co.za/city-of-umhlathuze-municipality-vacancies-blog/city-of-umhlathuze-municipality-vacancies9173458",
    "umgungundlovu district municipality vacancies": "https://www.govpage.co.za/umgungundlovu-district-municipality-umdm-vacancies-blog/umgungundlovu-district-municipality-vacancies7380309",
    "city of polokwane municipality vacancies": "https://www.govpage.co.za/city-of-polokwane-municipality-vacancies-blog/city-of-polokwane-municipality-vacancies2721997",
    "makhudutamaga local municipality vacancies": "https://www.govpage.co.za/makhudutamaga-local-municipality-vacancies-blog/makhudutamaga-local-municipality-vacancies8673836",
    "city of matlosana local municipality vacancies": "https://www.govpage.co.za/city-of-matlosana-local-municipality-vacancies-blog/city-of-matlosana-local-municipality-vacancies4662714",
    "commission for conciliation, mediation and arbitration (ccma) vacancies": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies4992553",
    "legal aid vacancies": "https://www.govpage.co.za/legal-aid-vacancies-blog/legal-aid-vacancies7477378",
    "mintek vacancies": "https://www.govpage.co.za/mintek-vacancies-blog/mintek-vacancies1728148",
    "national credit regulator (ncr) vacancies": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies8621798",
    "national development agency (nda) vacancies": "https://www.govpage.co.za/national-development-agency-nda-vacancies-blog/national-development-agency-nda-vacancies1797428",
    "national home builders registration council (nhbrc) vacancies": "https://www.govpage.co.za/national-home-builders-registration-council-nhbrc-vacancies-blog/national-home-builders-registration-council-nhbrc-vacancies4799202",
    "private security industry regulatory authority (psira) vacancies": "https://www.govpage.co.za/private-security-industry-regulatory-authority-psira-vacancies-blog/private-security-industry-regulatory-authority-psira-vacancies6229403",
    "social housing regulatory authority (shra) vacancies": "https://www.govpage.co.za/social-housing-regulatory-authority-shra-vacancies-blog/social-housing-regulatory-authority-shra-vacancies5605689",
    "south african forestry company (safcol) vacancies": "https://www.govpage.co.za/south-african-forestry-company-safcol-vacancies-blog/south-african-forestry-company-safcol-vacancies9300680",
    "south african library for the blind (salb) vacancies": "https://www.govpage.co.za/south-african-library-for-the-blind-salb-vacancies-blog/south-african-library-for-the-blind-salb-vacancies8951464",
    "south african maritime safety authority (samsa) vacancies": "https://www.govpage.co.za/south-african-maritime-safety-authority-samsa-vacancies-blog/south-african-maritime-safety-authority-samsa-vacancies2331150",
    "south african national roads agency (sanral) vacancies": "https://www.govpage.co.za/south-african-national-roads-agency-sanral-vacancies-blog/south-african-national-roads-agency-sanral-vacancies8147741",
    "south african national parks (sanparks) vacancies": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies9483296",
    "state information technology agency (sita) vacancies": "https://www.govpage.co.za/state-information-technology-agency-sita-vacancies-blog/state-information-technology-agency-sita-vacancies4120711",
    "umalusi vacancies": "https://www.govpage.co.za/umalusi-vacancies-blog/umalusi-vacancies8837689"
  }
}
